[
    {
        "id": "1k1olab",
        "title": "Question about the CRBA process. Easiest way to prove residency?",
        "score": 0,
        "num_comments": 5,
        "author": "polyknike",
        "created_utc": 1744926221.0,
        "created_readable_utc": "2025-04-17 21:43:41 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1k1olab/question_about_the_crba_process_easiest_way_to/",
        "permalink": "https://reddit.com/r/USCIS/comments/1k1olab/question_about_the_crba_process_easiest_way_to/",
        "selftext": "My child was recently born abroad and I'm in the process of CRBA. But since I'm currently living abroad, many of the documents like high school diploma and university transcripts are not with me. Are there any other documents I can use to prove my U.S. Citizenship? Documents I can just print out and bring to the embassy? Or does everything have to be the original? Please advise, thanks! And how many documents do I need to prove I lived in America for over 20 years?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "1k0r4hp",
        "title": "Need help figuring out if I need a Certificate of Citizenship (adoption situation)",
        "score": 2,
        "num_comments": 15,
        "author": "Dokaville",
        "created_utc": 1744826803.0,
        "created_readable_utc": "2025-04-16 18:06:43 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1k0r4hp/need_help_figuring_out_if_i_need_a_certificate_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/1k0r4hp/need_help_figuring_out_if_i_need_a_certificate_of/",
        "selftext": "I’m trying to figure out whether I need to apply for a Certificate of Citizenship and would really appreciate any advice or insight from people who’ve gone through something similar.\n\nHere’s my situation:\n\n* I was **born abroad** to a **U.S. citizen biological parent**, and was issued a **CRBA (Consular Report of Birth Abroad)** way back when, no longer have it, filled out an affidavit form last year still haven't received it.\n* I was later **adopted** by a different U.S. citizen after the age of **5**.\n* Because of the adoption, my **birth certificate was filed/reissued about 5 years after I was born**, so it doesn’t meet the 1-year requirement that some federal agencies (like the passport office) ask for when proving citizenship.\n* The **CRBA most definitely lists my biological parents**, not the adoptive ones.\n* I’ve been told I **can’t rely on the birth certificate** alone because of the 5 year delay of filing the birth certificate, and the CRBA isn’t enough in my current situation.\n\nI’m trying to get everything in order to prove my U.S. citizenship, but I’m kind of stuck. Do I need to file for a **Certificate of Citizenship (Form N-600)**? Has anyone else gone through something like this? I've been turned around so many times and am at a loss of words on what to do.\n\nWould love to hear from anyone who has dealt with citizenship proof after adoption.\n\nThanks in advance!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
 
    {
        "id": "1jwnmut",
        "title": "Wife is 8 weeks pregnant. How soon do we file for CRBA? (Mexico)",
        "score": 0,
        "num_comments": 2,
        "author": "8647742135",
        "created_utc": 1744371193.0,
        "created_readable_utc": "2025-04-11 11:33:13 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jwnmut/wife_is_8_weeks_pregnant_how_soon_do_we_file_for/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jwnmut/wife_is_8_weeks_pregnant_how_soon_do_we_file_for/",
        "selftext": "FS-240 right? We are in Tijuana ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "1jrswiu",
        "title": "Ciudad Juárez consulate interview and general info. Wife approved today. I130 IR1",
        "score": 6,
        "num_comments": 9,
        "author": "evyad",
        "created_utc": 1743818862.0,
        "created_readable_utc": "2025-04-05 02:07:42 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jrswiu/ciudad_juárez_consulate_interview_and_general/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jrswiu/ciudad_juárez_consulate_interview_and_general/",
        "selftext": "I'm posting this as info for others that we wish we knew ahead of time. My wife had her interview today and was approved. I'll post our timeline as well. We're currently waiting on her daughter's i130 paperwork for over a year now. Apparently it's taking about 16-17 months for approval then we still have to wait for NVC appointment. At least next time we come to Juárez we're more well informed.\n\nREMEMBER EVERYONE HAS A DIFFERENT SITUATION. THIS IS HOW OURS WENT.\nMy wife had entered the US as a 4 year old illegally and returned to Mexico at 16 voluntarily, we disclosed this in our application. Nothing else going on at any time since. However we have an 18 month old daughter who we registered a CRBA for since she was born in Mexico.\n\nTimeline IR1 visa: \n\nSeptember 2022 filed all paperwork.\nAugust 2023 I130 approved. Sent to NVC.\nFebruary 2024 DQ through NVC. Only reason this took longer is we were waiting. Could've been done much sooner. \nFebruary 28th 2025 received interview letter from NVC for April 3rd.\nMarch 30th arrival in Juárez.\nMarch 31st medical exam. \nApril 1st biometric.\nApril 3rd paperwork review.\nApril 4th actual interview.\n\nThings to know about Juarez..\n\nYou do not need to stay exactly at the consulate area. We stayed about 10 minutes from the airport on Zaragoza and used the buses. It's incredibly easy and cheap at 12 pesos per person and as long as you don't leave the platform you don't pay for the next bus. You can also use Uber or Didi as well. Didi is usually cheaper. Plus your medical exam place will send a shuttle or Uber for you. A Didi to the consulate was between 60-100 pesos.\nThere was an Smart, soriana, Walmart, Cinépolis and numerous food options around the area within a 10 minute walk depending on where you are. The area also was a little nicer than the consulate area. \nIf you're looking for ease of access though to everything then the consulate area is where you want to be.\n\nAvoid the center. We went there to check it out one day on the bus and only stayed for about 10 minutes. We felt like we were going to get robbed if not possibly killed. It was that bad. Everyone looked at us strange and it was a totally awkward vibe. We currently live in Reynosa and have never felt that way anywhere in the city. So that should tell you something.\n\nYou will most likely need every single vaccine regardless of whether you have proof from IMSS or not. They do not care about that at all. We saw numerous people who had their IMSS card with proof and still got all of them. My wife needed all 4 for her age group. The total price came out to 585$. Both clinics are the same price whether it's SMF or CMI.\n\nYou can arrive to your biometric appointment early. It doesn't really matter as long as you have your appointment and all your paperwork plus passport. Wife had 300 appointment and we got there at 1. It literally only takes 15 minutes tops to do everything. Fingerprints and photos and that's it. \n\nFor the paperwork review they didn't ask her for much of anything aside from ORIGINALS of both of our birth certificates, her divorce certificate and our marriage certificate plus her passport. They never brought up tax returns, AOS, W2 or anything else. We made copies of so many things and never even needed them. We had got a joint sponsor to fill out an I864 cause I missed a lot of work last year and didn't make what I was prior. However we didn't even need it.\nI would still bring anything you feel is pertinent to your case to the document review and then the actual interview. Just don't be surprised if they don't ask for any of it. They didn't even ask for proof of relationship etc. It felt incredibly anticlimactic after all the stress and anxiety.\n\nFor the interview they didn't ask for any of the paperwork except what they clipped together the day before. Also if you can do your interview in English I highly recommend doing so. My wife said the entire interview vibe shifted after she switched to English. Her English is pretty much flawless and he asked if she was sure she hadn't entered the US again after leaving. He only asked like 6 or 7 questions at the interview.\nWho was petitioner? How many kids we have? Where does petitioner live? Have any of her kids crossed into US? Where are you going to live if approved? Where were kids born at? How did you get into US first time and have you returned since 2010?\nAnd that was it. Again never asked for any of the documents we brought. Highly anticlimactic.\n\nArrive at 6am or earlier regardless of what time your appointment is for both interviews. People literally arrive at 430 or 5am to line up. If you come right before your appointment time you'll be waiting for a while. We arrived at 6am both days and she was out before 10am. There's a circle k convenience store right there where everyone waits at or a Starbucks across the street.\nYou can literally feel the anxiety of people waiting for their person to come out. I saw a lot of people come out with 221g AP blue slips while I was waiting however my wife said a lot of the computers were freezing while she was in there. So they were giving them to people who had that happen as well as those who actually went into AP.\nYou hear everyone decision and case while you wait it's windows like a bank that you just go up to. Some people went in dressed fancy etc but I don't think that matters honestly. It's up to you though. \n\nLike I said everyone has different circumstances with their case and ours was very very straightforward. We came prepared with copies of a lot of documents but never needed them. However it's better to be prepared and not need than to need and not have. \n\nPlease feel free to ask any questions you may have and I'll do my best to answer all of them.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1jok7k2",
        "title": "Child of a U.S. Citizen born abroad.",
        "score": 1,
        "num_comments": 13,
        "author": "Malerba_",
        "created_utc": 1743471859.0,
        "created_readable_utc": "2025-04-01 01:44:19 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jok7k2/child_of_a_us_citizen_born_abroad/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jok7k2/child_of_a_us_citizen_born_abroad/",
        "selftext": "I got my Citizenship through naturalization and currently living in the USA. My fiancée (non U.S. Citizen living abroad) and I are expecting our baby in the next coming. I read about the CRBA, but it's still unclear. Has anyone been in the same situation and how did you manage to get the CRBA for the kid and the U.S passport?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    {
        "id": "1jeulsy",
        "title": "CRBA OR IR2",
        "score": 1,
        "num_comments": 1,
        "author": "gnomieatthemall",
        "created_utc": 1742383074.0,
        "created_readable_utc": "2025-03-19 11:17:54 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jeulsy/crba_or_ir2/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jeulsy/crba_or_ir2/",
        "selftext": "Hello. Do I need a CRBA denial letter first? Before applying for my daughter’s immigrant visa? I am sure that I do not qualify for the physical presence requirement.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1jbj9h7",
        "title": "Visit visa of infant while immigration underway",
        "score": 1,
        "num_comments": 3,
        "author": "That_Emotion_1674",
        "created_utc": 1741999929.0,
        "created_readable_utc": "2025-03-15 00:52:09 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jbj9h7/visit_visa_of_infant_while_immigration_underway/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jbj9h7/visit_visa_of_infant_while_immigration_underway/",
        "selftext": "Are their any couples who took their infant to US on visit visa when infant immigration was underway. Duaghter is 3 months old. Mom has just been granted immigration status (have to travel by 30 june 2025),dad us national. Crba rejected due to 5 year physical presence rule. Help needed",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1j6oc2v",
        "title": "CRBA: Unable to get form DS-5507 notarized",
        "score": 2,
        "num_comments": 1,
        "author": "AnaBlack01",
        "created_utc": 1741460759.0,
        "created_readable_utc": "2025-03-08 19:05:59 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1j6oc2v/crba_unable_to_get_form_ds5507_notarized/",
        "permalink": "https://reddit.com/r/USCIS/comments/1j6oc2v/crba_unable_to_get_form_ds5507_notarized/",
        "selftext": "Before I begin I’ve already emailed the consulate to let them know what’s going on. \n\nThe transmitting US parent will not be in attendance for the interview. He went to get the document notarized but the notary refused saying that nowhere on the form does it state a notary can do it (I pulled up extra instructions showing they’re able to but they still refused). Has anyone had this happen and it turn out ok? We did get the consent for a US passport notarized and said notary said since that’s notarized the affidavit unsigned is enough. We are on a very tight deadline hence my stress. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "1j55d59",
        "title": "Government has no record of CRBA",
        "score": 2,
        "num_comments": 18,
        "author": "Moms-Dildeaux",
        "created_utc": 1741293262.0,
        "created_readable_utc": "2025-03-06 20:34:22 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1j55d59/government_has_no_record_of_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1j55d59/government_has_no_record_of_crba/",
        "selftext": "I have been trying to resolve this issue now for nearly a decade. Finally today, based on old posts I found in this sub, I got in touch with my congressman and officially requested \"help with a federal agency.\" I hope that works. In the meantime, does anybody have any other ideas? Here is what happened. I am a US citizen.\n\n2011 - I was working overseas and had a daughter born to a non-citizen mother. Went to embassy, applied for CRBA\n\n2012 - consul adjudicates case and declares my daughter a US citizen, issues CRBA\n\n2012 - used CRBA to get her a US passport\n\n2013-2017 - CRBA lost in a fire back in the US\n\n2017 - requested copy of CRBA from Vital Records using normal process, they respond that they have NO CRBA and NO RECORD of my daughter's citizenship or existence. they tell me to contact the embassy. Embassy tells me they do not keep copies, but they do have the record of the case and that they declared my daughter a citizen, and they issued the CRBA at the time.\n\n2017-2025 - repeated attempts, same story, over and over. Nobody has copy, Vital Records says call embassy, embassy says there's nothing more they can do. This week Vital Records told me to call the embassy and start the process all over again to get a NEW CRBA issued, rather than try to get copies of the old one. This of course is impossible, since I am now in the US, and my daughter and her mom are in a third country on a whole third continent. Getting a new CRBA requires being physically present in that country, with in-person appointments.\n\nI'm at the end of my rope here, it is an emergency at this point. Does anybody have any experience with this, or any ideas other than what I finally learned about today, contacting the office of my congressman? I did that today.\n\nEdit: added passport",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "1j2m1b9",
        "title": "Unsolicited evidence",
        "score": 3,
        "num_comments": 6,
        "author": "Certain-Habit-8444",
        "created_utc": 1741017841.0,
        "created_readable_utc": "2025-03-03 16:04:01 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1j2m1b9/unsolicited_evidence/",
        "permalink": "https://reddit.com/r/USCIS/comments/1j2m1b9/unsolicited_evidence/",
        "selftext": "Can I upload my child’s crba under unsolicited  evidence ? Will this slow down the process ? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1j1h41i",
        "title": "International Travel",
        "score": 0,
        "num_comments": 3,
        "author": "mikeosmith",
        "created_utc": 1740884592.0,
        "created_readable_utc": "2025-03-02 03:03:12 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1j1h41i/international_travel/",
        "permalink": "https://reddit.com/r/USCIS/comments/1j1h41i/international_travel/",
        "selftext": "My wife (a 2-year green card holder) is currently pregnant, and we’re planning for her to give birth in her home country. This means she has less than 6 months to stay outside the U.S. to maintain her status.\n\nWe’ve checked online, and it seems the CRBA (Consular Report of Birth Abroad) and U.S. passport process for the baby might take a while.\n\nIf my wife returns to the U.S. briefly (even just for a day) and then flies back to her country, would that “reset” the 6-month period she’s allowed to stay outside the U.S.?\n\nThanks in advance for any advice!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (Family/Adjustment of status)"
    },
    {
        "id": "1ixbpmx",
        "title": "US Citizenship Question: Foreign Birth Certificate, SSN, No CRBA",
        "score": 2,
        "num_comments": 11,
        "author": "Informal_Ease_6598",
        "created_utc": 1740428080.0,
        "created_readable_utc": "2025-02-24 20:14:40 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ixbpmx/us_citizenship_question_foreign_birth_certificate/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ixbpmx/us_citizenship_question_foreign_birth_certificate/",
        "selftext": "Hey community, \n\nI can use your support on helping my aunt \"establish\" her US citizenship. Here are the specifics:\n\nMy aunt, in her sixties, was born outside the US to a US citizen mother (who is now deceased). She has a social security number but no US birth certificate or Consular Report of Birth Abroad. She does have a foreign birth certificate. Some of her siblings were born in the US. What steps should she take to establish her US citizenship or obtain the necessary documentation? Although this is a USCIS subreddit, my thought process was to go through the State Department and obtain a passport with my aunt's foreign birth certificate and mother's USA birth certificate. Is this a viable approach?\n ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },
    {
        "id": "1iqhcjh",
        "title": "Since I became a citizen through my parents (N-600), do I need to submit the original documents with my passport application?",
        "score": 1,
        "num_comments": 1,
        "author": "danikT101",
        "created_utc": 1739670510.0,
        "created_readable_utc": "2025-02-16 01:48:30 UTC",
        "url": "https://i.redd.it/gqkeqjglpeje1.jpeg",
        "permalink": "https://reddit.com/r/USCIS/comments/1iqhcjh/since_i_became_a_citizen_through_my_parents_n600/",
        "selftext": "I became a U.S. citizen through my parents since I was under 18 when they naturalized. My question is, when applying for a U.S. passport, do I need to submit the original documents requested, or are copies sufficient? The postal clerk told me that originals are required, but I find that hard to believe.\n\nI’m still waiting for USCIS to approve my N-600, but the process is taking longer than expected. I need to leave the country in five months, so I’m considering applying for a passport instead, using the same documents I submitted for my N-600 application.\n",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    {
        "id": "1iidgc7",
        "title": "Getting citizenship through american mother",
        "score": 1,
        "num_comments": 1,
        "author": "Wonderful-Time6875",
        "created_utc": 1738771560.0,
        "created_readable_utc": "2025-02-05 16:06:00 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1iidgc7/getting_citizenship_through_american_mother/",
        "permalink": "https://reddit.com/r/USCIS/comments/1iidgc7/getting_citizenship_through_american_mother/",
        "selftext": "As a son of american mother whom resided in the stats for 5 years prior to my birth between 1984 till 1991 and she gave birth to me in 1992 abroad , she never filled for CRBA , now I need to claim my passport as. US citizen , so I have her file from USCIS through FOIA , some letters from the institute where she made exams for medical residency , and her driving licences , are those enough as proof of residency to be accepted at the embassy to apply for the US passport  ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    {
        "id": "1igkd5m",
        "title": "Stuck in a legal problem",
        "score": 1,
        "num_comments": 14,
        "author": "Affectionate_Eye9281",
        "created_utc": 1738570532.0,
        "created_readable_utc": "2025-02-03 08:15:32 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1igkd5m/stuck_in_a_legal_problem/",
        "permalink": "https://reddit.com/r/USCIS/comments/1igkd5m/stuck_in_a_legal_problem/",
        "selftext": "I am born abroad to a US citizen mother and was never admitted to the United States on permanent residence before age 18. \nSo I cannot be issued an n600\n\nI also never was registered for a CRBA.\n\nAnd because I’m a citizen I cannot be issued visas or get a N-400.\n\nSo the only proof in my life is a passport. I cannot ever get of citizenship or residency in the United States any other way or with any other document 😵‍💫\n\nAm I correct?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-400 (Citizenship)"
    },
    {
        "id": "1iegh26",
        "title": "Can I just really apply for a US passport?",
        "score": 7,
        "num_comments": 45,
        "author": "fixeme",
        "created_utc": 1738335075.0,
        "created_readable_utc": "2025-01-31 14:51:15 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1iegh26/can_i_just_really_apply_for_a_us_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/1iegh26/can_i_just_really_apply_for_a_us_passport/",
        "selftext": "I was born out of the wedlock with a US citizen father , he died while he was applying for a CRBA and a US passport for me now almost 20 years after his death I would like to know what to do\nI was born and residing outside the US I know my father met the requirements to transmit the citizenship to me but I’m stuck due to excessive demands about the embassy.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.82,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family"
    },

 
    {
        "id": "1i80ilf",
        "title": "CRBA Issues",
        "score": 2,
        "num_comments": 14,
        "author": "Ok_Let7434",
        "created_utc": 1737628459.0,
        "created_readable_utc": "2025-01-23 10:34:19 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i80ilf/crba_issues/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i80ilf/crba_issues/",
        "selftext": "Hey, i am looking into the CRBA issues, and i believe i am facing an issue. i have all the requirements except for the 5 years in the USA (specifically the 2 years after the age of 14). However, my father (my childs grandparent) is eligible to apply for them as he meets the requirements.\n\nI want to ask, should we apply for the CRBA again and let him apply for them or should i just get all his documents and go back to the embassy and give them? should i make another appointment (last appointment, we waited for about 2 months)",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },
    {
        "id": "1i7k64k",
        "title": "Direct Consular filing",
        "score": 6,
        "num_comments": 7,
        "author": "Stunning_Ad8698",
        "created_utc": 1737575510.0,
        "created_readable_utc": "2025-01-22 19:51:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i7k64k/direct_consular_filing/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i7k64k/direct_consular_filing/",
        "selftext": "Direct Consular filing - 2 weeks from first contact to Visa issuance. \n\n\n\nIn short, I filed Direct Consular Filing, and the visa was printed in the passport 2 weeks from first contact with the embassy. \n\n\n\nThis is the brief timeline including time and money spent at each step.\n\n\n\n**December 8 -** I asked embassy to consider my application \n\n**December 9 -** Consular officer agreed to adjudicate\n\n**December 12 -** Appointment to submit I-130- 2 hours total, $675\n\n**December 16 -** Received CEAC log in and completed DS 260 \n\n**December 18 -** Medical appointment 3.5 hours, $375 for exam, vaccines and an X Ray\n\nSpousal interview 2 hours, $325 \\*Intend to approve pending medical results\\*\n\n**December 23 -** Visa status updated to “issued” and shipped\n\n**December 30 -** Visa delivered Paid $15 to courier, paid USCIS Immigrant Fee online $235\n\n**January 17**\\- Entered USA, gave packet to CBP and started our lives here!\n\n\n\n$1,625 and 2 weeks (3 weeks with shipping) later, and we are free to enter the USA!\n\nI want to highlight the incredible efficiency and some good news!\n\n\n\nThe whole story is quite a bit longer. I really benefited from the sum of everyone’s experiences here. I found that not knowing what to expect was almost as difficult as the actual bureaucracy and waiting. I was humbled many times during this process by what I have come to accept as my own hubris and ignorance. In case it helps anyone, here’s my experience in as much detail as I think might help. \n\n\n\nFor context: I’m a remarried American citizen living in Romania with 3 dual citizen children from my first marriage and a dual citizen child born in Romania with my current Romanian husband. \n\nInitially, we applied via Consular Processing in September of 2023. We were denied the first week of December 2024 due to an incorrect signature. As luck would have it, the day before I got the denial, I got a job offer with training starting the first week of February. \n\n\n\nOriginal timeline–\n\n**September 30 2023**\\- PD for i130 consular processing \n\n**January 8 2024** PD for K3\n\n**January 2024** \\- Denied Expedite request\n\n**November 29 2024** NOID for deficient Signature \n\n**December 6**\\- Denial for deficient signature \n\n\n\nI made a stupid, clearly avoidable mistake,[ I made a post about it](https://www.reddit.com/r/USCIS/comments/1houif4/check_your_signature/). It’s over. However, it also began our DCF journey. Which was much less journey than sprint. \n\n\n\nOn December 5th. I received a job offer in the USA with training starting February 1st 2025\n\n\n\nAnd so it began! \n\nI applied for Direct Consular Filing with the embassy in Bucharest. \n\nI greatly benefited from this person’s experience. I used their basic email template and had a similar experience. \n\n[https://www.visajourney.com/forums/topic/812566-my-comprehensive-dcf-direct-consular-filing-experience-bucharest/?utm\\_source=chatgpt.com](https://www.visajourney.com/forums/topic/812566-my-comprehensive-dcf-direct-consular-filing-experience-bucharest/?utm_source=chatgpt.com)\n\n. \n\n\n\nA more detailed look at each step- \n\n\n\n**December 8** ( a Sunday ) I used the google form to determine my eligibility and get the right email address and subject line. I sent the email and was open about the fact that I had a recently denied i-130 and why. \n\n( notably[ https://www.ustraveldocs.com](https://www.ustraveldocs.com/) and[ https://ro.usembassy.gov/visas-navigator/](https://ro.usembassy.gov/visas-navigator/) provided different subject lines to use for exceptional circumstances. \n\n\n\n**December 9** Only a few hours into the first working day after I sent the request, I received a response that they would accept my filing. They laid out all of the details for both interviews, what I needed and when. I responded that I was in possession of all the documents and available at their earliest convenience. Within a few hours I had an appointment booked for later in the week.\n\n\n\nThey informed me: \n\n“”At the appointment for the first interview with the consular officer, you must present the following documents:\n\n \n\n1. Form I-130, Petition for Alien Relative, filled out and signed by you,\n2. Form I-130A, Supplemental Information for a Spouse Beneficiary, filled out and signed by your spouse,\n3. Two photos for each of you, as in the attached sample,\n4. Your U.S. passport,\n5. Your spouse’s passport,\n6. The marriage certificate,\n7. Your spouse’s birth certificate,\n8. Proof that all your and your spouse’s prior marriages were terminated,\n9. Proof of relationship with your spouse,\n10. The fee of U.S. dollars 675.00 which is payable only at the cashier located in the Consular Section, in cash in U.S. or Romanian currency, or by credit card.””\n\n\\*\\*They did not ask for or keep our copies. The consular officers make their own copies and then they have to stamp and sign that the copies are conform to the original.\n\n\n\n**December 12** We had the first interview. Everyone was kind ( maybe because we had a baby?) .We submitted the application and showed them all of our documents. We dealt with 2 different staffers, one Romanian ( apparently the one who had been emailing me) and an American consular officer. The consular officer remembered us from when we filed the CRBA for our child together. She asked us a couple questions, and acknowledged it wasn’t something they did very often. She was very carefully flipping through pages and said, “ We’re kind of doing the job of two agencies here, so I want to make sure we don’t miss anything”. The Romanian staffer was equally cautious, asking follow up questions, making sure I had included absolutely everything ( all previous names, if I was sure in which countries we had/hadn’t lived in other countries a year or more, etc. ) \n\nWe paid $675 at the payment window. They told us to expect to hear from them in about a week with the NVC log in info to submit DS-260.\n\nThey saw us promptly, but there were a few different periods of talking to an officer then sitting and waiting. We were in the embassy about 1 hour and 45 minutes total.\n\n\n\nNotes: \n\n\n\nRegarding proof of relationship: I included our CRBA, his paternity leave to care for our child, joint revolut accounts, rental agreement and some photos.\n\nRegarding document validity: For this step, we had official documents from 4 different countries. Anything in English or Romanian ( even if originating in another European country) was fine as is. No apostille was needed for US or EU documents. \n\n  \n  \n\n\n**December 16** We received the email with the CEAC log in info and completed form DS-260. We scheduled with the panel physician and second interview for the 18th. \n\nFor our second interview, They told us we needed:\n\n“”At the time of the visa application appointment your spouse must present the following documents:\n\n1. His valid passport,\n2. All previous passports with U.S. visas,\n3. Two photos as in the attached sample,\n4. His birth certificate in original not laminated,\n5. His marriage certificate in original not laminated,\n6. The police certificates from Romania in original,\n7. If your spouse resided in other countries besides Romania and the United States for one year or more, he is required to obtain and present at the interview a police certificate from those countries. \n8. The medical examination conducted with the Embassy’s panel physician.\n9. A Form I-864, Affidavit of Support, filled out and signed by you on behalf of your spouse. \n10. A complete copy of your individual Federal Income Tax Return for 2023 (Form 1040 and W-2),\n11. The fee of U.S. dollars 325.00, payable only at the Consular cashier on the appointment date in U.S. or Romanian currency in cash or by credit card.””\n\n\n\nNotes: \n\nRegarding affidavit of support: I’m an independent contractor, so he took last year’s 1099 ( instead of w2) and my transaction record so far this year. Last year I made enough to support him and our family before we had another baby. If I had needed to include this year’s income, I would have needed to earn a few thousand more dollars. We didn’t want to risk anything or have questions, so we included his assets to cover any shortfall. He was never asked about it, so I don’t know if they looked at last years, this year’s, etc. I was a little concerned his being unemployed ( on paternity leave) would be an issue - it apparently was not.\n\n Regarding police certificates: We had all of the documents together already because I believed we had a good case to expedite early in 2024. It turns out that potentially life threatening pregnancy complications are not a reason to expedite, but it did mean that I had all my docs in hand when the time came. We needed 4 total police certificates. Some were instant online ( Romania), and others took more than a month ( UK), so plan accordingly. They also varied in cost from free to more than $100 with shipping. \n\n  \n\n\nRegarding proof of domicile: They didn’t ask for proof of domicile, but as I had prepared it already, I sent it with my husband. I included my voter’s registration, the fact I still insure my car there, my kids being registered with online public school, my bank statements with my address, etc. \n\n\n\nRegarding the medical exam: Typically, a couple should finish everything INCLUDING receiving the medical report back BEFORE scheduling the second interview. However, we live 7 hours from the panel physician, so she said it would be ok to schedule the Dr’s appointment for the same trip back into town. \n\n\n\n**December 18**\n\nBeneficiary spouse attended medical and interview alone. \n\nThe medical exam took 3.5 hours between waiting and traveling to different offices/buildings for different parts of it. (This was a little stressful since we had the interview scheduled 4 hours after the medical appointment.)\n\n\n\nThe interview itself was relatively brief. He was only asked a few questions and was told that the officer intended to approve the visa, pending medical results. The officer was very kind and wanted to make sure my husband understood that the refusal under 221(g) was not a refusal per se, but a logistical placeholder until the medical results came in. \n\n  \n\n\nNotes:\n\n We knew that we would be waiting for the medical results before the visa could be adjudicated. The panel physician said she expected the results to be available by the weekend and could be to the embassy as early as the 23rd, but in theory the results can take 10 working days. So we prepared ourselves to hear back on or after January 13th. ( there were 8(!) weekday holidays just after we had the visit) The medical exam in Romania can only be done with one doctor. It cost 840 RON( about $175 when we paid). We didn’t have any vaccine records from his childhood, so he had to repeat the vaccines with the panel physician at cost. We were able to do all the required vaccines ( with the exception of the Covid vaccine) with the panel physician. We paid about $200 more for the vaccines and x ray. [https://www.reginamaria.ro/articole-medicale/servicii-medicale-pentru-obtinerea-vizei-sua-adulti-si-copii](https://www.reginamaria.ro/articole-medicale/servicii-medicale-pentru-obtinerea-vizei-sua-adulti-si-copii) \\[The Covid vaccine is not available anywhere in Romania at this time. He was not able to get it. The doctor noted this and it was not a problem\\]\n\n**December 20** The doctor called in the evening to let us know the results were ok, and she would input them into the system. \n\n\n\n**December 23** The CEAC website updated to “issued” and the visa packet was given to the courier company. At this point someone local to Bucharest could have picked it up.\n\n\n\n**December 30** Visa packet was delivered. We paid $15 to courier. With the info inside the packet, we were able to pay the $235 USCIS Immigrant Fee online. \n\n\n\n**January 17** We flew to the USA and gave our packet to the customs officer. We were all ( 2 adults, 4 kids and a dog) taken to an office where they stamped some papers and told us, “Welcome”. \n\n  \n I hope some of this info can help anyone who is considering DCF and what steps they might take. Good luck! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.88,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    
    {
        "id": "1i2ihqs",
        "title": "How to get U.S passport through born citizen parent?",
        "score": 0,
        "num_comments": 12,
        "author": "Rezlyyy",
        "created_utc": 1737007545.0,
        "created_readable_utc": "2025-01-16 06:05:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "selftext": "Brief summary, I am almost 24, I was born in Mexico in 2001, to a born U.S citizen father and a Mexican mother who were not married at the time, married couple years later, and I did NOT get a Consular Report of Birth Abroad (CRBA).\n\nMy dad was born in the U.S but stayed in Mexico until he was about 25 ish, then they married and he got my mom and I green cards and we moved to the U.S, I was 7 at the time. I’ve been living here ever since. \n\nThey ended up separating when I was around 12, but did NOT divorce, they are still technically married.\n\nSome immigration services recommend naturalization, some people I’ve talked to recommend getting a passport as I should have the right to get citizenship through my dad. \n\nWhat documents would I need to get a U.S passport through my dad? \n\n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
    {
        "id": "1hmyrha",
        "title": "For CRBA and filling N600. Grandparent naturalized in 2021, but lived 10 years prior with GreenCard, is it still possible to get citizenship for baby?",
        "score": 2,
        "num_comments": 5,
        "author": "LuthienDragon",
        "created_utc": 1735249141.0,
        "created_readable_utc": "2024-12-26 21:39:01 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hmyrha/for_crba_and_filling_n600_grandparent_naturalized/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hmyrha/for_crba_and_filling_n600_grandparent_naturalized/",
        "selftext": "Title.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.76,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    {
        "id": "1hc6y88",
        "title": "CRBA physical presence",
        "score": 1,
        "num_comments": 2,
        "author": "lezziethon",
        "created_utc": 1733958660.0,
        "created_readable_utc": "2024-12-11 23:11:00 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hc6y88/crba_physical_presence/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hc6y88/crba_physical_presence/",
        "selftext": "I am a naturalized citizen. I naturalized when I was 22 and had my child at 28, I've been living in the US since I was 17. I want to apply for CRBA but I saw the physical presence requirement and it says that I had to be living in the US for at least 5 years, and at least two of those after 14. Does that mean that I had to be in the US three years before 14, or can I gather those 5 years from when I was naturalized? This is confusing.\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "1hbvajh",
        "title": "CRBA Status ",
        "score": 2,
        "num_comments": 10,
        "author": "Ill_Conference3304",
        "created_utc": 1733929057.0,
        "created_readable_utc": "2024-12-11 14:57:37 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hbvajh/crba_status/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hbvajh/crba_status/",
        "selftext": "Hello! \n\nI have been trying to get ahold of Status of CRBA through the phone number (202) 485-8300, I have been waiting on my CRBA for months now and I seriously cannot get ahold of ANY through the status. I have my life on hold right now because I am waiting for my CRBA to join the military. I get through to the people who can transfer me to Status of CRBA but then i’m on hold for 1-2 hours and no one answers the phone. I’ve left countless of voicemails, emails and no one has gotten back to me about anything. Does anyone have ANY advice or someone else I can call about this? It would be so so helpful. Thank you so much! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family"
    },
  
    {
        "id": "1ha2gbw",
        "title": "Lost CRBA. How can I get a new copy?",
        "score": 1,
        "num_comments": 2,
        "author": "Proud-Bug2166",
        "created_utc": 1733721249.0,
        "created_readable_utc": "2024-12-09 05:14:09 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ha2gbw/lost_crba_how_can_i_get_a_new_copy/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ha2gbw/lost_crba_how_can_i_get_a_new_copy/",
        "selftext": "26 F born abroad. American dad, foreign mom. My CRBA was lost and I only have my original birth certificate. How can I obtain a new one? \n\nMy mom told me I would have to call the consulate from the country I was born in and go through them for it. But my dad told me he would have to be involved in the filing for a copy since he's the reason why I have citizenship. \n\nI feel like there has to be an easier way to get a new one. \n\nAny suggestions? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
 
    {
        "id": "1gzenjd",
        "title": "CRBA, Mistake found after the sworn interview",
        "score": 1,
        "num_comments": 1,
        "author": "FlakyAd6050",
        "created_utc": 1732525109.0,
        "created_readable_utc": "2024-11-25 08:58:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1gzenjd/crba_mistake_found_after_the_sworn_interview/",
        "permalink": "https://reddit.com/r/USCIS/comments/1gzenjd/crba_mistake_found_after_the_sworn_interview/",
        "selftext": "Please help.\nI submitted CRBA application for my daughter. After the interview the officer requested more documents as proof of residence.\nWhen trying to work on those, I realized that I made a mistake on the dates and missed to declare a period of 5 months when I was outside of USA. Please let me know how can I correct my mistake if already had the sworn interview ? I’m very confused ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
    {
        "id": "1gyg7iq",
        "title": "NO ID!!!!!",
        "score": 1,
        "num_comments": 6,
        "author": "DECLANYS",
        "created_utc": 1732414068.0,
        "created_readable_utc": "2024-11-24 02:07:48 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1gyg7iq/no_id/",
        "permalink": "https://reddit.com/r/USCIS/comments/1gyg7iq/no_id/",
        "selftext": "I feel like a second class citizen. I am trying to get a certificate of citizenship so I can get an ID and then get a job. I was born abroad to a us citizen but I dont have a crba, so I've gone through the process of filing out an N-600. But now that I'm scheduled for a biometrics appointment, they're saying I need an ID for the appointment, I'm doing all this because I CAN'T GET and ID. Does anyone know what I can do? Is the citizenship certificate process completely screwed now? What other way can i prove my citenship and obtain a photo ID?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

    {
        "id": "1gp3ajf",
        "title": "I am worried for my family…",
        "score": 3,
        "num_comments": 9,
        "author": "FaithlessnessNo4391",
        "created_utc": 1731359414.0,
        "created_readable_utc": "2024-11-11 21:10:14 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1gp3ajf/i_am_worried_for_my_family/",
        "permalink": "https://reddit.com/r/USCIS/comments/1gp3ajf/i_am_worried_for_my_family/",
        "selftext": "\nGood day brothers and sisters,\n\nI am currently serving in the military and We (my family) were recently Medivac’ed back to the US through Humanitarian orders coming from Japan due to my wife’s condition (cancer). Mind you, all their immigration paperwork (I-130 and CRBA for my youngest) were still in process but due to the urgency of the situation at that time they were given B2 Visas instead for their stay. I am worried because they are overstaying here in the US even though I filed I-495 (change of status) for my wife and N-600 (CoC) for my eldest daughter, Who is 18 at that time when we got here. Is there a protocol that immediate military families can stay as long as they are within the military orders? I understand that there is a PIP (parole in place) for military members but with the administration change I am worried for my daughter’s situation and I feel like a hit a wall. Any suggestions will do. I just don’t want to get separated to my daughters while my wife undergoes treatment. Thank you in advance.\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.8,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (Family/Adjustment of status)"
    },
    {
        "id": "1gmstei",
        "title": "Adult US Citizen born abroad with NO CRBA; can I get a passport with only father's info?",
        "score": 2,
        "num_comments": 34,
        "author": "Clean_Carpenter3525",
        "created_utc": 1731099233.0,
        "created_readable_utc": "2024-11-08 20:53:53 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1gmstei/adult_us_citizen_born_abroad_with_no_crba_can_i/",
        "permalink": "https://reddit.com/r/USCIS/comments/1gmstei/adult_us_citizen_born_abroad_with_no_crba_can_i/",
        "selftext": "40yo US citizen born abroad; there is apparently no CRBA for me. I'd like to get a US passport as the easiest way to prove citizenship if needed.   \n  \nBoth parents were born in US, married at the time of my birth, and have been citizens their entire lives.  My birth outside the US was \"accidental\" due to being out of the country at the time of birth.  I've lived my life without having proof of citizenship, but that's gone on too long.\n\nI am estranged from my mother, and would like to do this without her if possible. I have from my father all the information, including marriage certificate, needed for claiming citizenship based on him alone.  \n\nCan I claim based on one parent even if I have two?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
   
    {
        "id": "1ggyzvn",
        "title": "CRBA",
        "score": 1,
        "num_comments": 3,
        "author": "DoctorSin17",
        "created_utc": 1730441495.0,
        "created_readable_utc": "2024-11-01 06:11:35 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ggyzvn/crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ggyzvn/crba/",
        "selftext": "U.S. Consulate General\n\nTijuana, Mexico\n\nAmerican Citizen Services Unit\n\n10 de septiembre de 2024\n\n \n\nSirva este conducto para dar respuesta a la solicitud presentada por usted ante estas oficinas, para determinar si su hija, nacida el 17 de agosto de 2023 en Tijuana, Baja California, México califica para la transmisión de ciudadanía estadounidense para menores de edad.\n\n\n\nDesafortunadamente, después de haber analizado la información presentada, nuestra oficina ha determinado que usted como padre no cumple con los requisitos de presencia física en los Estados Unidos, antes del nacimiento de su hija para poder derivarle la ciudadanía estadounidense.\n\n\n\nSi desea tramitar una visa de inmigrante puede consultar la página web del Servicio de Ciudadanía e Inmigración de los Estados Unidos (uscis.gov) y presentar copia de esta carta. \n\n \n\n \n\nCordialmente, \n\n \n\nOficial Consular \n\n\n\nI have w2 forms for the last 8 years before that i lived in mexico, my daughter born in TJ was rejected for the CRBA is there any other options besides the VISA that i can do?\n\nI appreciate the help ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "1g8fa29",
        "title": "What exactly do I need to take for an Consular Report of Birth Abroad (CRBA) interview?",
        "score": 1,
        "num_comments": 0,
        "author": "Different_Spare_3804",
        "created_utc": 1729476941.0,
        "created_readable_utc": "2024-10-21 02:15:41 UTC",
        "url": "https://i.redd.it/8rsl33zvq0wd1.png",
        "permalink": "https://reddit.com/r/USCIS/comments/1g8fa29/what_exactly_do_i_need_to_take_for_an_consular/",
        "selftext": "I'm not sure what to take on the red X's. Thank you ",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "1g5515h",
        "title": "N-600 - what date showed for when you became a citizen?",
        "score": 2,
        "num_comments": 5,
        "author": "SadCard4805",
        "created_utc": 1729099816.0,
        "created_readable_utc": "2024-10-16 17:30:16 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1g5515h/n600_what_date_showed_for_when_you_became_a/",
        "permalink": "https://reddit.com/r/USCIS/comments/1g5515h/n600_what_date_showed_for_when_you_became_a/",
        "selftext": "TLDR - if you got an N-600 late as an adult, what date did your N-600 show for when you became a citizens?\n\nHi all, I am 37 and just got approved to get my n-600. Oath ceremony scheduled for a week. I derived citizenship at birth via my father and have held a US passport since I was 1 (and lived in the US since then), but was born in Europe to a European mother.\n\nThis European country is now asking for proof of citizenship at birth to renew my European passport, but my parents never got me a CRBA. I was approved for the N-600 and my oath ceremony is next week, but a USCIS case officer told me my certificate of citizenship will show that I became a citizen in 2024. That doesn’t possibly seem right, but now I really don’t know what to do. Has anyone dealt with this before? Any tips before my oath ceremony? Feeling very overwhelmed- thank you for any help !",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    {
        "id": "1g4zgpv",
        "title": "I-130",
        "score": 0,
        "num_comments": 7,
        "author": "hynboy",
        "created_utc": 1729085526.0,
        "created_readable_utc": "2024-10-16 13:32:06 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1g4zgpv/i130/",
        "permalink": "https://reddit.com/r/USCIS/comments/1g4zgpv/i130/",
        "selftext": "Hello,\nI'm a US citizen who filed I-130 for my wife and 2 kids last year.  We'll my wife gave birth recently abroad, do you know if i have to file another I-130?  I'm about to go Honduras to file for a CRBA, all assistance is needed here.  I was told by a agent via through live chat I need to file a I-130 but with no other assistance.\n\nSo please everyone i need help.\n\nMahalo!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1g3ol93",
        "title": "Immigration Question",
        "score": 1,
        "num_comments": 4,
        "author": "Plane-Put1902",
        "created_utc": 1728934546.0,
        "created_readable_utc": "2024-10-14 19:35:46 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1g3ol93/immigration_question/",
        "permalink": "https://reddit.com/r/USCIS/comments/1g3ol93/immigration_question/",
        "selftext": "Hi I'm a US citizen living abroad. I have two kids with a local woman. We were married, now divorced. Our oldest child has a CRBA and passport, but our newest child not yet. We are totally separated but on very good terms. She wants to take the kids to visit and possibly stay some time with my family in California. I will be staying here due to health complications.  Does she automatically get residency/green card status? Does she need to apply for a tourist visa? Thank you",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NIV (Visitor)"
    },
    {
        "id": "1g2ugzq",
        "title": "Non-biological US citizen father; alien mother",
        "score": 3,
        "num_comments": 9,
        "author": "zephen_just_zephen",
        "created_utc": 1728839330.0,
        "created_readable_utc": "2024-10-13 17:08:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1g2ugzq/nonbiological_us_citizen_father_alien_mother/",
        "permalink": "https://reddit.com/r/USCIS/comments/1g2ugzq/nonbiological_us_citizen_father_alien_mother/",
        "selftext": "My girlfriend is a Mexican national.  At the time of birth of her 10 year old son, she was married to a US citizen and living in Mexico.  The child was born via IVF from donor sperm.\n\nAccording to several things I read, the child acquired US citizenship at birth.  For example, [this](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-2) states:\n\n> To be considered a child of a U.S. citizen father, the child must be: ...  The child of a U.S. citizen father who is married to the child’s genetic or gestational parent at the time of the child’s birth (even if no genetic or gestational relationship exists with the U.S. citizen father) if both parents are recognized by the relevant jurisdiction as the child’s legal parents ...\n\nBut all the instructions for all the forms I have seen (e.g. N-600, CRBA, etc.) seem to require that the father be the biological father of the child.\n\n1) What is up with this?\n\n2) Assuming we can get past this, it seems a CRBA (if possible) would be much cheaper and quicker than a N-600.  We live in Texas but could easily travel to Mexico.  Is that allowed for the CRBA?\n\nTIA",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

    {
        "id": "1g2choq",
        "title": "Is this normal?",
        "score": 2,
        "num_comments": 32,
        "author": "Mayflower_77",
        "created_utc": 1728775148.0,
        "created_readable_utc": "2024-10-12 23:19:08 UTC",
        "url": "https://i.redd.it/bagmnnf3seud1.jpeg",
        "permalink": "https://reddit.com/r/USCIS/comments/1g2choq/is_this_normal/",
        "selftext": "Is it normal for a CRBA to take this long? Is it even being processed? Embassy won’t respond to my emails.. Parents are both US citizens.",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },
    {
        "id": "1fzsd3r",
        "title": "Questions about N600K",
        "score": 2,
        "num_comments": 6,
        "author": "Maleficent-Reserve-5",
        "created_utc": 1728483130.0,
        "created_readable_utc": "2024-10-09 14:12:10 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1fzsd3r/questions_about_n600k/",
        "permalink": "https://reddit.com/r/USCIS/comments/1fzsd3r/questions_about_n600k/",
        "selftext": "Good morning Everyone! Sorry for the long post.\n\nIm here because I have a question  questions about the N600K,\n\nFirst:  I applied for a CRBA in the Dominican republic for my child, Im a us citizen but I didn't live in USA after the age of 14 that's why I got denied got the CRBA, now I'm applying for N600k and I'm gonna use the 5 years physical resident of my mother who naturalized in 2011 after 20 years of green card, here is my question:\n\nThe application has a question that says: was there any prior application for citizenship or for a u.s. passport for the child? If I put yes a Yellow Warning comes up and says:\n\n\nThe child may not be eligible to file an Application for Citizenship and Issuance of Certificate Under Section 322 (N-600K)\nIf an Application for Citizenship and Issuance of Certificate under INA 322 (N-600K) was previously filed on behalf of the child, and the child received a decision from USCIS, you should not file this application again. USCIS will reject any newly filed Application for Citizenship and Issuance of Certificate (N-600K). Review the decision notice for more information.\n\n\nIf USCIS denied your prior Application for Citizenship and Issuance of Certificate, you may be eligible to appeal that decision using the Notice of Appeal or Motion (Form I-290B). If the time for appeal has expired, you should submit a motion to reopen or reconsider using Form I-290B. Review your decision notice for more information.\nIf you are seeking to replace a lost or stolen certificate, you should submit the Application for Replacement Naturalization/Citizenship Document (Form N-565).\n\nIf you have previously filed a passport application on behalf of the child, note that the child is not eligible for issuance of a Certificate of Citizenship under INA 322 if he or she has a valid, unexpired U.S. passport.\nBecause of that,I don't know if the answer is yes or not, as the CRBA is a consular report of birth that documents that a child was a us citizen at the moment of born, and not an application for citizenship like N600 or N600k , and the warning says nothing about CRBA, \n\n Should I put yes or no?\n\nI tried to pay a immigration attorney but they denied to answer that question because I was not going to do the process  with him.. I don't have enough money to cover the process with a lawyer, I'm doing it by my own.\n\nThanks in advance !",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
 
    {
        "id": "1fp2aac",
        "title": "I-130 expedite ",
        "score": 1,
        "num_comments": 1,
        "author": "Drlnxx",
        "created_utc": 1727264346.0,
        "created_readable_utc": "2024-09-25 11:39:06 UTC",
        "url": "https://i.redd.it/nnxyrobpzxqd1.jpeg",
        "permalink": "https://reddit.com/r/USCIS/comments/1fp2aac/i130_expedite/",
        "selftext": "My husband filed my petition last week and he’s currently on deployment right now so i can’t contact  him yet. We got married through proxy marriage last year of aug and currently have a child together, we already filed her CRBA and got her us passport few months ago. I heard that if you’re an active military personnel and have a child your petition can be expedited, if anyone already had this kind of situation i want to ask if my husband needs to contact or report to the uscis to request for an expedite? ",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1fmxtx6",
        "title": "CRBA - physical presence documents during early years",
        "score": 1,
        "num_comments": 6,
        "author": "tar182",
        "created_utc": 1727023976.0,
        "created_readable_utc": "2024-09-22 16:52:56 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1fmxtx6/crba_physical_presence_documents_during_early/",
        "permalink": "https://reddit.com/r/USCIS/comments/1fmxtx6/crba_physical_presence_documents_during_early/",
        "selftext": "I am applying for my child's CRBA and I am the only U.S. citizen parent. My concern is that I left the country when I was about three years old and I cannot find supporting documents to confirm my presence in the U.S. during those early years apart from my birth certificate. \n\nDo you think that my application will surely get rejected?\n\nI did return to the U.S. for two years for my master's degree. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family"
    },

    {
        "id": "1f9kftt",
        "title": "Is it a crime to deprive a Child born abroad of US Citizenship if the child meets the criteria to be a citizen?",
        "score": 6,
        "num_comments": 46,
        "author": "Nat520",
        "created_utc": 1725536873.0,
        "created_readable_utc": "2024-09-05 11:47:53 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1f9kftt/is_it_a_crime_to_deprive_a_child_born_abroad_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/1f9kftt/is_it_a_crime_to_deprive_a_child_born_abroad_of/",
        "selftext": "Pretty much what the title says. If a child born abroad meets the criteria to be a US citizen (Their USC parent has met the residency requirements to pass on citizenship to their children) but parents do not file/refuse to file a CRBA, they let the child enter the US on their foreign passport with an ESTA, etc…I imagine that in most cases it will never even be found out, especially if the child goes through passport control with a foreign parent. But what’s the legal position, and what could happen?\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.61,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },

    {
        "id": "1ey6fpe",
        "title": "N-400 possible denial",
        "score": 2,
        "num_comments": 5,
        "author": "Rezlyyy",
        "created_utc": 1724288644.0,
        "created_readable_utc": "2024-08-22 01:04:04 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ey6fpe/n400_possible_denial/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ey6fpe/n400_possible_denial/",
        "selftext": "I submitted an N-400 through an immigration lawyer but in the form it says “if you have a US citizen parent you may already be a US citizen and should file an N-600”. \n\nIm looking for some help if I actually qualify for US citizenship from my father and if so, how should I go about it to obtain it, so ill try to give a whole explanation of my situation.\n\nIm 23 years old born on January 27th, 2001, I was born in Piedras Negras, Coahuila, in Mexico, my dad is born in Del Rio, Texas and my mom was born also in Piedras Negras.\n\nThey were not married in the US at the time of my birth and I was not issued a CRBA, instead my mom and I got green cards in 2008 after they married in the US in 2005. We lived in Mexico up until 2008.\n\nI’ll give a bit of background of my family history in the US:\n\nMy dad (43 years old) is a US citizen by birth, born in Del Rio, lived in Mexico until he was about 27 years old, moved in 2007 and worked for one year in San Antonio ,then we moved in with him after getting us green cards in 2008 (I was 7). He worked and lived with us in San Antonio for 5 more years, then my parents separated BUT NOT DIVORCED. My mom went back to Mexico, I went to live with my aunt in Eagle Pass whom I still stay with to this day, but he stayed in the US to work for 3-4 more years to provide before moving back to Mexico. So he was working a total of about 10 years in the US. I’m not sure if I was a beneficiary of anything or if there is anything written that he provided financial support to me until I was 18, he is on my birth certificate and we did live together and did provide for me until I was 18.\n\nIs this enough to get denied naturalization due to being able to get citizenship through my father? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-400 (Citizenship)"
    },


  
    {
        "id": "1emr520",
        "title": "CRBA status/question",
        "score": 2,
        "num_comments": 7,
        "author": "Fantastic_Outcome_74",
        "created_utc": 1723074284.0,
        "created_readable_utc": "2024-08-07 23:44:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1emr520/crba_statusquestion/",
        "permalink": "https://reddit.com/r/USCIS/comments/1emr520/crba_statusquestion/",
        "selftext": "Hey guys,\n\nSo the status of the CRBA I applied for where it once said “pending adjudication”, now says “Shipped to Embassy/Consulate”. What does this mean? that the CRBA was approved? I’m still not sure if  I should get notified of approval or not.\nDoes anyone know what this new status chang means? \n\nThank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },

    {
        "id": "1ejblps",
        "title": "CRBA timeframe ",
        "score": 1,
        "num_comments": 2,
        "author": "Fantastic_Outcome_74",
        "created_utc": 1722712884.0,
        "created_readable_utc": "2024-08-03 19:21:24 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ejblps/crba_timeframe/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ejblps/crba_timeframe/",
        "selftext": "Does anyone know how long it takes for the CRBA + passport application to be approved? I already had the interview, and they have all the forms needed. Thanks",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1ej0vtq",
        "title": "Rare case !!!",
        "score": 2,
        "num_comments": 2,
        "author": "Exact_Landscape_9834",
        "created_utc": 1722683736.0,
        "created_readable_utc": "2024-08-03 11:15:36 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ej0vtq/rare_case/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ej0vtq/rare_case/",
        "selftext": "Hello, my wife had interview on April 30th and because of missing documents our case took place undergo Administrative Processing. Today our AP is completed.\nWhen my wife had interview she was 8 months pregnant.\nWhile our case undergo AP she delivered baby. After completing the AP consultant send us email that we need to send my wife's passport and missing tax transcript. I'm concerned about my daughter. What action do I need to take in order to get vise for both of them.BTW I'm not qualified for CRBA because of 5 years physical presence. I have 4y10 months only presence.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1edmyug",
        "title": "Proving physical present for Consular Report of Birth Abroad (CRBA) without transcripts",
        "score": 3,
        "num_comments": 17,
        "author": "LuthienDragon",
        "created_utc": 1722104648.0,
        "created_readable_utc": "2024-07-27 18:24:08 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1edmyug/proving_physical_present_for_consular_report_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/1edmyug/proving_physical_present_for_consular_report_of/",
        "selftext": "I will be having a baby soon, I am an American Citizen. We are at a crossroads currently, we need to make a choice of me going completely alone to the USA to give birth to guarantee citizenship or staying abroad with family, to later try to prove physical presence.\n\nI have some documents of me being raised there for the first three years of my life (mostly photos) and some pediatrician records plus vaccines. My parents were able to find some bills, obviously on their names as I was a baby.  \n  \nLater in my life, around my 20's, I lived in the USA for 3 years and some months but the only thing consistent in my name is my car registry (imported the car from Mexico which had always been on my name and continued to be on my name until I sold it in the USA, insurance payments, plus CarFax records). I lived with my parents, so all the bills are on their names.   \n  \nI have some W-2's, but I was never able to find full-time job, so it's usually on average three days a week payments or 39 hours a week. I do have passport stamps that record me staying in for long periods of time.\n\nI never went to the Doctor although I was assigned a PCP and everything, but I was terrified of going bankrupt in the American system, so I just drove down to Mexico and went for healthcare there when needed. So, no medical records.\n\nSo, in Summary I have:\n\n* Baby photos, medical pediatrician records and some bills on my parent's names (worth 3 years).\n* Bank Statements, with my name and address.\n* Car Registries and Insurance Payments with address.\n* Bills on my parent's names for water, electric and internet bills.\n* W-2's with part-time employment (three years).\n* Pet Records (vaccines, pet tax, etc).\n* Passport Stamps. I have all my passports, even when I was a baby, so this includes those stamps.\n* Four years of Tax Returns in which I paid taxes because I was living there at the time.\n* Realistically, I have around 5, maybe 6 years of proof.\n\n  \nWould that be enough? Are photos actually admissible (especially for toddlerhood?).   \nWhat uncommon documents do the accept? TIA!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "1ech1ib",
        "title": "USCIS policy update for \"Children’s Acquisition of Citizenship Provisions\"",
        "score": 1,
        "num_comments": 2,
        "author": "soloviewoff",
        "created_utc": 1721974646.0,
        "created_readable_utc": "2024-07-26 06:17:26 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ech1ib/uscis_policy_update_for_childrens_acquisition_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ech1ib/uscis_policy_update_for_childrens_acquisition_of/",
        "selftext": "Not really a question, just noticed this in the news, this may be relevant to those who are looking to get citizenship for their kids under INA 320 or INA 322.\n\nThe policy update can be found [here](https://www.uscis.gov/sites/default/files/document/policy-manual-updates/20240718-CitizenshipProvisionsForChildren.pdf).\n\nOne interesting clarification there is this: \"Confirms that USCIS accepts a valid and unexpired U.S. passport or a Consular Report of Birth Abroad (CRBA) as evidence of U.S. citizenship. However, USCIS also determines whether the applicant properly acquired U.S. citizenship and if necessary, may request that DOS revoke the U.S. passport or cancel the CRBA before USCIS adjudicates an application for a Certificate of Citizenship\".\n\nFull text is in these two sections [here](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4):\n\n>2. U.S. Passport or Consular Report of Birth Abroad as Evidence of Citizenship\n\n>A person may also apply for a U.S. passport with the U.S. Department of State (DOS) to serve as evidence of their U.S. citizenship.[**^(\\[32\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-32) A parent or legal guardian of a U.S. citizen child born outside the United States may also apply to the local U.S. embassy or consulate for a Consular Report of Birth Abroad (CRBA or Form FS-240).[**^(\\[33\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-33) A U.S. passport is valid for a limited time as established by DOS policies and standards on passport issuance.[**^(\\[34\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-34) Once a passport is expired, it is no longer conclusive evidence of citizenship.[**^(\\[35\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-35) Neither a CRBA nor a Certificate of Citizenship expires.\n\n>A valid, unexpired U.S. passport or a CRBA serves as evidence of a person’s U.S. citizenship.[**^(\\[36\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-36) An applicant for a Certificate of Citizenship may submit a valid and unexpired U.S. passport or a CRBA as evidence of U.S. citizenship.[**^(\\[37\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-37) The officer must review the valid U.S. passport or CRBA and the documentation submitted with the application and contained in the record to determine if it was issued properly.\n\n>\n\n>3. Request to Revoke U.S. Passport or Cancel Consular Report of Birth Abroad\n\n>If the officer determines that the applicant is not a U.S. citizen or has evidence indicating that a U.S. passport or CRBA submitted as evidence was obtained or issued illegally, fraudulently, or erroneously, the officer reviews the case with USCIS counsel. Then, if appropriate, the officer may request that DOS revoke the U.S. passport or cancel the CRBA.[**^(\\[38\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-38)\n\n>Only DOS has the authority to revoke a U.S. passport or cancel a CRBA.[**^(\\[39\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-39) DOS may revoke a U.S. passport or cancel a CRBA in cases where the passport or CRBA was obtained or issued illegally, fraudulently, or erroneously.[**^(\\[40\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-40)\n\n>USCIS provides the following information to DOS in the passport revocation or CRBA cancellation request:\n\n>The applicant’s complete biographic information, including name and any known aliases;\n\n>The applicant’s last known address;\n\n>All previous unexpired U.S. passport numbers and alien registration numbers (A-numbers);\n\n>A copy of the CRBA or of the biographical page of the U.S. passport submitted as evidence (if available);\n\n>An explanation for requesting revocation or cancellation, including reasons for the request, analysis of the facts and dates used in determining that the passport or CRBA should be revoked or cancelled, and evaluation of evidence indicating that the applicant did not acquire U.S. citizenship;\n\n>Copies of all documentary evidence in support of the request, including certified translations of any documents written or originally prepared in a foreign language; and\n\n>The contact information of the USCIS office making the request.\n\n>Adjudication of Application with Revocation or Cancellation Request\n\n>After reviewing the case on the merits and requesting a revocation of a U.S. passport or a cancellation of a CRBA from DOS, the officer generally may not complete the adjudication of the Application for Certificate of Citizenship until DOS responds.\n\n>If DOS notifies USCIS that it does not intend to revoke the passport or cancel the CRBA, USCIS approves the Application for Certificate of Citizenship.[**^(\\[41\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-41) However, in cases with unusual or complex circumstances, USCIS may further consult with DOS.\n\n>If USCIS has evidence indicating that a U.S. passport submitted as evidence was obtained or issued illegally, fraudulently, or erroneously, and the passport was valid at the time of filing, but is expired at the time of adjudication, the officer should review the case with USCIS counsel and DOS before adjudicating.[**^(\\[42\\])**](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-4#footnote-42)\n\n>If DOS revokes the U.S. passport or cancels the CRBA, the officer denies the application in cases where the applicant does not otherwise meet the eligibility requirements for issuance of a Certificate of Citizenship.\n\n>The officer approves the Application for Certificate of Citizenship if the applicant is a U.S. citizen and meets all requirements.\n\nThis basically documents the fact that if the passport was acquired without getting the Certificate of Citizenship (N-600, CoC) first, then when receiving the CoC from USCIS later it can theoretically determine that the passport was issued erroneously and request its revocation.\n\nAlso, this phrase is I think important - \"If DOS notifies USCIS that it does not intend to revoke the passport or cancel the CRBA, USCIS approves the Application for Certificate of Citizenship\". This basically adds a documented mechanism of conflict resolution between USCIS and DOS, as per [*Matter of Villanueva* (PDF)](https://www.justice.gov/sites/default/files/eoir/legacy/2012/08/14/2968.pdf), 19 I&N Dec. 101 (BIA 1984).",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    {
        "id": "1e9gsdl",
        "title": "Newborn baby while Administrative processing ",
        "score": 1,
        "num_comments": 1,
        "author": "Exact_Landscape_9834",
        "created_utc": 1721661306.0,
        "created_readable_utc": "2024-07-22 15:15:06 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e9gsdl/newborn_baby_while_administrative_processing/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e9gsdl/newborn_baby_while_administrative_processing/",
        "selftext": "Hello, my wife had interview on April 30th and because of missing documents our case took place undergo Administrative Processing. Today our AP is completed.\nWhen my wife had interview she was 8 months pregnant.\nWhile our case undergo AP she delivered baby. After completing the AP consultant send us email that we need to send my wife's passport and missing tax transcript. I'm concerned about my daughter. What action do I need to take in order to get vise for both of them.BTW I’m not qualified for CRBA because of 5 years physical presence. I have 4y10 months only presence.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (Family/Adjustment of status)"
    },
    {
        "id": "1e83kuj",
        "title": "Status: pending adjudication",
        "score": 1,
        "num_comments": 3,
        "author": "Fantastic_Outcome_74",
        "created_utc": 1721503860.0,
        "created_readable_utc": "2024-07-20 19:31:00 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e83kuj/status_pending_adjudication/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e83kuj/status_pending_adjudication/",
        "selftext": "I had applied for my child CRBA, and had the interview last week. \nToday I went to check the status of the application and it says “pending adjudication”. \n\nDoes anyone know what that means? \nOr the timeframe of the process? \n\nThank you. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1e6n74h",
        "title": "I do I know if my soon is elegible for CRBA?",
        "score": 1,
        "num_comments": 3,
        "author": "reddittrocks-",
        "created_utc": 1721339350.0,
        "created_readable_utc": "2024-07-18 21:49:10 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e6n74h/i_do_i_know_if_my_soon_is_elegible_for_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e6n74h/i_do_i_know_if_my_soon_is_elegible_for_crba/",
        "selftext": "Hi there, I been trying to find relief based on someone else experience doing a CRBA. \nLong story short, my son was born in Mexico. \nI was born in Houston Texas, I don’t have my physical presence proof before 14, just an old vaccine records, after 14 I have some evidence of physical presence, school transcripts from college and university ( 5 straight years ), and also have some tax records from the DMV from my last vehicule. While I was in college I never had utility bills or rent bills on my name, I shared rent with other students, so no records of that. I also have a report of net earnings from the SSA. I wasn’t able to get a full report of social security statement. Do you guys think that’s enough? \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family"
    },
  
    {
        "id": "1e3tqse",
        "title": "CRBA for child of a naturalized US citizen living abroad",
        "score": 1,
        "num_comments": 5,
        "author": "rosetta_embles",
        "created_utc": 1721047073.0,
        "created_readable_utc": "2024-07-15 12:37:53 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e3tqse/crba_for_child_of_a_naturalized_us_citizen_living/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e3tqse/crba_for_child_of_a_naturalized_us_citizen_living/",
        "selftext": "Hi all,\n\nI had a baby last year. I didnt realize he might be a citizen from birth so I didn't really look into it until now.\n\nI moved to the US with my immigrant parents as an infant, had a green card, and was naturalized at age 10 (along with my parents). I went to middle school, high school, college and grad school in the US. My family traveled frequently for weeks at a time for the summer holidays to visit family. I also traveled alone for a few months between college and grad school.\n\nA couple of years ago I got married to a non-US citizen and we now live in his country. Since then, we had a baby. \n\nI've reached the part of the application that requests the information on my comings and goings in the US. The problem Is I don't even have my old passports, or my old green card.\n\nIn addition, I'm a dual citizen with a European country so the stamps are spread out even further. \n\nAm I going to run into issues because of this? I can produce transcripts for grad school, college and, probably with some difficulty, high school as well. I can also likely dig up some old leases, and tax returns. I definitely fulfill the physical presence requirement. But reporting all the times I left the country on vacation just seems over the top?\n\nThanks in advance!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "1e1nso9",
        "title": "CRBA Under 18 Certified Copy",
        "score": 0,
        "num_comments": 4,
        "author": "Web_Impressive",
        "created_utc": 1720806312.0,
        "created_readable_utc": "2024-07-12 17:45:12 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e1nso9/crba_under_18_certified_copy/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e1nso9/crba_under_18_certified_copy/",
        "selftext": "Hi. We’re traveling soon unexpectedly and I need to get my little brother’s passport renewed. I need a certified copy of his CRBA. Does anyone know what is the fastest method of getting it? Or what the lead time is right now, with paying for expedited services? We’re in Minnesota if they counts for anything. \n\nThank you.  ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },
    {
        "id": "1e02uch",
        "title": "If a document is signed scanned and printed is considered original?",
        "score": 1,
        "num_comments": 2,
        "author": "Fantastic_Outcome_74",
        "created_utc": 1720635506.0,
        "created_readable_utc": "2024-07-10 18:18:26 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e02uch/if_a_document_is_signed_scanned_and_printed_is/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e02uch/if_a_document_is_signed_scanned_and_printed_is/",
        "selftext": "for my CRBA interview the father (US citizen) is unable to send via mail the DS-5507 and DS-3053; If these documents are authenticated and signed, scanned and printed, is that ok?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "1dw15zc",
        "title": "Applying CRBA - copy of documents ",
        "score": 1,
        "num_comments": 10,
        "author": "Fantastic_Outcome_74",
        "created_utc": 1720194633.0,
        "created_readable_utc": "2024-07-05 15:50:33 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dw15zc/applying_crba_copy_of_documents/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dw15zc/applying_crba_copy_of_documents/",
        "selftext": "Hey guys, \nI really need some help with this or someone that had experience this same situation. \nIn the upcoming week I have my interview with the embassy in regards of the application of CRBA for my child. \nHer father is American and won’t be able to attend the interview. He already filled out the DS5507 and the DS 3053 and scanned to me. \nI wont be able to get the documents sent. \nWould it be ok to bring the documents that he scanned and print them for the interview (and a copy of it as well)?\n\nThank you!!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family"
    },
    {
        "id": "1dsqqc9",
        "title": "CRBA",
        "score": 1,
        "num_comments": 9,
        "author": "To-ny-2005",
        "created_utc": 1719833549.0,
        "created_readable_utc": "2024-07-01 11:32:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dsqqc9/crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dsqqc9/crba/",
        "selftext": "Good morning I have one question . Now I am usc since May but I did my citizenship interview on December 2023 but before my naturalization process my wife was pregnant and she gave birth after my interview and before I took my oath ceremony. Please I want to know if my daughter is eligible for CRBA ? \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1dpzunu",
        "title": "CRBA physical presence: How do you include more than one document for a single period? ",
        "score": 1,
        "num_comments": 3,
        "author": "vacancy6673",
        "created_utc": 1719516583.0,
        "created_readable_utc": "2024-06-27 19:29:43 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dpzunu/crba_physical_presence_how_do_you_include_more/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dpzunu/crba_physical_presence_how_do_you_include_more/",
        "selftext": "I never left the US for my first 25 years. On the CRBA application, this should count as one period and, therefore, only allows me to upload a single document (I chose my birth certificate). But everyone seems to agree that providing as much evidence as possible is better.\n\nI have high school transcripts/diploma, ACT/SAT records, medical records, college transcripts/diploma, W-2s, etc. How can I possibly add more proof if the online application only allows 1 document per period?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "1dmnuj8",
        "title": "Enter US while sponsor is abroad",
        "score": 1,
        "num_comments": 11,
        "author": "Under_A_Rock247",
        "created_utc": 1719154229.0,
        "created_readable_utc": "2024-06-23 14:50:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dmnuj8/enter_us_while_sponsor_is_abroad/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dmnuj8/enter_us_while_sponsor_is_abroad/",
        "selftext": "I filed an I-130 for my husband and son in 2020 from abroad. They now have immigrant visas. A daughter was born to us in 2023 and I filed an I-130 for her as well but that is still processing. Can my husband enter the US on his immigrant visa while I am abroad with my daughter? (Our kids are not eligible for CRBA)",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (Family/Adjustment of status)"
    },
    {
        "id": "1dkozzf",
        "title": "CRBA Question (Sorry if wrong tag!)",
        "score": 1,
        "num_comments": 1,
        "author": "ThatMexicanyouknow",
        "created_utc": 1718924189.0,
        "created_readable_utc": "2024-06-20 22:56:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dkozzf/crba_question_sorry_if_wrong_tag/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dkozzf/crba_question_sorry_if_wrong_tag/",
        "selftext": "Hello!  \nI am currently trying to fill out a I-130 Petition for my Father. He has never lived in the US and I was born in Mexico to him and my American mother. She got me a Certificate of Birth Abroad (CRBA) immediately after I was born. In the form it asks me if I have a Certificate of Citizenship or a Certificate of Naturalization, I have neither and am confused as to what to enter here because currently my information makes it look like I shouldn't have citizenship since I state I was born in Mexico. To clarify the situation a bit more, parents got divorced long ago which is why my mom is not the one doing this process, and I have double checked that I have no certificate of citizenship, all I have is a CRBA, what should I do?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },

    {
        "id": "1di78vr",
        "title": "Dilemma ",
        "score": 1,
        "num_comments": 6,
        "author": "Fabulous-Bowl-2594",
        "created_utc": 1718654014.0,
        "created_readable_utc": "2024-06-17 19:53:34 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1di78vr/dilemma/",
        "permalink": "https://reddit.com/r/USCIS/comments/1di78vr/dilemma/",
        "selftext": "When I filed I-130 for my spouse I was a us citizen by naturalization, later on, we had a child. Now the case is approved. How can I add a child to the case?  \nN.B: Our child has a CRBA and a passport. \nThank you. I would like to hear from you. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1ddj9w2",
        "title": "Naturalized Citizen with daughter living abroad",
        "score": 0,
        "num_comments": 6,
        "author": "CuriousGeorge1828",
        "created_utc": 1718125551.0,
        "created_readable_utc": "2024-06-11 17:05:51 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ddj9w2/naturalized_citizen_with_daughter_living_abroad/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ddj9w2/naturalized_citizen_with_daughter_living_abroad/",
        "selftext": "Hi all,\n\nI am a naturalized US Citizen and I live full time in the USA. My daughter (under 18) lives abroad with her mother (never married). She travels back and forth to visit often. I am trying to figure out the process of applying for citizenship for my daughter. She is not eligible for CRBA since she was born before I became a naturalized citizen. \n\nMy daughter doesn't plan on moving to the USA with me full time at this time but I would like her citizenship established if she chooses to move after she turns 18 or anytime in the future.\n\nFrom my research it seems like a N-600K may be the route but then another option brought me down the road of getting a green card (I-130) for her first but I am not trying to bring her the USA as a resident right now. \n\nMy daughter's mother and I have a great relationship so getting documents etc. won't be an issue.\n\nAny help or guidance would be very appreciated!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

    {
        "id": "1cui0kf",
        "title": "Just submitted today! We are both DEAF, I hope it won’t be an obstacle!",
        "score": 8,
        "num_comments": 6,
        "author": "Wizardscientist7",
        "created_utc": 1715984504.0,
        "created_readable_utc": "2024-05-17 22:21:44 UTC",
        "url": "https://i.redd.it/a6p4ot1ya21d1.jpeg",
        "permalink": "https://reddit.com/r/USCIS/comments/1cui0kf/just_submitted_today_we_are_both_deaf_i_hope_it/",
        "selftext": "I am 26M us citizen, sponsoring 29F Mexican citizen, to move to USA. We also have a baby born here in Mexico… I have already obtained CRBA birth certificate for our son… and had uploaded it to USCIS, to prove that we are legitimately married. \n\nI hope everything I am doing is right. I submitted I-130 with i-130a. Paid $625.\n\nWhat next? We wait…? And we apply for I-485 to change her status to green card right?\n\nWe are not able to use telephones, we are deaf… hopefully this won’t be a problem. \n\nI would appreciate any kind of input, tips, feedback, and all that.  \n\nMuch thanks ",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },

    {
        "id": "1chst2k",
        "title": "CRBA Question ",
        "score": 1,
        "num_comments": 7,
        "author": "Minute-Toe5235",
        "created_utc": 1714586719.0,
        "created_readable_utc": "2024-05-01 18:05:19 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1chst2k/crba_question/",
        "permalink": "https://reddit.com/r/USCIS/comments/1chst2k/crba_question/",
        "selftext": "Hi so I've been working on a CRBA application for some time now and I have a question which I thought someone who successfully completed the process may be able to answer.\nI have asked Citizen's Services and I've also called the embassy but nobody can answer my question.\n\nAfter waiting quite some time, yesterday I logged into MyTravelGov to check the status of the CRBA I applied for and, where it once said Processing, the status now says Shipped to Embassy/Consulate.\nDoes this mean that the CRBA was approved?\nI still am unsure if I'd be notified of approval or not so am just kind of waiting.\nDoes anyone know what this new status chang means?\nThanks",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.99,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1cgp7zz",
        "title": "K1 Visa Finally Approved",
        "score": 14,
        "num_comments": 32,
        "author": "Ok-Trip7404",
        "created_utc": 1714471693.0,
        "created_readable_utc": "2024-04-30 10:08:13 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1cgp7zz/k1_visa_finally_approved/",
        "permalink": "https://reddit.com/r/USCIS/comments/1cgp7zz/k1_visa_finally_approved/",
        "selftext": "Filed my fiance's K1 petition in December of 2022 and yesterday she finally had her interview at the embassy and was approved. This morning we went back to the embassy and had our son's interview for his CRBA and US Passport and that was approved as well pending receipt of an additional document they need.\n\nWe were a bit disappointed that the process took so long. We were told by others that theirs only took 4-6 months. Unfortunately for us, our petition got sent to the California processing office which does take significantly longer than the other offices. Total time was 16 months until approval at the embassy. All in all though, it was an easy process, especially considering I sent in all required documents with my petition. This included the affidavit of support, divorce papers, and all other evidences like photos and messages. Also, my fiance said the interviewing officer was very nice, which I'm greatful for because she was very nervous when she left. Americans tend to get a bad rep here for being rude. \n\nAnyway, we're glad the waiting game is over, and now hope all will be well when we go through the port of entry when we land in California for our layover. If anyone has any tips on what to do when we get there and talk to immigration, it would be greatly welcomed. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Rant"
    },
    {
        "id": "1c4w5oh",
        "title": "CRBA",
        "score": 1,
        "num_comments": 4,
        "author": "rbrbrbrbb",
        "created_utc": 1713211787.0,
        "created_readable_utc": "2024-04-15 20:09:47 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1c4w5oh/crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1c4w5oh/crba/",
        "selftext": "Hi! My wife (US Citizen) and I are applying for our newborn’s CRBA. She meets the 5 year requirement for physical presence in the US however we are struggling to find the necessary evidence to support this - particularly of the time when she was a newborn and young child of upto 4yrs. After that, she lived a couple of years during her teenage years - of which we do have sufficient evidence.\n\nAny thoughts on what evidence could be presented to prove that she lived in the US until the age of 4? Thank you in advance for any ideas! 🙌🏽 ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "1c4k0ix",
        "title": "Fastest way for child to enter the US",
        "score": 0,
        "num_comments": 13,
        "author": "Under_A_Rock247",
        "created_utc": 1713181124.0,
        "created_readable_utc": "2024-04-15 11:38:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1c4k0ix/fastest_way_for_child_to_enter_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/1c4k0ix/fastest_way_for_child_to_enter_the_us/",
        "selftext": "My case is rather unique. I am a US citizen by birth but haven't lived there long, so my kids are not eligible for direct citizenship through me (CRBA). I filed the I-130 for my husband and son in 2020. In 2022 we had a daughter while I was abroad with my husband. We thought she would be added to my husband's case which was at NVC. That wasn't possible and this year we filed her I-130. My husband and son have their visas now and have to go to the US in the nest couple of months. What is the quickest way for us to take\\`our daughter with us?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "1c3k1pm",
        "title": "CRBA and US Passport",
        "score": 0,
        "num_comments": 40,
        "author": "Bright-Door-1640",
        "created_utc": 1713065650.0,
        "created_readable_utc": "2024-04-14 03:34:10 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1c3k1pm/crba_and_us_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/1c3k1pm/crba_and_us_passport/",
        "selftext": "My baby was born outside of the US (her dad is a citizen, im not). We’ve been trying to get her passport and CRBA applications submitted for over a month now with the Consulate here but they keep requesting entry and exit stamps from my husband since the time he was born. Mind you we submitted over 101 documents on the e-CRBA application and had them all in our interview for proof of physical presence in the US. But they are so hung up on the fact that my husband used to spend his summer holidays during university abroad to see his family for 2 months every year that they keep saying the information provided is insufficient. We just sent them all my husband’s 4 passports since birth and im hoping it goes through. \n\nWhat happens if the application gets rejected? How come my baby possibly cant get the passport despite her dad being a citizen and has lived in the states for most of his teenage and adult life. I dont get it. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },

    {
        "id": "1c22m97",
        "title": "CRBA QUESTION",
        "score": 1,
        "num_comments": 1,
        "author": "JohnykinSephie",
        "created_utc": 1712905011.0,
        "created_readable_utc": "2024-04-12 06:56:51 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1c22m97/crba_question/",
        "permalink": "https://reddit.com/r/USCIS/comments/1c22m97/crba_question/",
        "selftext": "Can anyone help me with a CRBA Inquiry, One of the CRBA requirement for a child to be eligible is for US Citizen Parent to have had spent 5 Years in the USA prior to the childs birth, is it 5 Years after becoming a US Citizen? Or can the Years spent in the USA as a Permanent Resident/Green Card holder count in that required 5 Years for CRBA Eligibility? Thank You all kindly for the answers.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
   

    {
        "id": "1btsldh",
        "title": "Will child's CRBA speed up wife's I-130?",
        "score": 1,
        "num_comments": 4,
        "author": "antisocialtomboy",
        "created_utc": 1712042554.0,
        "created_readable_utc": "2024-04-02 07:22:34 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1btsldh/will_childs_crba_speed_up_wifes_i130/",
        "permalink": "https://reddit.com/r/USCIS/comments/1btsldh/will_childs_crba_speed_up_wifes_i130/",
        "selftext": " I filed a petition for my wife (i-130) 5 months after my child's consular report of birth abroad was approved. my wife and child both live abroad. will that speed up her i-130?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "1bit2eh",
        "title": "Do I need a itin if my wife is going to apply for a green card ",
        "score": 1,
        "num_comments": 3,
        "author": "Kenoughttt",
        "created_utc": 1710876945.0,
        "created_readable_utc": "2024-03-19 19:35:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1bit2eh/do_i_need_a_itin_if_my_wife_is_going_to_apply_for/",
        "permalink": "https://reddit.com/r/USCIS/comments/1bit2eh/do_i_need_a_itin_if_my_wife_is_going_to_apply_for/",
        "selftext": "Here’s my situation. I got married last year and I want file my tax return. We have a baby whom already is an American. He has his CRBA, SS & passport. This year we are going to apply for my wife’s green card. For my tax return, I need to put her on there, it’s required to have a ss or a itin? Is this true? Also what do I do I can’t leave it blank. Please help I was planning on putting head of household. She doesn’t work and is taking care of our baby in Mexico.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Social Security Support"
    },
    {
        "id": "1az7e1e",
        "title": "Child abroad",
        "score": 1,
        "num_comments": 15,
        "author": "Gloomy_Shallot_5524",
        "created_utc": 1708813713.0,
        "created_readable_utc": "2024-02-24 22:28:33 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1az7e1e/child_abroad/",
        "permalink": "https://reddit.com/r/USCIS/comments/1az7e1e/child_abroad/",
        "selftext": "Hello everyone, Hopefully some can help me with my scenario, my wife had her immigration visa delivered a couple of weeks ago, a month before that we attended my daughter's CRBA (Child Report of born abroad) and was denied, she is 3 years old and we are now pending on her I130. Now, for my understanding, my wife need's to go to the us in order to receive her green card, and it has to be before her visa expires, with me being a military member, there is no one to stay back and wait for my child's i130 to be approved.\n\nwhat would be our best way to take care of my daughter?\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },


    {
        "id": "1asgzgn",
        "title": "CRBA status",
        "score": 3,
        "num_comments": 5,
        "author": "RealisticAd8958",
        "created_utc": 1708111067.0,
        "created_readable_utc": "2024-02-16 19:17:47 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1asgzgn/crba_status/",
        "permalink": "https://reddit.com/r/USCIS/comments/1asgzgn/crba_status/",
        "selftext": "Hello,\n\nI applied for my childs CRBA and the status shows Shipped to embassy/consulate. Can any one know what is the next status that shows up? \n\nAlso, can it be denied after the interview? Everything looked good at the interview.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },
    {
        "id": "1aq9k74",
        "title": "Can the non-citizen parent's name be added to the CRBA?",
        "score": 1,
        "num_comments": 1,
        "author": "Altruistic_Inside691",
        "created_utc": 1707870993.0,
        "created_readable_utc": "2024-02-14 00:36:33 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1aq9k74/can_the_noncitizen_parents_name_be_added_to_the/",
        "permalink": "https://reddit.com/r/USCIS/comments/1aq9k74/can_the_noncitizen_parents_name_be_added_to_the/",
        "selftext": "Assuming a child is eligible for a CRBA, can a non-US parent's name be added to the CRBA?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },

  
    {
        "id": "1amj1yz",
        "title": "USC new born children no CRBA elegible",
        "score": 1,
        "num_comments": 15,
        "author": "carlosvieri1",
        "created_utc": 1707465224.0,
        "created_readable_utc": "2024-02-09 07:53:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1amj1yz/usc_new_born_children_no_crba_elegible/",
        "permalink": "https://reddit.com/r/USCIS/comments/1amj1yz/usc_new_born_children_no_crba_elegible/",
        "selftext": "So my wife is a US citizen by birth but left the country before turning 14 and thus our child cannot get a CRBA.\n\nDoes anyone know what must we do in order for our children to get the US citizenship? Is he not longer eligible at all? Or would he acquire the citizenship if we move and live in the US for two years?\n\nFurthermore how long would it take to obtain a consular I-130? The same than for a spouse or would it be an expedited case as their is a clear  bound between the mother and the child?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
    {
        "id": "1aiyyzh",
        "title": "CBRA: if both parents are citizens, do I need both parents' proof of presence?",
        "score": 0,
        "num_comments": 8,
        "author": "Traditional-Ad-7836",
        "created_utc": 1707081776.0,
        "created_readable_utc": "2024-02-04 21:22:56 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1aiyyzh/cbra_if_both_parents_are_citizens_do_i_need_both/",
        "permalink": "https://reddit.com/r/USCIS/comments/1aiyyzh/cbra_if_both_parents_are_citizens_do_i_need_both/",
        "selftext": "Hi there!\n\nI am working on my daughter's CRBA application and though my partner is a naturalized US citizen, I was only gathering my information, thinking that you only need one citizen parent. As I fill out the online application it is also asking me for his proof of presence.\n\n&#x200B;\n\nMy presence in the US is a lot easier to document since I've only ever had one passport. His is more complicated since he's been traveling since the 2000s, I don't have those records and he only has his most recent passport. I know this is fine and I can estimate dates, and that he has enough proof of presence in the US, but it would be easier to only provide mine since I've already got it all together.\n\n&#x200B;\n\nAnyone have any experience with this that might let me know if it is really necessary to be super thorough on parent 2?\n\n&#x200B;\n\nThank you:)\n\n&#x200B;\n\nupdate spelling CRBA",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "1ag1dls",
        "title": "i-130 expedite question",
        "score": 3,
        "num_comments": 1,
        "author": "Mammoth_Pen3933",
        "created_utc": 1706758416.0,
        "created_readable_utc": "2024-02-01 03:33:36 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ag1dls/i130_expedite_question/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ag1dls/i130_expedite_question/",
        "selftext": "My wife is a us citizen who applied for my i-130 a year ago and thankfully it got approved and i’m currently awaiting my interview call from the nvc. During this time we had a baby and applied for his crba however it got rejected as my wife didn’t complete her 5 years physical presence. We applied for my baby’s i-130 around a week ago, so could anyone tell me if i could have it expedited on the grounds that as soon as i get my visa i have to leave within 6 months, so no one would be here with the baby as the i-130 takes atleast an year.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "1adkx0h",
        "title": "i-130 evidence is this enough?",
        "score": 2,
        "num_comments": 7,
        "author": "Middle_Environment_2",
        "created_utc": 1706497347.0,
        "created_readable_utc": "2024-01-29 03:02:27 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1adkx0h/i130_evidence_is_this_enough/",
        "permalink": "https://reddit.com/r/USCIS/comments/1adkx0h/i130_evidence_is_this_enough/",
        "selftext": "Hello I plan on applying soon, we have been married for 7 years but live overseas. would a translated marriage certificate and a crba with my wifes name on it as the mother be enough proof?  Can all these also be uploaded online or does evidence need to be mailed?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    
    {
        "id": "198rxsf",
        "title": "I have CRBA for my son, is a N600 certificate of citizenship needed ?",
        "score": 2,
        "num_comments": 10,
        "author": "Thejamiejames",
        "created_utc": 1705480547.0,
        "created_readable_utc": "2024-01-17 08:35:47 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/198rxsf/i_have_crba_for_my_son_is_a_n600_certificate_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/198rxsf/i_have_crba_for_my_son_is_a_n600_certificate_of/",
        "selftext": "So I might sound like a dumb question here. I know CRBA is primarily facie proof of citizenship but is there any benefit to applying for a citizenship certificate? I just want to make sure I set my son up in the future so his citizenship is never questioned.  I’ve never heard of a CRBA being revoked.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    {
        "id": "198nf9r",
        "title": "CRBA rejected, any other way??",
        "score": 22,
        "num_comments": 43,
        "author": "Mammoth_Pen3933",
        "created_utc": 1705464253.0,
        "created_readable_utc": "2024-01-17 04:04:13 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/198nf9r/crba_rejected_any_other_way/",
        "permalink": "https://reddit.com/r/USCIS/comments/198nf9r/crba_rejected_any_other_way/",
        "selftext": "Hi i’m a us citizen who is currently living abroad. During my time abroad i had a baby with my husband abroad. We filed for his CRBA, but it was rejected, because i didn’t complete the 5 year policy. I also filed for my Husbands i-130 in 2023, which is at nvc as of right now , and we both hadplanned to leave in around 6 months, so is there anyway to get my baby to the usa without having to file for i-130 for my baby as it takes around 1.5 years, and my husband won’t be here to support me. i’ve heard that the baby could be added to my husbands case, or that he could be given a waiver/temporary visa, to be transported to the usa .Pls let me know if there is any way and thank you for reading.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.87,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
  
    {
        "id": "192bayi",
        "title": "Filing CRBA and US passport at the same time for New Born",
        "score": 1,
        "num_comments": 10,
        "author": "3773vj",
        "created_utc": 1704794477.0,
        "created_readable_utc": "2024-01-09 10:01:17 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/192bayi/filing_crba_and_us_passport_at_the_same_time_for/",
        "permalink": "https://reddit.com/r/USCIS/comments/192bayi/filing_crba_and_us_passport_at_the_same_time_for/",
        "selftext": "Hello,\n\nI have filed the CRBA application. Interview slot is in Feb. Was wondering, if I can file US Passport application now, or should I wait until CRBA is completed.\n\n&#x200B;\n\nThanks",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
    
    {
        "id": "18x9zzs",
        "title": "I-130 Evidence section missing pages",
        "score": 0,
        "num_comments": 2,
        "author": "typhoto",
        "created_utc": 1704254888.0,
        "created_readable_utc": "2024-01-03 04:08:08 UTC",
        "url": "https://www.reddit.com/gallery/18x9zzs",
        "permalink": "https://reddit.com/r/USCIS/comments/18x9zzs/i130_evidence_section_missing_pages/",
        "selftext": "When filing online, how come the Evidence section does not show all the necessary pages to upload documents? For example, I am trying to upload a divorce certificate for my spouse but there is no specific page to do this within Evidence. I can see that this should be a page when I am in the Additional Information section. Has anyone run into this and how did you go about uploading the documents?",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "18rscfp",
        "title": "I864 sponsor and joint sponsor household size with dependents.",
        "score": 1,
        "num_comments": 2,
        "author": "EnvironmentalPilot42",
        "created_utc": 1703653192.0,
        "created_readable_utc": "2023-12-27 04:59:52 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/18rscfp/i864_sponsor_and_joint_sponsor_household_size/",
        "permalink": "https://reddit.com/r/USCIS/comments/18rscfp/i864_sponsor_and_joint_sponsor_household_size/",
        "selftext": "Ive read the i864 instructions and posts here but it doesnt seem specifically I have come across a clear and correct answer to this question.   \n\n\nI am the petitioner my wife the beneficiary. We both live abroad and doing consular processing. We have two kids who became citizens at birth of US they have passports,SSN and CRBA‘s. of course my foreign income abroad doesnt count but I still fill out the i864 which I did. My joint sponsor is my mom (parents are divorced and my dad remarried) lives alone. she also has to file i864 I know but on her form my question is if A.) does she have to list my children because it states in that section where they would be put immigrants and doesnt even give a place to put if they have SSN or B.) if so then where do I put them?\n\nC.) as the main petitioner do I also have to list myself under my moms household? We of course dont live together and im not her dependent.   \n\n\nthank you for any help  we have scoured the internet but it seems this scenario with citizen children and household size with petitioner is unclear. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-864 (Affidavit of Support)"
    },
   

    {
        "id": "18iv51c",
        "title": "My wife (USC) hasnt visited USA before",
        "score": 0,
        "num_comments": 7,
        "author": "proudmaker",
        "created_utc": 1702627396.0,
        "created_readable_utc": "2023-12-15 08:03:16 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/18iv51c/my_wife_usc_hasnt_visited_usa_before/",
        "permalink": "https://reddit.com/r/USCIS/comments/18iv51c/my_wife_usc_hasnt_visited_usa_before/",
        "selftext": "We are 7 months in the i130 stage, is it a requirement for my wife to be living in the US (or has visited before)? Lets say the i130 got approved; will the nvc give me a hard time about it?\n\nNote, my wife was born abroad (got US passport from her father) and has CRBA (form FS-240)",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
   
    {
        "id": "17vumc4",
        "title": "Expedite request for I-130",
        "score": 1,
        "num_comments": 12,
        "author": "Past_Neighborhood846",
        "created_utc": 1700057957.0,
        "created_readable_utc": "2023-11-15 14:19:17 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/17vumc4/expedite_request_for_i130/",
        "permalink": "https://reddit.com/r/USCIS/comments/17vumc4/expedite_request_for_i130/",
        "selftext": "Hello! I just submitted an expedite request for my wife’s I-130 application. And am wondering on how strict they are with approving them? \nI submitted my I-130 back in March been waiting ever since. I am in the military and stationed in Hawaii as an infantryman. I mainly used the basis that I am PCS’ing in January of 2024 which means I am going to a new duty station wherever the army wants me to go and would like my wife and daughter to be here with me for all of that and I uploaded proof of me leaving in January of 2024. I also included that I have done my daughter’s CRBA and gotten her U.S. passport and I included I am an infantryman so I could deploy at any given time to anywhere and it’s not looking too good in the near future for the U.S. so I would also like my family to be with me in case I were to get deployed in the near future. Just looking for other peoples thoughts on this! Thanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },


    {
        "id": "170o5uq",
        "title": "I’m the child of a U.S. citizen who’s refused to take care of me throughout my whole childhood and I now want to acquire U.S. citizenship",
        "score": 19,
        "num_comments": 45,
        "author": "NeighborhoodMore3595",
        "created_utc": 1696527590.0,
        "created_readable_utc": "2023-10-05 17:39:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/170o5uq/im_the_child_of_a_us_citizen_whos_refused_to_take/",
        "permalink": "https://reddit.com/r/USCIS/comments/170o5uq/im_the_child_of_a_us_citizen_whos_refused_to_take/",
        "selftext": "Made a new account since I’m talking about my personal life and I don’t want that on my main. \n\nSo as the title says, my father is a U.S. citizen and has been absent from my life. No child support, barely any online contact (since I was born and raised in another country and he lives in the U.S.) and I’ve never seen him in person besides a couple months when I was a baby and my mom had gone to live with him which she regretted soon after and came back to her home country. They’re now divorced and I turned 18 a week ago but he has yet to declare me as his child at a U.S. consulate/embassy or anything of the sort (his name is on my birth certificate from my birth country though but I doubt that would help in any way). Every time I’ve asked him to do so he’s been very evasive and said he would do it but never did.\n\n\nNow that I’m 18 I want to acquire the citizenship mainly to make it easier for me to go to the U.S. and study there until I’m done with college. The research i’ve done on the process to acquiring the citizenship hasn’t really been helpful because it seems to always involve him filling out a form which I’m 100% sure he will refuse to do. Apparently since I’m 18 I’m not eligible for a CRBA to get the passport and I can’t use the N-600 form if my understanding is correct. \n\n\nDoes anyone know a way for me to get the passport without needing his involvement or legally force him to declare me?\nAny help would be very much appreciated.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.88,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },

 
    {
        "id": "15t2sm0",
        "title": "CRBA QUESTIONS",
        "score": 1,
        "num_comments": 4,
        "author": "kariniush",
        "created_utc": 1692221512.0,
        "created_readable_utc": "2023-08-16 21:31:52 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/15t2sm0/crba_questions/",
        "permalink": "https://reddit.com/r/USCIS/comments/15t2sm0/crba_questions/",
        "selftext": "How hard is it for me to file for the CRBA\nOr should i use a service that does that for me?\n\nAlso what should i bring to the interview?\nPhoto albums? Reciepts? Etc",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },

    {
        "id": "15fkm2k",
        "title": "Spouse I-130 approved, but expecting a baby now",
        "score": 3,
        "num_comments": 6,
        "author": "21caratgold",
        "created_utc": 1690914502.0,
        "created_readable_utc": "2023-08-01 18:28:22 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/15fkm2k/spouse_i130_approved_but_expecting_a_baby_now/",
        "permalink": "https://reddit.com/r/USCIS/comments/15fkm2k/spouse_i130_approved_but_expecting_a_baby_now/",
        "selftext": "My husband's I-130 has finally been approved after a year of waiting. However, now we are expecting our first child and I do not meet the requirements to pass down citizenship and obtain a Consular Report of Birth Abroad (CRBA). \n\nSo I'm wondering what would happen if I were to give birth abroad (prefer to be around family). Would I have to file another i-130 and wait another year for our child?\n\nIt's mentioned on the DS-260 form that: \n\"The immigration and nationality act does not allow derivative status to family members of immediate relatives. For example IR1, CR1, IR2, CR2, and IR5 classifications are immediate relative visa categories. The petitioner must file separate immediate relative petitions for the spouse, each child and each parent.\"\n\nHas anyone else been in a similar situation? Would it be possible to add our child to his application or should I just travel and give birth in the States?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },

    {
        "id": "14s92q0",
        "title": "Working on case",
        "score": 1,
        "num_comments": 2,
        "author": "Impressive_Media_492",
        "created_utc": 1688649681.0,
        "created_readable_utc": "2023-07-06 13:21:21 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/14s92q0/working_on_case/",
        "permalink": "https://reddit.com/r/USCIS/comments/14s92q0/working_on_case/",
        "selftext": "So my husband applied for AOS for me and our son. However, later we found out that our son was automatically a US citizen thru his dad. We did is CRBA I uploaded that info to my I130 and didn’t continue with his AOS. Now this morning I saw an message saying action was taken an his case. Does that mean they are working on my case too? Pd is oct 20, 2022.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (AOS)"
    },
   
    {
        "id": "13qmnu8",
        "title": "Form I-130 or CRBA?",
        "score": 2,
        "num_comments": 2,
        "author": "Aromatic-Golf6237",
        "created_utc": 1684937029.0,
        "created_readable_utc": "2023-05-24 14:03:49 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/13qmnu8/form_i130_or_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/13qmnu8/form_i130_or_crba/",
        "selftext": "Hello all! I would really appreciate any advice on a matter!! My brother recently got married this past year and wants to file a I-130 for his wife (lives in foreign country) & his child with his wife.\n\nHis kid was born out of wedlock & abroad to a US Citizen (him) and non-US mother (Mexican national). We are wondering whether he should file a Form I-130 or do a consular birth (CRBA)? Has anyone been in a similar situation?? \n\nWe have an appointment with a lawyer in a few weeks but they are very impatient…",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "13iqyqb",
        "title": "CRBA average arrival?",
        "score": 1,
        "num_comments": 3,
        "author": "liberty340",
        "created_utc": 1684200290.0,
        "created_readable_utc": "2023-05-16 01:24:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/13iqyqb/crba_average_arrival/",
        "permalink": "https://reddit.com/r/USCIS/comments/13iqyqb/crba_average_arrival/",
        "selftext": "I filed for CRBA and US passport for my 3-month-old son the other day and I was just wondering how long it takes on average for them to process and arrive.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },

 
    {
        "id": "13643dv",
        "title": "CRBA Copy",
        "score": 1,
        "num_comments": 1,
        "author": "lbalbalba",
        "created_utc": 1683070542.0,
        "created_readable_utc": "2023-05-02 23:35:42 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/13643dv/crba_copy/",
        "permalink": "https://reddit.com/r/USCIS/comments/13643dv/crba_copy/",
        "selftext": "Has anyone recently requested a copy of their CRBA? Curious on how long it took and where the document shipped from? \n\nI requested the copy 2 months ago and have informed delivery through USPS. Just wondering if I am looking at the right place or if it is going to take much longer.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },

    {
        "id": "11o0433",
        "title": "Waiting on a CRBA, found out they updated the process after I submitted my forms, what can I do?",
        "score": 1,
        "num_comments": 1,
        "author": "riotlancer",
        "created_utc": 1678480608.0,
        "created_readable_utc": "2023-03-10 20:36:48 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/11o0433/waiting_on_a_crba_found_out_they_updated_the/",
        "permalink": "https://reddit.com/r/USCIS/comments/11o0433/waiting_on_a_crba_found_out_they_updated_the/",
        "selftext": "I submitted, following the instructions that were on the website at the time, notarized documents along with copies of my IDs and payment requesting my CRBA in December 2022.\n\nLater that month they processed my payment. I knew that the process would take a few weeks, so I didn't think to follow up until Feburary 2023.\n\n\nIn February 2023 I submitted an inquiry on their website; it indicated I should wait a couple weeks for a response. I never received a response so I checked back on the website today and discovered that in January 2023 they updated the process to include form DS5542. Since this form was not part of the requirements back in December, I never submitted this form. \n\nWhat can I do? Should I get in contact with someone? How can I get in touch with them? There is a USCIS office in my city (Las Vegas); would making an appointment help?\n\nIf it matters, I need this document for a REALID and a passport. I was born overseas on a naval base. My father was in the US Navy.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },

    {
        "id": "10yihg4",
        "title": "Does \"Consular Report of Birth Abroad\" show nationalities of the child's parents?",
        "score": 0,
        "num_comments": 2,
        "author": "Dakota3000",
        "created_utc": 1676011306.0,
        "created_readable_utc": "2023-02-10 06:41:46 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/10yihg4/does_consular_report_of_birth_abroad_show/",
        "permalink": "https://reddit.com/r/USCIS/comments/10yihg4/does_consular_report_of_birth_abroad_show/",
        "selftext": "Hi,\n\nMy son was born abroad and we have the Consular Report of Birth Abroad (CRBA). Does the document show anywhere the nationalities of the parents listed? We recently submitted it for some paper work and we are asked about that. Please let me know. Thanks a bunch in advance.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },

    {
        "id": "10fa2h5",
        "title": "Has anyone done in online CRBA application?",
        "score": 1,
        "num_comments": 2,
        "author": "Kay-x313",
        "created_utc": 1674055631.0,
        "created_readable_utc": "2023-01-18 15:27:11 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/10fa2h5/has_anyone_done_in_online_crba_application/",
        "permalink": "https://reddit.com/r/USCIS/comments/10fa2h5/has_anyone_done_in_online_crba_application/",
        "selftext": "How do you fill it out what information does it request me and my wife both Americans citizens?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "10ezy22",
        "title": "CRBA issue",
        "score": 4,
        "num_comments": 11,
        "author": "Ok_Cantaloupe_8824",
        "created_utc": 1674022200.0,
        "created_readable_utc": "2023-01-18 06:10:00 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/10ezy22/crba_issue/",
        "permalink": "https://reddit.com/r/USCIS/comments/10ezy22/crba_issue/",
        "selftext": "I am currently pregnant and would like to pass on my US Citizenship to my newborn, who will be born out of the country. I was born abroad to my US citizen father (born and bred). My grandparents were also US citizens. I have been visiting the US throughout my life and graduated from college in the US, but unfortunately I do not meet the 5 year physical presence requirement.\n\nIs there any other way for my newborn to obtain my US citizenship? \n\nIt worries me as I have property/stocks/funds in the US that would benefit my children in the future. This would be heavily taxed if they ended up not obtaining US citizenship. (If anyone could speak on this too, that would be great.)\n\nThanks for any information!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },
    {
        "id": "10cknpa",
        "title": "CRBA Proof of Physical Presence",
        "score": 2,
        "num_comments": 7,
        "author": "Middle_Eggplant_7368",
        "created_utc": 1673791415.0,
        "created_readable_utc": "2023-01-15 14:03:35 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/10cknpa/crba_proof_of_physical_presence/",
        "permalink": "https://reddit.com/r/USCIS/comments/10cknpa/crba_proof_of_physical_presence/",
        "selftext": "I am a US citizen and my daughter was born abroad after I became a citizen. However, I have not lived in the US up to 5 years. It is possible to apply for a proof of physical presence waiver.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "108hvje",
        "title": "How early can you apply for CRBA?",
        "score": 1,
        "num_comments": 6,
        "author": "busterbluth34",
        "created_utc": 1673377391.0,
        "created_readable_utc": "2023-01-10 19:03:11 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/108hvje/how_early_can_you_apply_for_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/108hvje/how_early_can_you_apply_for_crba/",
        "selftext": "I live abroad and will need to apply for my second child’s CRBA and passport after birth in April. Are there any stipulations on how soon it can be applied for after birth?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },

    {
        "id": "zqewlb",
        "title": "CRBA and passport",
        "score": 1,
        "num_comments": 2,
        "author": "Some-Ad530",
        "created_utc": 1671512152.0,
        "created_readable_utc": "2022-12-20 04:55:52 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/zqewlb/crba_and_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/zqewlb/crba_and_passport/",
        "selftext": "So I’m an American citizen and my son was born in Mexico.  I’m trying to fill out the DS-11 so I can get my son’s passport the same time I get the CRBA, but it does not give me an option to select city/state in Mexico where he is born (only cities/states in the US). Our appointment is scheduled for January 3rd in Mexico City.  Can someone please provide some guidance?  Thank you so much in advance",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "ziiafr",
        "title": "Newborn abroad of the USA",
        "score": 3,
        "num_comments": 3,
        "author": "Beablade",
        "created_utc": 1670740397.0,
        "created_readable_utc": "2022-12-11 06:33:17 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/ziiafr/newborn_abroad_of_the_usa/",
        "permalink": "https://reddit.com/r/USCIS/comments/ziiafr/newborn_abroad_of_the_usa/",
        "selftext": "Hey, first I have just get my form I-130 approved and 2 days after my wife gave birth.\nMy question do I have to notice USCIS or to apply for CRBA by filling out forms ds2029. \nThanks",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },
    {
        "id": "z8409r",
        "title": "Filing CRBA for my child born abroad, short on 5 years physical presence in US",
        "score": 1,
        "num_comments": 19,
        "author": "Ok_Buy_483",
        "created_utc": 1669751325.0,
        "created_readable_utc": "2022-11-29 19:48:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/z8409r/filing_crba_for_my_child_born_abroad_short_on_5/",
        "permalink": "https://reddit.com/r/USCIS/comments/z8409r/filing_crba_for_my_child_born_abroad_short_on_5/",
        "selftext": "I am a US Citizen and my wife’s application for green card was approved few months ago however we did not get the visa stamped as we have other child whose case is pending interview for green card application. Now my wife delivered our 2nd child and i wanted to apply for CRBA as i am US citizen now. One of the requirements i realized lately is to show 5 years physical presence in US….and i am short on that by 4 months. I wanted to see if someone was in a same situation as mine, what options did they explore?\nShould i take a chance and go ahead file a CRBA request? Can there be an exception approval given my scenario? Or do i have any other option other than filing i130 again (that will take forever)?\n\nThanks for the help.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "z245uq",
        "title": "CRBA or N600k",
        "score": 2,
        "num_comments": 2,
        "author": "DeliciousSky2323",
        "created_utc": 1669149200.0,
        "created_readable_utc": "2022-11-22 20:33:20 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/z245uq/crba_or_n600k/",
        "permalink": "https://reddit.com/r/USCIS/comments/z245uq/crba_or_n600k/",
        "selftext": "My brother is a USC (Born in the USA) But never lived in the United States before his children were born (AND he still lives in Mexico with his family). I wanted to know if he needs to do a CRBA in the Mexican consulate (but because he can't meet his physical presence requirements, can he use our father's physical presence?) OR if his only option is to file a N600K, again using the Childrens' grandfather physical presence?  thank you in advance",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
 
    {
        "id": "yfhnw4",
        "title": "I need advice to bring my gf to the U.S",
        "score": 1,
        "num_comments": 11,
        "author": "peakmejoe",
        "created_utc": 1666942805.0,
        "created_readable_utc": "2022-10-28 07:40:05 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/yfhnw4/i_need_advice_to_bring_my_gf_to_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/yfhnw4/i_need_advice_to_bring_my_gf_to_the_us/",
        "selftext": "I (21m) have been dating this beautiful girl (20f) for almost 3 years. She lives in Mexico, never had a visa. We have a baby and I got him the Crba (I'm a U.S Citizen) and it was a 3 month process and I couldnt be more thankful. But I want to know if us having a child would affect her getting a visa or any advice of what should we do?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },

    {
        "id": "y70nf1",
        "title": "Who has custody over the child of a US citizen born abroad?",
        "score": 1,
        "num_comments": 1,
        "author": "740-park-ave",
        "created_utc": 1666080389.0,
        "created_readable_utc": "2022-10-18 08:06:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/y70nf1/who_has_custody_over_the_child_of_a_us_citizen/",
        "permalink": "https://reddit.com/r/USCIS/comments/y70nf1/who_has_custody_over_the_child_of_a_us_citizen/",
        "selftext": "Let's assume a US Citizen (father) and a non-US citizen (mother) had a child born in a foreign country and still living abroad. The father (US citizen) gave/transmitted US citizenship to the child at the US Consulate abroad (via a CRBA: Consular Report of a Birth Abroad). \n\nJust out curiosity: Does the father have sole custody of the child under US law? What rights does the father and child have in case, let's say, the mother decided to run away with the child? Can the US embassy/consulate be involved to bring the child back to their father?\n\nSorry if this is not the right forum. This is a purely hypothetical question and bears no resemblance to anything happening in reality. I'm just curious how custody laws or so work abroad.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },

    {
        "id": "wvis4h",
        "title": "Citizenship after entry (I-130) for 3 y.o. child",
        "score": 2,
        "num_comments": 12,
        "author": "lichtfleck",
        "created_utc": 1661241690.0,
        "created_readable_utc": "2022-08-23 08:01:30 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/wvis4h/citizenship_after_entry_i130_for_3_yo_child/",
        "permalink": "https://reddit.com/r/USCIS/comments/wvis4h/citizenship_after_entry_i130_for_3_yo_child/",
        "selftext": "I am a US citizen petitioning for my 3 y.o. foreign-born child (not eligible for CRBA) to get a green card via the I-130 process.  I am currently living outside of the US ***with*** him in my custody and plan to get back stateside.  In many comments on /r/USCIS, I've read that children are granted citizenship the moment they enter the US on an immigrant visa, yet I cannot find any reliable/official information that would confirm this.\n\nIs this actually true?  Or will they still have to satisfy the 3-year requirement of living in the US and apply for citizenship via Form N-400?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.76,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "wrzqox",
        "title": "CRBA application still under processing after passport was issued for the baby",
        "score": 2,
        "num_comments": 9,
        "author": "Subject_Ad_927",
        "created_utc": 1660869547.0,
        "created_readable_utc": "2022-08-19 00:39:07 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
        "permalink": "https://reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
        "selftext": "I am a U.S citizen by Naturalization and my wife is not. My wife gave birth to our second child in May 2022 in Mexico as we are still waiting for her I-130 approval(my wife). I filed out the application for CRBA online and choosed Mexico city as interview location, made the payment online. Few days later I received an email from U.S Embassy in Mexico city with interview appointment date scheduled in August(application was filled  in May), I tried to get earlier appointment but they told me that there is no earlier appointment that I can try to see if other consulate have opening , I checked the online system and we were lucky to find May 26 appointment at the U.S consulate in Merida.Scheduled another interview and asked Merida to request that Mexico city transferred our online application to Merida, they did and we went for the interview with all documents, officer at the interview told us that everything was fine and we request for an emergency passport for our daughter, the U.S passport was issued the same day, officer told us that our approved documents will be transferred to Mexico city for them to issue the CRBA since the online payment was made to them. In July I received email from U.S embassy in Mexico city asking for more proof of presence in the U.S, I sent 6 years of my credit card bills and also my bank statement as requested, few days later they contacted me and ask for more proof like travel history, I sent them record from the CBP with travel record from 2011-2021 (that was what FOIA/CBP sent me) Yesterday I received a call from them again that the assistant consul still need more documents but they did not say which documents. My question is, is this normal? My daughter already have a U.S emergency passport issued by the U.S consulate in Merida Mexico and valid for 1year, can the officer at the U.S embassy in Mexico city denied my daughter's CRBA application even though she already have a U.S passport? I got my citizenship last year and I travel on business trips from time to time but maintain physical presence in the U.S.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
    {
        "id": "w76jal",
        "title": "CRBA question about evidence of parent's US citizenship",
        "score": 2,
        "num_comments": 1,
        "author": "sol1016",
        "created_utc": 1658698318.0,
        "created_readable_utc": "2022-07-24 21:31:58 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/w76jal/crba_question_about_evidence_of_parents_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/w76jal/crba_question_about_evidence_of_parents_us/",
        "selftext": "\"Evidence of parent’s U.S. citizenshipThe U.S. citizen parent must present his/her US passport. If the U.S. citizen parent was naturalized he/she must bring the original Certificate of Naturalization or Citizenship in addition to their passport.\"  \n\n\nDo I really need original Certificate of Naturalization? because I only have a copy of it..   \nstill waiting for N-565 form that I applied earlier this year.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "w5i6qf",
        "title": "CRBA timeframe",
        "score": 2,
        "num_comments": 5,
        "author": "reg_0508_dab",
        "created_utc": 1658515821.0,
        "created_readable_utc": "2022-07-22 18:50:21 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/w5i6qf/crba_timeframe/",
        "permalink": "https://reddit.com/r/USCIS/comments/w5i6qf/crba_timeframe/",
        "selftext": "Hey all,\n\nI'm from the US, requested a CRBA about 2 months ago. Called and after an hour of waiting all I got was it is \"in review\", though they cashed my check over a month ago. I'm planning international travel in February and will still need to get a passport once I receive the CRBA (assuming I even submitted everything correctly). Any idea how long the CRBA (and subsequent passport) is going to take?\n\nTIA!\n\nUpdate: called again to check on the status, was on hold for nearly 3 hours before I couldn’t stay on anymore and had to hang up. Gotta love how dysfunctional the federal government is!\n\nUpdate #2: for anyone who may see this in the future - I received my CRBA on Aug 29th! So three months to the day",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.76,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },
  
    {
        "id": "vc0ka9",
        "title": "Number of Children to Include on DS 260 should we wait for new baby ?",
        "score": 5,
        "num_comments": 4,
        "author": "energyzmwa",
        "created_utc": 1655203063.0,
        "created_readable_utc": "2022-06-14 10:37:43 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/vc0ka9/number_of_children_to_include_on_ds_260_should_we/",
        "permalink": "https://reddit.com/r/USCIS/comments/vc0ka9/number_of_children_to_include_on_ds_260_should_we/",
        "selftext": "So we are working on filling an IV application (DS -260) for my wife as the I-130 has been approved. Of course I  was the one who petitioned for her. We already have one child together (which already has a US Passport the CRBA) and expecting a second. This is where filling out the DS 260 form is confusing me.\n\nShould we wait to sign and DS 260 until child is born and state second child? my issue is the delay its causing because I want to file ASAP and get inline for interview.  And waiting to report a second child which will not get a US passport until a few months is a bit risky. Although we live together, I would like to complete this immigration process as swiftly and effectively as possible\n\nAlso, Should the child we are stating be considered as 'immigrating' or not? As of now I have answered these as No because he has a US passport.\n\nMy next Question is regarding Vaccinations, If i can't find the report that she was infact to i answer the vaccine question and what do i expect for my wife? should she retake all the vaccines and derive a new record despite taking the vaccines?\n\nThank you in  advance!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.86,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    {
        "id": "v5q127",
        "title": "Child born after I130 approved for wife",
        "score": 5,
        "num_comments": 7,
        "author": "bladeone",
        "created_utc": 1654473714.0,
        "created_readable_utc": "2022-06-06 00:01:54 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/v5q127/child_born_after_i130_approved_for_wife/",
        "permalink": "https://reddit.com/r/USCIS/comments/v5q127/child_born_after_i130_approved_for_wife/",
        "selftext": "As the title says, I'm a US citizen and applied for my wife's immigration. Some time after the immigration application she became pregnant and we had a baby. Just before the baby was born, my wife's I130 was approved. Now we have to file for my wife's visa. I want to now bring my baby and wife with me to the US, together.\n\nI read about the Consular Report for Birth Abroad, which requires that the citizen parent spend at least 5 years in the US, of which two are after the age of 14. I do not meet this requirement (although according to INA 322 since my mom's in the US I can use her residence in the US to transmit citizenship).\n\nWhat is the process I would follow in this case? Would I try to file a CRBA for my baby, or would I somehow add the child to the I130 application? Or something else?\n\nAny advice would be much appreciated.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "uut756",
        "title": "Consular Record of Birth Abroad and Passport",
        "score": 3,
        "num_comments": 2,
        "author": "Snoo-94705",
        "created_utc": 1653158324.0,
        "created_readable_utc": "2022-05-21 18:38:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
        "selftext": "I've been trying to schedule an appointment for a CRBA and passport for my daughter for months now.\n\nEvery time that I go the appointment scheduling [link](https://evisaforms.state.gov/Instructions/ACSSchedulingSystem.asp) for the U.S. Consulate General in Tijuana, Mexico, there are no available slots.\n\nBecause of this, I have not been able to bring her into the U.S. since her birth more than seven months ago.  I am having to constantly travel between Chicago and Tijuana to be able to see my daughter.\n\nI have all documentation ready and on hand and I would like to see if I can get the process started as soon as possible.  Any ideas?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
    {
        "id": "t72c9z",
        "title": "Has anyone done a CRBA in Mexico, US Consulate?",
        "score": 1,
        "num_comments": 0,
        "author": "Snoo_69177",
        "created_utc": 1646457774.0,
        "created_readable_utc": "2022-03-05 05:22:54 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/t72c9z/has_anyone_done_a_crba_in_mexico_us_consulate/",
        "permalink": "https://reddit.com/r/USCIS/comments/t72c9z/has_anyone_done_a_crba_in_mexico_us_consulate/",
        "selftext": "I’ve been waiting about 15 weeks for my sons passport. I received his CRBA with in just a couple weeks. I reached out to the consulate in TJ on the matter but to not avail they never return my emails. They also have you pay for DHL postage for them to mail your items to you, and now the DHL tracking #s come back as unknown due to them not being used in a reasonable time. \n\nDoes anyone know if this is normal? I’m hoping once my fiancées i129f is approved we can cross with just his CRBA and I register for him a passport from over here. It’s been a nightmare because I can’t get him a social security without a photo I.D. , Waiting 15 weeks for the consulate to send a passport seems like somethings wrong. I’ve been seeing other countries with a U.S. consulate are sending passports within 3 weeks.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
 
    {
        "id": "t01ddq",
        "title": "Haven’t received S.S card and crba but have passport",
        "score": 1,
        "num_comments": 0,
        "author": "Maleficent-Station-2",
        "created_utc": 1645675711.0,
        "created_readable_utc": "2022-02-24 04:08:31 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/t01ddq/havent_received_ss_card_and_crba_but_have_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/t01ddq/havent_received_ss_card_and_crba_but_have_passport/",
        "selftext": "We applied for my son passport and crba last year in October and after two weeks we received his passport and crba but we noticed there was error w the mother name so we sent it back in after 5 days in October 2021 to get it fix and we was also able o apply for his social security card. Until now in February 2022 . We haven’t received them back . We contacted them through email but no reply",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Social Security Support"
    },
    {
        "id": "sxxqnn",
        "title": "Can we travel back into the US with our newborn while we wait for our CRBA appointment?",
        "score": 2,
        "num_comments": 17,
        "author": "doodydoo125",
        "created_utc": 1645461179.0,
        "created_readable_utc": "2022-02-21 16:32:59 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/sxxqnn/can_we_travel_back_into_the_us_with_our_newborn/",
        "permalink": "https://reddit.com/r/USCIS/comments/sxxqnn/can_we_travel_back_into_the_us_with_our_newborn/",
        "selftext": "Wife is from Mexico (US Permanent Resident), I’m a US citizen. I’ve lived in the states my whole life, can easily prove it, etc… If all goes well, the plan is to have the baby in Mexico, have the CRBA appointment, and travel back to the US shortly after. This is in Monterrey, MX.\n\nBut, we’ve heard that there may be delays in getting the CRBA appointment scheduled. For example, when the baby is born and we go to schedule the appointment, the next available appointment may not be for another 3 months.\n\nWhile we wait for our appointment date, are we able to travel (by car) back into the US and wait there? This CBP article says we only need the birth certificate to enter the US by land:\n\nhttps://help.cbp.gov/s/article/Article-3618?language=en_US\n\nHas anyone done this? As far as I’m aware we should be able to do this with no issues, but I want to hear from people that have either actually done it or know someone that has. Unfortunately with work I don’t think I’d be able to say in Mexico for an extended period of time (like 3 months).\n\nAlso, if anyone has recently had a birth in Mexico, and submitted the CRBA for the US, how long did it take you to get the appointment and go through the whole process?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "s7gia4",
        "title": "CRBA Passport Processing Times",
        "score": 2,
        "num_comments": 8,
        "author": "Snoo_69177",
        "created_utc": 1642563627.0,
        "created_readable_utc": "2022-01-19 03:40:27 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/s7gia4/crba_passport_processing_times/",
        "permalink": "https://reddit.com/r/USCIS/comments/s7gia4/crba_passport_processing_times/",
        "selftext": "Anyone know the time frame on receiving new passports via doing a child born abroad registration? I just received my child's CRBA about a month ago, but I still have not received his passport and passport card and the tracking # given to me has not updated. Its been about 8-9 weeks since. Silly me did not pay for expediting since I wasn't asked if I wanted it.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },

    {
        "id": "qs105y",
        "title": "CRBA Phyiscal Presence",
        "score": 1,
        "num_comments": 1,
        "author": "qwerty-yul",
        "created_utc": 1636683303.0,
        "created_readable_utc": "2021-11-12 02:15:03 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/qs105y/crba_phyiscal_presence/",
        "permalink": "https://reddit.com/r/USCIS/comments/qs105y/crba_phyiscal_presence/",
        "selftext": "I'm filling out DS-2029 for my two infants.  I grew up in the US attending university and working for 4 years.  After that, I left and have only been back to visit.  So my questions are:\n\n* I left the country a few times when I was younger for a week or two at a time.  Do they expect me to exclude the dates from those trips in the physical presence section?  This was like 40 years ago.  I have plenty of documentation -- high school diploma, university transcripts -- to prove I was in the US at the time.\n* In the last 20 years I've visited the US several times a year.  Do they expect me to include those dates in the physical presence section?  I won't be using them to qualify for physical presence.\n* My wife is not a US citizen, she's been to the US with me a few times.  Do I need to include the dates of her visits in the physical presence section?\n\nThanks a lot, just trying to save myself from several trips to the Consulate.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "DOS Support"
    },

    {
        "id": "o5k349",
        "title": "Visa for child's mother",
        "score": 1,
        "num_comments": 4,
        "author": "pimo91",
        "created_utc": 1624358578.0,
        "created_readable_utc": "2021-06-22 10:42:58 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/o5k349/visa_for_childs_mother/",
        "permalink": "https://reddit.com/r/USCIS/comments/o5k349/visa_for_childs_mother/",
        "selftext": "Hi all. Long story short I have a child with my girlfriend and am currently completing a CRBA for the child as we are overseas. I am the US citizen,  while she is not. Due to the pandemic and how it has affected the global economy, i am strongly considering a return to the US, but am having a hard time finding out what kind of Visa or immigrant status (what options are there?) For my childs mother due to us not being married but wanting to obviously keep the family together. Is there a specific process she would be eligible for based on having a US citizen child (a baby mind you) even if we're not married? \n\nIf anyone has info on a situation like this, please let me know, as all I am seeing is for the child over 21 years old petitioning for immediate relative but the child here is a baby so that's not it. Thanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },
 
   

    {
        "id": "n5aoes",
        "title": "K1 Interview papers - Proof of Peticionary's citizenship thru CRBA",
        "score": 2,
        "num_comments": 6,
        "author": "ipsybitsycat",
        "created_utc": 1620201782.0,
        "created_readable_utc": "2021-05-05 08:03:02 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/n5aoes/k1_interview_papers_proof_of_peticionarys/",
        "permalink": "https://reddit.com/r/USCIS/comments/n5aoes/k1_interview_papers_proof_of_peticionarys/",
        "selftext": "A little help here, when we sent the first package for the K1 (I-129F, etc) my fiancé sent a copy of his US passport ans his CRBA as proof of citizenship.\n\nWill this be enough to bring to the interview? A copy of both the CRBA and passport or do I have to bring an original of the CRBA?\n\nHis birth certificate is not needed, right? As he was not born in US (He doesn't even now where that one is). \n\nThank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-129F (K1)"
    },
 

   
    {
        "id": "hv2tpw",
        "title": "HELP!!!",
        "score": 1,
        "num_comments": 3,
        "author": "reinaayala",
        "created_utc": 1595315166.0,
        "created_readable_utc": "2020-07-21 07:06:06 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/hv2tpw/help/",
        "permalink": "https://reddit.com/r/USCIS/comments/hv2tpw/help/",
        "selftext": "Anyone know if you can still get a CRBA (child repost of birth abroad) in Mexico right now during Covid-19. Or how to go about it ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.66,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Petitions/Applications"
    },

    {
        "id": "azmno1",
        "title": "Question regarding I 130, proving citizenship",
        "score": 2,
        "num_comments": 3,
        "author": "cearth6",
        "created_utc": 1552264459.0,
        "created_readable_utc": "2019-03-11 00:34:19 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/azmno1/question_regarding_i_130_proving_citizenship/",
        "permalink": "https://reddit.com/r/USCIS/comments/azmno1/question_regarding_i_130_proving_citizenship/",
        "selftext": "Hello!\n\nI am in the process of filling out I 130 for my wife but I have a question regarding proving citizenship. I am the petitioner and I was born outside the states but I became naturalized before I turned 18 due to my parents. Meaning I did not give a citizenship exam and therefore was not issued a naturalization certificate, however I do have a valid US Passport. I am wondering if submitting just a copy of my passport is sufficient. \n\n&#x200B;\n\nThe I-130 guidelines state the following:\n\n    What documents do you need to show that you are a U.S. citizen?\n     \n    A. A copy of your birth certificate, issued by a civil registrar, vital statistics office, or other civil authority showing that you were born in the United States; \n    \n    B. A copy of your naturalization certificate or certificate of citizenship issued by USCIS or the former Immigration and Naturalization Service (INS); \n    \n    C. A copy of Form FS-240, Consular Report of Birth Abroad (CRBA), issued by a U.S. Embassy or U.S. Consulate; \n    \n    D. A copy of your unexpired U.S. passport; or \n    \n    E. An original statement from a U.S. consular officer verifying that you are a U.S. citizen with a valid passport. \n\n&#x200B;",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "8nalo6",
        "title": "CRBA proof of physical presence in the US.",
        "score": 1,
        "num_comments": 2,
        "author": "lobstora",
        "created_utc": 1527702305.0,
        "created_readable_utc": "2018-05-30 17:45:05 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/8nalo6/crba_proof_of_physical_presence_in_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/8nalo6/crba_proof_of_physical_presence_in_the_us/",
        "selftext": "Hi everyone! I need your help please :D Let me tell you about our situation:\n\nI am Mexican and my boyfriend of many years is a US Citizen by birth. He, however, has lived in Mexico with relatives for most of his life after his parents divorced. We had a baby a few months ago and are looking to register him at the US Embassy in order to obtain his CRBA and then his US passport. We have 99% of the documentation they ask, except for what I think is most important: proof of my husband's physical presence in the US.\n\nHe did go back to the US when he was older and worked there for some years. Sadly, all of his paperwork (tax returns, W2s etc) was lost when his father passed away. \n\nIs there any way we could obtain copies of such documents? Could we maybe get a Social Security Statement? What do you suggest we do in this case, in your experience? Preferably whatever is easier and quicker, since we already took a long time to register baby in Mexico because of the apostille needed on husband's birth certificate.\n\nI hope I have explained the situation clearly; if you need further info just hit me up here.\n\nThanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    }
]