[
    {
        "id": "1jwnmut",
        "title": "Wife is 8 weeks pregnant. How soon do we file for CRBA? (Mexico)",
        "score": 0,
        "num_comments": 2,
        "author": "8647742135",
        "created_utc": 1744371193.0,
        "created_readable_utc": "2025-04-11 11:33:13 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jwnmut/wife_is_8_weeks_pregnant_how_soon_do_we_file_for/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jwnmut/wife_is_8_weeks_pregnant_how_soon_do_we_file_for/",
        "selftext": "FS-240 right? We are in Tijuana ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support",
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": "Tijuana"
        },
        "sex": "Hombre",
        "document": "CRBA / FS-240"
    },
    {
        "id": "1i2ihqs",
        "title": "How to get U.S passport through born citizen parent?",
        "score": 0,
        "num_comments": 12,
        "author": "Rezlyyy",
        "created_utc": 1737007545.0,
        "created_readable_utc": "2025-01-16 06:05:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "selftext": "Brief summary, I am almost 24, I was born in Mexico in 2001, to a born U.S citizen father and a Mexican mother who were not married at the time, married couple years later, and I did NOT get a Consular Report of Birth Abroad (CRBA).\n\nMy dad was born in the U.S but stayed in Mexico until he was about 25 ish, then they married and he got my mom and I green cards and we moved to the U.S, I was 7 at the time. I’ve been living here ever since. \n\nThey ended up separating when I was around 12, but did NOT divorce, they are still technically married.\n\nSome immigration services recommend naturalization, some people I’ve talked to recommend getting a passport as I should have the right to get citizenship through my dad. \n\nWhat documents would I need to get a U.S passport through my dad? \n\n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "US Passport / CRBA"
    },
    {
        "id": "1ggyzvn",
        "title": "CRBA",
        "score": 1,
        "num_comments": 3,
        "author": "DoctorSin17",
        "created_utc": 1730441495.0,
        "created_readable_utc": "2024-11-01 06:11:35 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ggyzvn/crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ggyzvn/crba/",
        "selftext": "U.S. Consulate General\n\nTijuana, Mexico\n\nAmerican Citizen Services Unit\n\n10 de septiembre de 2024\n\n \n\nSirva este conducto para dar respuesta a la solicitud presentada por usted ante estas oficinas, para determinar si su hija, nacida el 17 de agosto de 2023 en Tijuana, Baja California, México califica para la transmisión de ciudadanía estadounidense para menores de edad.\n\n\n\nDesafortunadamente, después de haber analizado la información presentada, nuestra oficina ha determinado que usted como padre no cumple con los requisitos de presencia física en los Estados Unidos, antes del nacimiento de su hija para poder derivarle la ciudadanía estadounidense.\n\n\n\nSi desea tramitar una visa de inmigrante puede consultar la página web del Servicio de Ciudadanía e Inmigración de los Estados Unidos (uscis.gov) y presentar copia de esta carta. \n\n \n\n \n\nCordialmente, \n\n \n\nOficial Consular \n\n\n\nI have w2 forms for the last 8 years before that i lived in mexico, my daughter born in TJ was rejected for the CRBA is there any other options besides the VISA that i can do?\n\nI appreciate the help ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Tijuana"
        },
        "sex": "Hombre",
        "document": "CRBA / proof of physical presence"
    },
    {
        "id": "1g2ugzq",
        "title": "Non-biological US citizen father; alien mother",
        "score": 3,
        "num_comments": 9,
        "author": "zephen_just_zephen",
        "created_utc": 1728839330.0,
        "created_readable_utc": "2024-10-13 17:08:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1g2ugzq/nonbiological_us_citizen_father_alien_mother/",
        "permalink": "https://reddit.com/r/USCIS/comments/1g2ugzq/nonbiological_us_citizen_father_alien_mother/",
        "selftext": "My girlfriend is a Mexican national.  At the time of birth of her 10 year old son, she was married to a US citizen and living in Mexico.  The child was born via IVF from donor sperm.\n\nAccording to several things I read, the child acquired US citizenship at birth.  For example, [this](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-2) states:\n\n> To be considered a child of a U.S. citizen father, the child must be: ...  The child of a U.S. citizen father who is married to the child’s genetic or gestational parent at the time of the child’s birth (even if no genetic or gestational relationship exists with the U.S. citizen father) if both parents are recognized by the relevant jurisdiction as the child’s legal parents ...\n\nBut all the instructions for all the forms I have seen (e.g. N-600, CRBA, etc.) seem to require that the father be the biological father of the child.\n\n1) What is up with this?\n\n2) Assuming we can get past this, it seems a CRBA (if possible) would be much cheaper and quicker than a N-600.  We live in Texas but could easily travel to Mexico.  Is that allowed for the CRBA?\n\nTIA",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "CRBA / N-600"
    },
    {
        "id": "1ey6fpe",
        "title": "N-400 possible denial",
        "score": 2,
        "num_comments": 5,
        "author": "Rezlyyy",
        "created_utc": 1724288644.0,
        "created_readable_utc": "2024-08-22 01:04:04 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ey6fpe/n400_possible_denial/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ey6fpe/n400_possible_denial/",
        "selftext": "I submitted an N-400 through an immigration lawyer but in the form it says “if you have a US citizen parent you may already be a US citizen and should file an N-600”. \n\nIm looking for some help if I actually qualify for US citizenship from my father and if so, how should I go about it to obtain it, so ill try to give a whole explanation of my situation.\n\nIm 23 years old born on January 27th, 2001, I was born in Piedras Negras, Coahuila, in Mexico, my dad is born in Del Rio, Texas and my mom was born also in Piedras Negras.\n\nThey were not married in the US at the time of my birth and I was not issued a CRBA, instead my mom and I got green cards in 2008 after they married in the US in 2005. We lived in Mexico up until 2008.\n\nI’ll give a bit of background of my family history in the US:\n\nMy dad (43 years old) is a US citizen by birth, born in Del Rio, lived in Mexico until he was about 27 years old, moved in 2007 and worked for one year in San Antonio ,then we moved in with him after getting us green cards in 2008 (I was 7). He worked and lived with us in San Antonio for 5 more years, then my parents separated BUT NOT DIVORCED. My mom went back to Mexico, I went to live with my aunt in Eagle Pass whom I still stay with to this day, but he stayed in the US to work for 3-4 more years to provide before moving back to Mexico. So he was working a total of about 10 years in the US. I’m not sure if I was a beneficiary of anything or if there is anything written that he provided financial support to me until I was 18, he is on my birth certificate and we did live together and did provide for me until I was 18.\n\nIs this enough to get denied naturalization due to being able to get citizenship through my father? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-400 (Citizenship)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Piedras Negras"
        },
        "sex": null,
        "document": "N-400 / N-600 / CRBA"
    },
    {
        "id": "1edmyug",
        "title": "Proving physical present for Consular Report of Birth Abroad (CRBA) without transcripts",
        "score": 3,
        "num_comments": 17,
        "author": "LuthienDragon",
        "created_utc": 1722104648.0,
        "created_readable_utc": "2024-07-27 18:24:08 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1edmyug/proving_physical_present_for_consular_report_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/1edmyug/proving_physical_present_for_consular_report_of/",
        "selftext": "I will be having a baby soon, I am an American Citizen. We are at a crossroads currently, we need to make a choice of me going completely alone to the USA to give birth to guarantee citizenship or staying abroad with family, to later try to prove physical presence.\n\nI have some documents of me being raised there for the first three years of my life (mostly photos) and some pediatrician records plus vaccines. My parents were able to find some bills, obviously on their names as I was a baby.  \n  \nLater in my life, around my 20's, I lived in the USA for 3 years and some months but the only thing consistent in my name is my car registry (imported the car from Mexico which had always been on my name and continued to be on my name until I sold it in the USA, insurance payments, plus CarFax records). I lived with my parents, so all the bills are on their names.   \n  \nI have some W-2's, but I was never able to find full-time job, so it's usually on average three days a week payments or 39 hours a week. I do have passport stamps that record me staying in for long periods of time.\n\nI never went to the Doctor although I was assigned a PCP and everything, but I was terrified of going bankrupt in the American system, so I just drove down to Mexico and went for healthcare there when needed. So, no medical records.\n\nSo, in Summary I have:\n\n* Baby photos, medical pediatrician records and some bills on my parent's names (worth 3 years).\n* Bank Statements, with my name and address.\n* Car Registries and Insurance Payments with address.\n* Bills on my parent's names for water, electric and internet bills.\n* W-2's with part-time employment (three years).\n* Pet Records (vaccines, pet tax, etc).\n* Passport Stamps. I have all my passports, even when I was a baby, so this includes those stamps.\n* Four years of Tax Returns in which I paid taxes because I was living there at the time.\n* Realistically, I have around 5, maybe 6 years of proof.\n\n  \nWould that be enough? Are photos actually admissible (especially for toddlerhood?).   \nWhat uncommon documents do the accept? TIA!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Mujer",
        "document": "CRBA / proof of physical presence"
    },
    {
        "id": "1e6n74h",
        "title": "I do I know if my soon is elegible for CRBA?",
        "score": 1,
        "num_comments": 3,
        "author": "reddittrocks-",
        "created_utc": 1721339350.0,
        "created_readable_utc": "2024-07-18 21:49:10 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e6n74h/i_do_i_know_if_my_soon_is_elegible_for_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e6n74h/i_do_i_know_if_my_soon_is_elegible_for_crba/",
        "selftext": "Hi there, I been trying to find relief based on someone else experience doing a CRBA. \nLong story short, my son was born in Mexico. \nI was born in Houston Texas, I don’t have my physical presence proof before 14, just an old vaccine records, after 14 I have some evidence of physical presence, school transcripts from college and university ( 5 straight years ), and also have some tax records from the DMV from my last vehicule. While I was in college I never had utility bills or rent bills on my name, I shared rent with other students, so no records of that. I also have a report of net earnings from the SSA. I wasn’t able to get a full report of social security statement. Do you guys think that’s enough? \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "CRBA / proof of physical presence"
    },
    {
        "id": "1dkozzf",
        "title": "CRBA Question (Sorry if wrong tag!)",
        "score": 1,
        "num_comments": 1,
        "author": "ThatMexicanyouknow",
        "created_utc": 1718924189.0,
        "created_readable_utc": "2024-06-20 22:56:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dkozzf/crba_question_sorry_if_wrong_tag/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dkozzf/crba_question_sorry_if_wrong_tag/",
        "selftext": "Hello!  \nI am currently trying to fill out a I-130 Petition for my Father. He has never lived in the US and I was born in Mexico to him and my American mother. She got me a Certificate of Birth Abroad (CRBA) immediately after I was born. In the form it asks me if I have a Certificate of Citizenship or a Certificate of Naturalization, I have neither and am confused as to what to enter here because currently my information makes it look like I shouldn't have citizenship since I state I was born in Mexico. To clarify the situation a bit more, parents got divorced long ago which is why my mom is not the one doing this process, and I have double checked that I have no certificate of citizenship, all I have is a CRBA, what should I do?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "I-130 / CRBA"
    },
    {
        "id": "1cui0kf",
        "title": "Just submitted today! We are both DEAF, I hope it won’t be an obstacle!",
        "score": 8,
        "num_comments": 6,
        "author": "Wizardscientist7",
        "created_utc": 1715984504.0,
        "created_readable_utc": "2024-05-17 22:21:44 UTC",
        "url": "https://i.redd.it/a6p4ot1ya21d1.jpeg",
        "permalink": "https://reddit.com/r/USCIS/comments/1cui0kf/just_submitted_today_we_are_both_deaf_i_hope_it/",
        "selftext": "I am 26M us citizen, sponsoring 29F Mexican citizen, to move to USA. We also have a baby born here in Mexico… I have already obtained CRBA birth certificate for our son… and had uploaded it to USCIS, to prove that we are legitimately married. \n\nI hope everything I am doing is right. I submitted I-130 with i-130a. Paid $625.\n\nWhat next? We wait…? And we apply for I-485 to change her status to green card right?\n\nWe are not able to use telephones, we are deaf… hopefully this won’t be a problem. \n\nI would appreciate any kind of input, tips, feedback, and all that.  \n\nMuch thanks ",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "I-130 / CRBA"
    },
    {
        "id": "1bit2eh",
        "title": "Do I need a itin if my wife is going to apply for a green card ",
        "score": 1,
        "num_comments": 3,
        "author": "Kenoughttt",
        "created_utc": 1710876945.0,
        "created_readable_utc": "2024-03-19 19:35:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1bit2eh/do_i_need_a_itin_if_my_wife_is_going_to_apply_for/",
        "permalink": "https://reddit.com/r/USCIS/comments/1bit2eh/do_i_need_a_itin_if_my_wife_is_going_to_apply_for/",
        "selftext": "Here’s my situation. I got married last year and I want file my tax return. We have a baby whom already is an American. He has his CRBA, SS & passport. This year we are going to apply for my wife’s green card. For my tax return, I need to put her on there, it’s required to have a ss or a itin? Is this true? Also what do I do I can’t leave it blank. Please help I was planning on putting head of household. She doesn’t work and is taking care of our baby in Mexico.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Social Security Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "Tax Return / ITIN / Green Card"
    },
    {
        "id": "13qmnu8",
        "title": "Form I-130 or CRBA?",
        "score": 2,
        "num_comments": 2,
        "author": "Aromatic-Golf6237",
        "created_utc": 1684937029.0,
        "created_readable_utc": "2023-05-24 14:03:49 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/13qmnu8/form_i130_or_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/13qmnu8/form_i130_or_crba/",
        "selftext": "Hello all! I would really appreciate any advice on a matter!! My brother recently got married this past year and wants to file a I-130 for his wife (lives in foreign country) & his child with his wife.\n\nHis kid was born out of wedlock & abroad to a US Citizen (him) and non-US mother (Mexican national). We are wondering whether he should file a Form I-130 or do a consular birth (CRBA)? Has anyone been in a similar situation?? \n\nWe have an appointment with a lawyer in a few weeks but they are very impatient…",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "I-130 / CRBA"
    },
    {
        "id": "zqewlb",
        "title": "CRBA and passport",
        "score": 1,
        "num_comments": 2,
        "author": "Some-Ad530",
        "created_utc": 1671512152.0,
        "created_readable_utc": "2022-12-20 04:55:52 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/zqewlb/crba_and_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/zqewlb/crba_and_passport/",
        "selftext": "So I’m an American citizen and my son was born in Mexico.  I’m trying to fill out the DS-11 so I can get my son’s passport the same time I get the CRBA, but it does not give me an option to select city/state in Mexico where he is born (only cities/states in the US). Our appointment is scheduled for January 3rd in Mexico City.  Can someone please provide some guidance?  Thank you so much in advance",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City"
        },
        "sex": "Hombre",
        "document": "DS-11 / Passport / CRBA"
    },
    {
        "id": "z245uq",
        "title": "CRBA or N600k",
        "score": 2,
        "num_comments": 2,
        "author": "DeliciousSky2323",
        "created_utc": 1669149200.0,
        "created_readable_utc": "2022-11-22 20:33:20 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/z245uq/crba_or_n600k/",
        "permalink": "https://reddit.com/r/USCIS/comments/z245uq/crba_or_n600k/",
        "selftext": "My brother is a USC (Born in the USA) But never lived in the United States before his children were born (AND he still lives in Mexico with his family). I wanted to know if he needs to do a CRBA in the Mexican consulate (but because he can't meet his physical presence requirements, can he use our father's physical presence?) OR if his only option is to file a N600K, again using the Childrens' grandfather physical presence?  thank you in advance",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "CRBA / N-600K / proof of physical presence"
    },
    {
        "id": "yfhnw4",
        "title": "I need advice to bring my gf to the U.S",
        "score": 1,
        "num_comments": 11,
        "author": "peakmejoe",
        "created_utc": 1666942805.0,
        "created_readable_utc": "2022-10-28 07:40:05 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/yfhnw4/i_need_advice_to_bring_my_gf_to_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/yfhnw4/i_need_advice_to_bring_my_gf_to_the_us/",
        "selftext": "I (21m) have been dating this beautiful girl (20f) for almost 3 years. She lives in Mexico, never had a visa. We have a baby and I got him the Crba (I'm a U.S Citizen) and it was a 3 month process and I couldnt be more thankful. But I want to know if us having a child would affect her getting a visa or any advice of what should we do?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "Visa / CRBA"
    },
    {
        "id": "wrzqox",
        "title": "CRBA application still under processing after passport was issued for the baby",
        "score": 2,
        "num_comments": 9,
        "author": "Subject_Ad_927",
        "created_utc": 1660869547.0,
        "created_readable_utc": "2022-08-19 00:39:07 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
        "permalink": "https://reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
        "selftext": "I am a U.S citizen by Naturalization and my wife is not. My wife gave birth to our second child in May 2022 in Mexico as we are still waiting for her I-130 approval(my wife). I filed out the application for CRBA online and choosed Mexico city as interview location, made the payment online. Few days later I received an email from U.S Embassy in Mexico city with interview appointment date scheduled in August(application was filled  in May), I tried to get earlier appointment but they told me that there is no earlier appointment that I can try to see if other consulate have opening , I checked the online system and we were lucky to find May 26 appointment at the U.S consulate in Merida.Scheduled another interview and asked Merida to request that Mexico city transferred our online application to Merida, they did and we went for the interview with all documents, officer at the interview told us that everything was fine and we request for an emergency passport for our daughter, the U.S passport was issued the same day, officer told us that our approved documents will be transferred to Mexico city for them to issue the CRBA since the online payment was made to them. In July I received email from U.S embassy in Mexico city asking for more proof of presence in the U.S, I sent 6 years of my credit card bills and also my bank statement as requested, few days later they contacted me and ask for more proof like travel history, I sent them record from the CBP with travel record from 2011-2021 (that was what FOIA/CBP sent me) Yesterday I received a call from them again that the assistant consul still need more documents but they did not say which documents. My question is, is this normal? My daughter already have a U.S emergency passport issued by the U.S consulate in Merida Mexico and valid for 1year, can the officer at the U.S embassy in Mexico city denied my daughter's CRBA application even though she already have a U.S passport? I got my citizenship last year and I travel on business trips from time to time but maintain physical presence in the U.S.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City / Merida"
        },
        "sex": "Hombre",
        "document": "CRBA / proof of physical presence / Passport"
    },
    {
        "id": "uut756",
        "title": "Consular Record of Birth Abroad and Passport",
        "score": 3,
        "num_comments": 2,
        "author": "Snoo-94705",
        "created_utc": 1653158324.0,
        "created_readable_utc": "2022-05-21 18:38:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
        "selftext": "I've been trying to schedule an appointment for a CRBA and passport for my daughter for months now.\n\nEvery time that I go the appointment scheduling [link](https://evisaforms.state.gov/Instructions/ACSSchedulingSystem.asp) for the U.S. Consulate General in Tijuana, Mexico, there are no available slots.\n\nBecause of this, I have not been able to bring her into the U.S. since her birth more than seven months ago.  I am having to constantly travel between Chicago and Tijuana to be able to see my daughter.\n\nI have all documentation ready and on hand and I would like to see if I can get the process started as soon as possible.  Any ideas?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Tijuana"
        },
        "sex": "Hombre",
        "document": "CRBA / Passport Appointment"
    },
    {
        "id": "t72c9z",
        "title": "Has anyone done a CRBA in Mexico, US Consulate?",
        "score": 1,
        "num_comments": 0,
        "author": "Snoo_69177",
        "created_utc": 1646457774.0,
        "created_readable_utc": "2022-03-05 05:22:54 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/t72c9z/has_anyone_done_a_crba_in_mexico_us_consulate/",
        "permalink": "https://reddit.com/r/USCIS/comments/t72c9z/has_anyone_done_a_crba_in_mexico_us_consulate/",
        "selftext": "I’ve been waiting about 15 weeks for my sons passport. I received his CRBA with in just a couple weeks. I reached out to the consulate in TJ on the matter but to not avail they never return my emails. They also have you pay for DHL postage for them to mail your items to you, and now the DHL tracking #s come back as unknown due to them not being used in a reasonable time. \n\nDoes anyone know if this is normal? I’m hoping once my fiancées i129f is approved we can cross with just his CRBA and I register for him a passport from over here. It’s been a nightmare because I can’t get him a social security without a photo I.D. , Waiting 15 weeks for the consulate to send a passport seems like somethings wrong. I’ve been seeing other countries with a U.S. consulate are sending passports within 3 weeks.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Tijuana"
        },
        "sex": "Hombre",
        "document": "Passport / CRBA"
    },
    {
        "id": "sxxqnn",
        "title": "Can we travel back into the US with our newborn while we wait for our CRBA appointment?",
        "score": 2,
        "num_comments": 17,
        "author": "doodydoo125",
        "created_utc": 1645461179.0,
        "created_readable_utc": "2022-02-21 16:32:59 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/sxxqnn/can_we_travel_back_into_the_us_with_our_newborn/",
        "permalink": "https://reddit.com/r/USCIS/comments/sxxqnn/can_we_travel_back_into_the_us_with_our_newborn/",
        "selftext": "Wife is from Mexico (US Permanent Resident), I’m a US citizen. I’ve lived in the states my whole life, can easily prove it, etc… If all goes well, the plan is to have the baby in Mexico, have the CRBA appointment, and travel back to the US shortly after. This is in Monterrey, MX.\n\nBut, we’ve heard that there may be delays in getting the CRBA appointment scheduled. For example, when the baby is born and we go to schedule the appointment, the next available appointment may not be for another 3 months.\n\nWhile we wait for our appointment date, are we able to travel (by car) back into the US and wait there? This CBP article says we only need the birth certificate to enter the US by land:\n\nhttps://help.cbp.gov/s/article/Article-3618?language=en_US\n\nHas anyone done this? As far as I’m aware we should be able to do this with no issues, but I want to hear from people that have either actually done it or know someone that has. Unfortunately with work I don’t think I’d be able to say in Mexico for an extended period of time (like 3 months).\n\nAlso, if anyone has recently had a birth in Mexico, and submitted the CRBA for the US, how long did it take you to get the appointment and go through the whole process?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Monterrey"
        },
        "sex": "Hombre",
        "document": "CRBA Appointment / Birth Certificate / Travel"
    },
    {
        "id": "hv2tpw",
        "title": "HELP!!!",
        "score": 1,
        "num_comments": 3,
        "author": "reinaayala",
        "created_utc": 1595315166.0,
        "created_readable_utc": "2020-07-21 07:06:06 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/hv2tpw/help/",
        "permalink": "https://reddit.com/r/USCIS/comments/hv2tpw/help/",
        "selftext": "Anyone know if you can still get a CRBA (child repost of birth abroad) in Mexico right now during Covid-19. Or how to go about it ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.66,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Petitions/Applications",
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "CRBA"
    },
    {
        "id": "8nalo6",
        "title": "CRBA proof of physical presence in the US.",
        "score": 1,
        "num_comments": 2,
        "author": "lobstora",
        "created_utc": 1527702305.0,
        "created_readable_utc": "2018-05-30 17:45:05 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/8nalo6/crba_proof_of_physical_presence_in_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/8nalo6/crba_proof_of_physical_presence_in_the_us/",
        "selftext": "Hi everyone! I need your help please :D Let me tell you about our situation:\n\nI am Mexican and my boyfriend of many years is a US Citizen by birth. He, however, has lived in Mexico with relatives for most of his life after his parents divorced. We had a baby a few months ago and are looking to register him at the US Embassy in order to obtain his CRBA and then his US passport. We have 99% of the documentation they ask, except for what I think is most important: proof of my husband's physical presence in the US.\n\nHe did go back to the US when he was older and worked there for some years. Sadly, all of his paperwork (tax returns, W2s etc) was lost when his father passed away. \n\nIs there any way we could obtain copies of such documents? Could we maybe get a Social Security Statement? What do you suggest we do in this case, in your experience? Preferably whatever is easier and quicker, since we already took a long time to register baby in Mexico because of the apostille needed on husband's birth certificate.\n\nI hope I have explained the situation clearly; if you need further info just hit me up here.\n\nThanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Mujer",
        "document": "CRBA / proof of physical presence"
    },{
        "id": "1jwnmut",
        "title": "Wife is 8 weeks pregnant. How soon do we file for CRBA? (Mexico)",
        "score": 0,
        "num_comments": 2,
        "author": "8647742135",
        "created_utc": 1744371193.0,
        "created_readable_utc": "2025-04-11 11:33:13 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jwnmut/wife_is_8_weeks_pregnant_how_soon_do_we_file_for/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jwnmut/wife_is_8_weeks_pregnant_how_soon_do_we_file_for/",
        "selftext": "FS-240 right? We are in Tijuana ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support",
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": "Tijuana"
        },
        "sex": "Hombre",
        "document": "CRBA / FS-240"
    },
    {
        "id": "1i2ihqs",
        "title": "How to get U.S passport through born citizen parent?",
        "score": 0,
        "num_comments": 12,
        "author": "Rezlyyy",
        "created_utc": 1737007545.0,
        "created_readable_utc": "2025-01-16 06:05:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "selftext": "Brief summary, I am almost 24, I was born in Mexico in 2001, to a born U.S citizen father and a Mexican mother who were not married at the time, married couple years later, and I did NOT get a Consular Report of Birth Abroad (CRBA).\n\nMy dad was born in the U.S but stayed in Mexico until he was about 25 ish, then they married and he got my mom and I green cards and we moved to the U.S, I was 7 at the time. I’ve been living here ever since. \n\nThey ended up separating when I was around 12, but did NOT divorce, they are still technically married.\n\nSome immigration services recommend naturalization, some people I’ve talked to recommend getting a passport as I should have the right to get citizenship through my dad. \n\nWhat documents would I need to get a U.S passport through my dad? \n\n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Piedras Negras"
        },
        "sex": null,
        "document": "US Passport / CRBA"
    },
    {
        "id": "1ggyzvn",
        "title": "CRBA",
        "score": 1,
        "num_comments": 3,
        "author": "DoctorSin17",
        "created_utc": 1730441495.0,
        "created_readable_utc": "2024-11-01 06:11:35 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ggyzvn/crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ggyzvn/crba/",
        "selftext": "U.S. Consulate General\n\nTijuana, Mexico\n\nAmerican Citizen Services Unit\n\n10 de septiembre de 2024\n\n \n\nSirva este conducto para dar respuesta a la solicitud presentada por usted ante estas oficinas, para determinar si su hija, nacida el 17 de agosto de 2023 en Tijuana, Baja California, México califica para la transmisión de ciudadanía estadounidense para menores de edad.\n\n\n\nDesafortunadamente, después de haber analizado la información presentada, nuestra oficina ha determinado que usted como padre no cumple con los requisitos de presencia física en los Estados Unidos, antes del nacimiento de su hija para poder derivarle la ciudadanía estadounidense.\n\n\n\nSi desea tramitar una visa de inmigrante puede consultar la página web del Servicio de Ciudadanía e Inmigración de los Estados Unidos (uscis.gov) y presentar copia de esta carta. \n\n \n\n \n\nCordialmente, \n\n \n\nOficial Consular \n\n\n\nI have w2 forms for the last 8 years before that i lived in mexico, my daughter born in TJ was rejected for the CRBA is there any other options besides the VISA that i can do?\n\nI appreciate the help ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Tijuana"
        },
        "sex": "Hombre",
        "document": "CRBA / proof of physical presence"
    },
    {
        "id": "1g2ugzq",
        "title": "Non-biological US citizen father; alien mother",
        "score": 3,
        "num_comments": 9,
        "author": "zephen_just_zephen",
        "created_utc": 1728839330.0,
        "created_readable_utc": "2024-10-13 17:08:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1g2ugzq/nonbiological_us_citizen_father_alien_mother/",
        "permalink": "https://reddit.com/r/USCIS/comments/1g2ugzq/nonbiological_us_citizen_father_alien_mother/",
        "selftext": "My girlfriend is a Mexican national.  At the time of birth of her 10 year old son, she was married to a US citizen and living in Mexico.  The child was born via IVF from donor sperm.\n\nAccording to several things I read, the child acquired US citizenship at birth.  For example, [this](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-2) states:\n\n> To be considered a child of a U.S. citizen father, the child must be: ...  The child of a U.S. citizen father who is married to the child’s genetic or gestational parent at the time of the child’s birth (even if no genetic or gestational relationship exists with the U.S. citizen father) if both parents are recognized by the relevant jurisdiction as the child’s legal parents ...\n\nBut all the instructions for all the forms I have seen (e.g. N-600, CRBA, etc.) seem to require that the father be the biological father of the child.\n\n1) What is up with this?\n\n2) Assuming we can get past this, it seems a CRBA (if possible) would be much cheaper and quicker than a N-600.  We live in Texas but could easily travel to Mexico.  Is that allowed for the CRBA?\n\nTIA",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "CRBA / N-600"
    },
    {
        "id": "1fmxtx6",
        "title": "CRBA - physical presence documents during early years",
        "score": 1,
        "num_comments": 6,
        "author": "tar182",
        "created_utc": 1727023976.0,
        "created_readable_utc": "2024-09-22 16:52:56 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1fmxtx6/crba_physical_presence_documents_during_early/",
        "permalink": "https://reddit.com/r/USCIS/comments/1fmxtx6/crba_physical_presence_documents_during_early/",
        "selftext": "I am applying for my child's CRBA and I am the only U.S. citizen parent. My concern is that I left the country when I was about three years old and I cannot find supporting documents to confirm my presence in the U.S. during those early years apart from my birth certificate. \n\nDo you think that my application will surely get rejected?\n\nI did return to the U.S. for two years for my master's degree. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family",
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": "CRBA / proof of physical presence"
    },
    {
        "id": "1ey6fpe",
        "title": "N-400 possible denial",
        "score": 2,
        "num_comments": 5,
        "author": "Rezlyyy",
        "created_utc": 1724288644.0,
        "created_readable_utc": "2024-08-22 01:04:04 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ey6fpe/n400_possible_denial/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ey6fpe/n400_possible_denial/",
        "selftext": "I submitted an N-400 through an immigration lawyer but in the form it says “if you have a US citizen parent you may already be a US citizen and should file an N-600”. \n\nIm looking for some help if I actually qualify for US citizenship from my father and if so, how should I go about it to obtain it, so ill try to give a whole explanation of my situation.\n\nIm 23 years old born on January 27th, 2001, I was born in Piedras Negras, Coahuila, in Mexico, my dad is born in Del Rio, Texas and my mom was born also in Piedras Negras.\n\nThey were not married in the US at the time of my birth and I was not issued a CRBA, instead my mom and I got green cards in 2008 after they married in the US in 2005. We lived in Mexico up until 2008.\n\nI’ll give a bit of background of my family history in the US:\n\nMy dad (43 years old) is a US citizen by birth, born in Del Rio, lived in Mexico until he was about 27 years old, moved in 2007 and worked for one year in San Antonio ,then we moved in with him after getting us green cards in 2008 (I was 7). He worked and lived with us in San Antonio for 5 more years, then my parents separated BUT NOT DIVORCED. My mom went back to Mexico, I went to live with my aunt in Eagle Pass whom I still stay with to this day, but he stayed in the US to work for 3-4 more years to provide before moving back to Mexico. So he was working a total of about 10 years in the US. I’m not sure if I was a beneficiary of anything or if there is anything written that he provided financial support to me until I was 18, he is on my birth certificate and we did live together and did provide for me until I was 18.\n\nIs this enough to get denied naturalization due to being able to get citizenship through my father? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-400 (Citizenship)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Piedras Negras"
        },
        "sex": null,
        "document": "N-400 / N-600 / CRBA"
    },
    {
        "id": "1edmyug",
        "title": "Proving physical present for Consular Report of Birth Abroad (CRBA) without transcripts",
        "score": 3,
        "num_comments": 17,
        "author": "LuthienDragon",
        "created_utc": 1722104648.0,
        "created_readable_utc": "2024-07-27 18:24:08 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1edmyug/proving_physical_present_for_consular_report_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/1edmyug/proving_physical_present_for_consular_report_of/",
        "selftext": "I will be having a baby soon, I am an American Citizen. We are at a crossroads currently, we need to make a choice of me going completely alone to the USA to give birth to guarantee citizenship or staying abroad with family, to later try to prove physical presence.\n\nI have some documents of me being raised there for the first three years of my life (mostly photos) and some pediatrician records plus vaccines. My parents were able to find some bills, obviously on their names as I was a baby.  \n  \nLater in my life, around my 20's, I lived in the USA for 3 years and some months but the only thing consistent in my name is my car registry (imported the car from Mexico which had always been on my name and continued to be on my name until I sold it in the USA, insurance payments, plus CarFax records). I lived with my parents, so all the bills are on their names.   \n  \nI have some W-2's, but I was never able to find full-time job, so it's usually on average three days a week payments or 39 hours a week. I do have passport stamps that record me staying in for long periods of time.\n\nI never went to the Doctor although I was assigned a PCP and everything, but I was terrified of going bankrupt in the American system, so I just drove down to Mexico and went for healthcare there when needed. So, no medical records.\n\nSo, in Summary I have:\n\n* Baby photos, medical pediatrician records and some bills on my parent's names (worth 3 years).\n* Bank Statements, with my name and address.\n* Car Registries and Insurance Payments with address.\n* Bills on my parent's names for water, electric and internet bills.\n* W-2's with part-time employment (three years).\n* Pet Records (vaccines, pet tax, etc).\n* Passport Stamps. I have all my passports, even when I was a baby, so this includes those stamps.\n* Four years of Tax Returns in which I paid taxes because I was living there at the time.\n* Realistically, I have around 5, maybe 6 years of proof.\n\n  \nWould that be enough? Are photos actually admissible (especially for toddlerhood?).   \nWhat uncommon documents do the accept? TIA!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "CRBA / proof of physical presence"
    },
    {
        "id": "1e6n74h",
        "title": "I do I know if my soon is elegible for CRBA?",
        "score": 1,
        "num_comments": 3,
        "author": "reddittrocks-",
        "created_utc": 1721339350.0,
        "created_readable_utc": "2024-07-18 21:49:10 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e6n74h/i_do_i_know_if_my_soon_is_elegible_for_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e6n74h/i_do_i_know_if_my_soon_is_elegible_for_crba/",
        "selftext": "Hi there, I been trying to find relief based on someone else experience doing a CRBA. \nLong story short, my son was born in Mexico. \nI was born in Houston Texas, I don’t have my physical presence proof before 14, just an old vaccine records, after 14 I have some evidence of physical presence, school transcripts from college and university ( 5 straight years ), and also have some tax records from the DMV from my last vehicule. While I was in college I never had utility bills or rent bills on my name, I shared rent with other students, so no records of that. I also have a report of net earnings from the SSA. I wasn’t able to get a full report of social security statement. Do you guys think that’s enough? \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "CRBA / proof of physical presence"
    },
    {
        "id": "1dkozzf",
        "title": "CRBA Question (Sorry if wrong tag!)",
        "score": 1,
        "num_comments": 1,
        "author": "ThatMexicanyouknow",
        "created_utc": 1718924189.0,
        "created_readable_utc": "2024-06-20 22:56:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dkozzf/crba_question_sorry_if_wrong_tag/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dkozzf/crba_question_sorry_if_wrong_tag/",
        "selftext": "Hello!  \nI am currently trying to fill out a I-130 Petition for my Father. He has never lived in the US and I was born in Mexico to him and my American mother. She got me a Certificate of Birth Abroad (CRBA) immediately after I was born. In the form it asks me if I have a Certificate of Citizenship or a Certificate of Naturalization, I have neither and am confused as to what to enter here because currently my information makes it look like I shouldn't have citizenship since I state I was born in Mexico. To clarify the situation a bit more, parents got divorced long ago which is why my mom is not the one doing this process, and I have double checked that I have no certificate of citizenship, all I have is a CRBA, what should I do?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "I-130 / CRBA"
    },
    {
        "id": "1cui0kf",
        "title": "Just submitted today! We are both DEAF, I hope it won’t be an obstacle!",
        "score": 8,
        "num_comments": 6,
        "author": "Wizardscientist7",
        "created_utc": 1715984504.0,
        "created_readable_utc": "2024-05-17 22:21:44 UTC",
        "url": "https://i.redd.it/a6p4ot1ya21d1.jpeg",
        "permalink": "https://reddit.com/r/USCIS/comments/1cui0kf/just_submitted_today_we_are_both_deaf_i_hope_it/",
        "selftext": "I am 26M us citizen, sponsoring 29F Mexican citizen, to move to USA. We also have a baby born here in Mexico… I have already obtained CRBA birth certificate for our son… and had uploaded it to USCIS, to prove that we are legitimately married. \n\nI hope everything I am doing is right. I submitted I-130 with i-130a. Paid $625.\n\nWhat next? We wait…? And we apply for I-485 to change her status to green card right?\n\nWe are not able to use telephones, we are deaf… hopefully this won’t be a problem. \n\nI would appreciate any kind of input, tips, feedback, and all that.  \n\nMuch thanks ",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "I-130 / CRBA"
    },
    {
        "id": "1bit2eh",
        "title": "Do I need a itin if my wife is going to apply for a green card ",
        "score": 1,
        "num_comments": 3,
        "author": "Kenoughttt",
        "created_utc": 1710876945.0,
        "created_readable_utc": "2024-03-19 19:35:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1bit2eh/do_i_need_a_itin_if_my_wife_is_going_to_apply_for/",
        "permalink": "https://reddit.com/r/USCIS/comments/1bit2eh/do_i_need_a_itin_if_my_wife_is_going_to_apply_for/",
        "selftext": "Here’s my situation. I got married last year and I want file my tax return. We have a baby whom already is an American. He has his CRBA, SS & passport. This year we are going to apply for my wife’s green card. For my tax return, I need to put her on there, it’s required to have a ss or a itin? Is this true? Also what do I do I can’t leave it blank. Please help I was planning on putting head of household. She doesn’t work and is taking care of our baby in Mexico.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Social Security Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "ITIN / Tax Return / CRBA"
    },
    {
        "id": "13qmnu8",
        "title": "Form I-130 or CRBA?",
        "score": 2,
        "num_comments": 2,
        "author": "Aromatic-Golf6237",
        "created_utc": 1684937029.0,
        "created_readable_utc": "2023-05-24 14:03:49 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/13qmnu8/form_i130_or_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/13qmnu8/form_i130_or_crba/",
        "selftext": "Hello all! I would really appreciate any advice on a matter!! My brother recently got married this past year and wants to file a I-130 for his wife (lives in foreign country) & his child with his wife.\n\nHis kid was born out of wedlock & abroad to a US Citizen (him) and non-US mother (Mexican national). We are wondering whether he should file a Form I-130 or do a consular birth (CRBA)? Has anyone been in a similar situation?? \n\nWe have an appointment with a lawyer in a few weeks but they are very impatient…",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "I-130 / CRBA"
    },
    {
        "id": "zqewlb",
        "title": "CRBA and passport",
        "score": 1,
        "num_comments": 2,
        "author": "Some-Ad530",
        "created_utc": 1671512152.0,
        "created_readable_utc": "2022-12-20 04:55:52 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/zqewlb/crba_and_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/zqewlb/crba_and_passport/",
        "selftext": "So I’m an American citizen and my son was born in Mexico.  I’m trying to fill out the DS-11 so I can get my son’s passport the same time I get the CRBA, but it does not give me an option to select city/state in Mexico where he is born (only cities/states in the US). Our appointment is scheduled for January 3rd in Mexico City.  Can someone please provide some guidance?  Thank you so much in advance",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City"
        },
        "sex": null,
        "document": "CRBA / passport / DS-11"
    },
    {
        "id": "z245uq",
        "title": "CRBA or N600k",
        "score": 2,
        "num_comments": 2,
        "author": "DeliciousSky2323",
        "created_utc": 1669149200.0,
        "created_readable_utc": "2022-11-22 20:33:20 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/z245uq/crba_or_n600k/",
        "permalink": "https://reddit.com/r/USCIS/comments/z245uq/crba_or_n600k/",
        "selftext": "My brother is a USC (Born in the USA) But never lived in the United States before his children were born (AND he still lives in Mexico with his family). I wanted to know if he needs to do a CRBA in the Mexican consulate (but because he can't meet his physical presence requirements, can he use our father's physical presence?) OR if his only option is to file a N600K, again using the Childrens' grandfather physical presence?  thank you in advance",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "CRBA / N-600K"
    },
    {
        "id": "yfhnw4",
        "title": "I need advice to bring my gf to the U.S",
        "score": 1,
        "num_comments": 11,
        "author": "peakmejoe",
        "created_utc": 1666942805.0,
        "created_readable_utc": "2022-10-28 07:40:05 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/yfhnw4/i_need_advice_to_bring_my_gf_to_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/yfhnw4/i_need_advice_to_bring_my_gf_to_the_us/",
        "selftext": "I (21m) have been dating this beautiful girl (20f) for almost 3 years. She lives in Mexico, never had a visa. We have a baby and I got him the Crba (I'm a U.S Citizen) and it was a 3 month process and I couldnt be more thankful. But I want to know if us having a child would affect her getting a visa or any advice of what should we do?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "CRBA / Visa"
    },
    {
        "id": "wrzqox",
        "title": "CRBA application still under processing after passport was issued for the baby",
        "score": 2,
        "num_comments": 9,
        "author": "Subject_Ad_927",
        "created_utc": 1660869547.0,
        "created_readable_utc": "2022-08-19 00:39:07 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
        "permalink": "https://reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
        "selftext": "I am a U.S citizen by Naturalization and my wife is not. My wife gave birth to our second child in May 2022 in Mexico as we are still waiting for her I-130 approval(my wife). I filed out the application for CRBA online and choosed Mexico city as interview location, made the payment online. Few days later I received an email from U.S Embassy in Mexico city with interview appointment date scheduled in August(application was filled  in May), I tried to get earlier appointment but they told me that there is no earlier appointment that I can try to see if other consulate have opening , I checked the online system and we were lucky to find May 26 appointment at the U.S consulate in Merida.Scheduled another interview and asked Merida to request that Mexico city transferred our online application to Merida, they did and we went for the interview with all documents, officer at the interview told us that everything was fine and we request for an emergency passport for our daughter, the U.S passport was issued the same day, officer told us that our approved documents will be transferred to Mexico city for them to issue the CRBA since the online payment was made to them. In July I received email from U.S embassy in Mexico city asking for more proof of presence in the U.S, I sent 6 years of my credit card bills and also my bank statement as requested, few days later they contacted me and ask for more proof like travel history, I sent them record from the CBP with travel record from 2011-2021 (that was what FOIA/CBP sent me) Yesterday I received a call from them again that the assistant consul still need more documents but they did not say which documents. My question is, is this normal? My daughter already have a U.S emergency passport issued by the U.S consulate in Merida Mexico and valid for 1year, can the officer at the U.S embassy in Mexico city denied my daughter's CRBA application even though she already have a U.S passport? I got my citizenship last year and I travel on business trips from time to time but maintain physical presence in the U.S.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City / Merida"
        },
        "sex": "Hombre",
        "document": "CRBA / passport / proof of physical presence"
    },
    {
        "id": "uut756",
        "title": "Consular Record of Birth Abroad and Passport",
        "score": 3,
        "num_comments": 2,
        "author": "Snoo-94705",
        "created_utc": 1653158324.0,
        "created_readable_utc": "2022-05-21 18:38:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
        "selftext": "I've been trying to schedule an appointment for a CRBA and passport for my daughter for months now.\n\nEvery time that I go the appointment scheduling [link](https://evisaforms.state.gov/Instructions/ACSSchedulingSystem.asp) for the U.S. Consulate General in Tijuana, Mexico, there are no available slots.\n\nBecause of this, I have not been able to bring her into the U.S. since her birth more than seven months ago.  I am having to constantly travel between Chicago and Tijuana to be able to see my daughter.\n\nI have all documentation ready and on hand and I would like to see if I can get the process started as soon as possible.  Any ideas?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Tijuana"
        },
        "sex": null,
        "document": "CRBA / passport"
    },
    {
        "id": "t72c9z",
        "title": "Has anyone done a CRBA in Mexico, US Consulate?",
        "score": 1,
        "num_comments": 0,
        "author": "Snoo_69177",
        "created_utc": 1646457774.0,
        "created_readable_utc": "2022-03-05 05:22:54 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/t72c9z/has_anyone_done_a_crba_in_mexico_us_consulate/",
        "permalink": "https://reddit.com/r/USCIS/comments/t72c9z/has_anyone_done_a_crba_in_mexico_us_consulate/",
        "selftext": "I’ve been waiting about 15 weeks for my sons passport. I received his CRBA with in just a couple weeks. I reached out to the consulate in TJ on the matter but to not avail they never return my emails. They also have you pay for DHL postage for them to mail your items to you, and now the DHL tracking #s come back as unknown due to them not being used in a reasonable time. \n\nDoes anyone know if this is normal? I’m hoping once my fiancées i129f is approved we can cross with just his CRBA and I register for him a passport from over here. It’s been a nightmare because I can’t get him a social security without a photo I.D. , Waiting 15 weeks for the consulate to send a passport seems like somethings wrong. I’ve been seeing other countries with a U.S. consulate are sending passports within 3 weeks.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Tijuana"
        },
        "sex": null,
        "document": "CRBA / passport"
    },
    {
        "id": "sxxqnn",
        "title": "Can we travel back into the US with our newborn while we wait for our CRBA appointment?",
        "score": 2,
        "num_comments": 17,
        "author": "doodydoo125",
        "created_utc": 1645461179.0,
        "created_readable_utc": "2022-02-21 16:32:59 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/sxxqnn/can_we_travel_back_into_the_us_with_our_newborn/",
        "permalink": "https://reddit.com/r/USCIS/comments/sxxqnn/can_we_travel_back_into_the_us_with_our_newborn/",
        "selftext": "Wife is from Mexico (US Permanent Resident), I’m a US citizen. I’ve lived in the states my whole life, can easily prove it, etc… If all goes well, the plan is to have the baby in Mexico, have the CRBA appointment, and travel back to the US shortly after. This is in Monterrey, MX.\n\nBut, we’ve heard that there may be delays in getting the CRBA appointment scheduled. For example, when the baby is born and we go to schedule the appointment, the next available appointment may not be for another 3 months.\n\nWhile we wait for our appointment date, are we able to travel (by car) back into the US and wait there? This CBP article says we only need the birth certificate to enter the US by land:\n\nhttps://help.cbp.gov/s/article/Article-3618?language=en_US\n\nHas anyone done this? As far as I’m aware we should be able to do this with no issues, but I want to hear from people that have either actually done it or know someone that has. Unfortunately with work I don’t think I’d be able to say in Mexico for an extended period of time (like 3 months).\n\nAlso, if anyone has recently had a birth in Mexico, and submitted the CRBA for the US, how long did it take you to get the appointment and go through the whole process?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Monterrey"
        },
        "sex": "Hombre",
        "document": "CRBA / birth certificate"
    },
    {
        "id": "hv2tpw",
        "title": "HELP!!!",
        "score": 1,
        "num_comments": 3,
        "author": "reinaayala",
        "created_utc": 1595315166.0,
        "created_readable_utc": "2020-07-21 07:06:06 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/hv2tpw/help/",
        "permalink": "https://reddit.com/r/USCIS/comments/hv2tpw/help/",
        "selftext": "Anyone know if you can still get a CRBA (child repost of birth abroad) in Mexico right now during Covid-19. Or how to go about it ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.66,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Petitions/Applications",
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "CRBA"
    },
    {
        "id": "8nalo6",
        "title": "CRBA proof of physical presence in the US.",
        "score": 1,
        "num_comments": 2,
        "author": "lobstora",
        "created_utc": 1527702305.0,
        "created_readable_utc": "2018-05-30 17:45:05 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/8nalo6/crba_proof_of_physical_presence_in_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/8nalo6/crba_proof_of_physical_presence_in_the_us/",
        "selftext": "Hi everyone! I need your help please :D Let me tell you about our situation:\n\nI am Mexican and my boyfriend of many years is a US Citizen by birth. He, however, has lived in Mexico with relatives for most of his life after his parents divorced. We had a baby a few months ago and are looking to register him at the US Embassy in order to obtain his CRBA and then his US passport. We have 99% of the documentation they ask, except for what I think is most important: proof of my husband's physical presence in the US.\n\nHe did go back to the US when he was older and worked there for some years. Sadly, all of his paperwork (tax returns, W2s etc) was lost when his father passed away. \n\nIs there any way we could obtain copies of such documents? Could we maybe get a Social Security Statement? What do you suggest we do in this case, in your experience? Preferably whatever is easier and quicker, since we already took a long time to register baby in Mexico because of the apostille needed on husband's birth certificate.\n\nI hope I have explained the situation clearly; if you need further info just hit me up here.\n\nThanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Mujer",
        "document": "CRBA / proof of physical presence"
    }, {
        "id": "z4aa6c",
        "title": "More Consular Report of Birth Abroad (CRBA) stuff: What constitutes a \"true copy\" of the hospital birth certificate?",
        "score": 5,
        "num_comments": 6,
        "author": "JJVMT",
        "created_utc": 1669372697.0,
        "created_readable_utc": "2022-11-25 10:38:17 UTC",
        "url": "https://www.reddit.com/r/expats/comments/z4aa6c/more_consular_report_of_birth_abroad_crba_stuff/",
        "permalink": "https://reddit.com/r/expats/comments/z4aa6c/more_consular_report_of_birth_abroad_crba_stuff/",
        "selftext": "Hey everyone! The U.S. Embassy and Consulates in Mexico website provides the following as one of the requirements for requesting a CRBA, in both English in Spanish:\n\n>**Mexican Secretary of Health Birth Certificate:** Copy of the certificate given to the mother in the hospital after the child’s birth. If you submitted this document to the Civil Registry and do not have a copy, request a true copy from the Civil Registry. This document is also called a hospital birth certificate, certificado de alumbramiento, or nacido vivo.  \n\\[...\\]  \n**Certificado de Nacimiento expedido por la Secretaría de Salud:** Copia del certificado otorgado a la madre en el hospital después de nacimiento del menor. Si entregó este documento en el Registro Civil y no tiene una copia, puede solicitar una copia fiel al Registro Civil. Este documento también es conocido como certificado de nacimiento del hospital, certificado de alumbramiento, o nacido vivo.\n\nBy the time I had read the above, I had already handed over the hospital birth certificate (*certificado de nacimiento*) to the Mexico City Civil Registry to prepare my son's birth certificate (*acta de nacimiento*). However, I did make a black and white photocopy of the hospital birth certificate on both sides just before I handed it over.\n\nWill my photocopy count as a true copy, or do I need special certifications from the Civil Registry that received the original?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City"
        },
        "sex": "Hombre",
        "document": "Mexican Secretary of Health Birth Certificate / hospital birth certificate"
    },
    {
        "id": "z40rfc",
        "title": "Preparing paperwork to apply for son's CRBA; how is physical presence calculated based on high school and college transcripts?",
        "score": 4,
        "num_comments": 4,
        "author": "JJVMT",
        "created_utc": 1669341230.0,
        "created_readable_utc": "2022-11-25 01:53:50 UTC",
        "url": "https://www.reddit.com/r/expats/comments/z40rfc/preparing_paperwork_to_apply_for_sons_crba_how_is/",
        "permalink": "https://reddit.com/r/expats/comments/z40rfc/preparing_paperwork_to_apply_for_sons_crba_how_is/",
        "selftext": "Hi there! I will probably be asking several questions about this process over the coming days.\n\nFor background, I am an American living in Mexico with my Mexican wife and our two-month-old baby son. Even though I've been in Mexico since I graduated from the university 11 years ago, I do meet the criteria to pass my citizenship on to him.\n\nSpecifically, since I am a US citizen who was married to a non-citizen during the birth of my son, I need to prove five years' presence in the US before his birth, at least two of which were after I was 14.\n\nTo do this, I have ordered my high school and college transcripts. The former covers the period from September 2002 to June 2006, and the latter from September 2006 to June 2011.\n\nNow, as far as I can tell, even the strictest reading of these transcripts alone should put me within the five years I need. However, I am curious, will they accept these transcripts as covering 3 years and 9 months for high school and 4 years and 9 months for college, or will they hair-splittingly attempt to deduct winter and summer breaks that those records technically don't account for? Or will they be as generous as to accept them as covering a full 8 years and 9 months?\n\nI should note that I lived in the US for the first 24 years of my life, so I definitely meet the requirement. I just want to know how many records I need to purchase and how much I need to bother my dad and brother back home before they visit me, my wife, and their new grandson/nephew for Christmas.\n\nAny insight is appreciated. Thanks a lot!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.83,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "high school and college transcripts"
    },
    {
        "id": "wmlxti",
        "title": "Self-translation vs certified translation of documents",
        "score": 1,
        "num_comments": 1,
        "author": "taigatransplant",
        "created_utc": 1660312673.0,
        "created_readable_utc": "2022-08-12 13:57:53 UTC",
        "url": "https://www.reddit.com/r/expats/comments/wmlxti/selftranslation_vs_certified_translation_of/",
        "permalink": "https://reddit.com/r/expats/comments/wmlxti/selftranslation_vs_certified_translation_of/",
        "selftext": "We’re getting ready to apply for a CRBA for our child. The embassy website calls for the original birth certificate, a certified copy, and an English translation. My husband and I are both fluent in both languages, and translating the birth certificate would be easy. Of course, if by “English translation” they mean “certified English translation,” we can work on that… we’ve just had so-so experiences with translators in the past. \nAnyone tried this route?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "General Advice",
        "us_president": "Joe Biden",
        "location": null,
        "sex": "Mujer",
        "document": "birth certificate translation"
    },
    {
        "id": "tp6oqz",
        "title": "CRBA and American parent is deceased",
        "score": 3,
        "num_comments": 1,
        "author": "Business_Possible_90",
        "created_utc": 1648335048.0,
        "created_readable_utc": "2022-03-26 22:50:48 UTC",
        "url": "https://www.reddit.com/r/expats/comments/tp6oqz/crba_and_american_parent_is_deceased/",
        "permalink": "https://reddit.com/r/expats/comments/tp6oqz/crba_and_american_parent_is_deceased/",
        "selftext": "Recently, my American wife passed away (not in America).  I am in the process of settling her affairs.  However, because of circumstances we never got to file my son's CRBA.  I am in the process of obtaining additional records for proof of physical presence, but to be honest I am quite nervous.  Anyone here been through something like this or know someone who did?  Any comments?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": null,
        "sex": "Hombre",
        "document": "CRBA / records for proof of physical presence"
    },
    {
        "id": "t6ni7p",
        "title": "CRBA (birth abroad certificate) replacement + apostille fees",
        "score": 0,
        "num_comments": 1,
        "author": "I_hate_abbrev",
        "created_utc": 1646413207.0,
        "created_readable_utc": "2022-03-04 17:00:07 UTC",
        "url": "https://www.reddit.com/r/expats/comments/t6ni7p/crba_birth_abroad_certificate_replacement/",
        "permalink": "https://reddit.com/r/expats/comments/t6ni7p/crba_birth_abroad_certificate_replacement/",
        "selftext": "Does anyone know how much is the fee to get a CRBA replacement from US State department and have it apostilled at the same time ? Is it $50 or $100 ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": "CRBA replacement / apostille"
    },
    {
        "id": "covyxm",
        "title": "US Report of Birth Abroad-So Many Rules!?",
        "score": 19,
        "num_comments": 100,
        "author": "dave_and_lyn",
        "created_utc": 1565525203.0,
        "created_readable_utc": "2019-08-11 12:06:43 UTC",
        "url": "https://www.reddit.com/r/expats/comments/covyxm/us_report_of_birth_abroadso_many_rules/",
        "permalink": "https://reddit.com/r/expats/comments/covyxm/us_report_of_birth_abroadso_many_rules/",
        "selftext": "Hi. We had a baby a few months ago and are trying to register the birth at the US Embassy, but finding it SO crazy hard! Among the requirements, they want:\n\n* Medical Records\n* Marriage Contract\n* National Level Birth Certificate\n* US Notarization of Every Single Passport Page\n* Letters between spouses\n* Plane tickets together\n* Rental contract\n* IRS Income Taxes\n* Emails between spouses\n* US School Records\n* US Medical Records\n* Proof of relationship between spouses\n* Proof of US Residency-Not Passport (If your passport shows you left the US 1 month ago, how is that not proof you have been to the US?)\n* Photo Identification of Infant\n* Family Photos from the Moment of Birth, with both parents, and pictures at regular intervals up until the date of your appointment. Photos MUST show \"togetherness\" of both parents. (What does that even mean?)\n* Evidence of parents' US Citizenship\n* Military Statement of Service\n* DD-214\n* Medical Records of Pregnancy\n* DNA Test\n* Evidence of Physical Presence at Same Location on the Day of Conception (Do they want a sex tape?)\n* Evidence of the couple's relationship prior to conception (15 years of marriage and 4 kids is not enough to prove our relationship?)\n\nSo, the LAW simply states:\n\n**\"Child born to two U.S. citizen parents who are married at the time of birth: A child born outside of the United States or its outlying possessions to two U.S. citizen parents is entitled to citizenship, provided that one of the parents, prior to the birth of the child, had been resident in the United States (the law does not specify a specific length of residence time.)\"**\n\nSo I don't get all the requirements by the US Embassy? Why does the law sound so simple, but the requirements so hard? Like e-mail. I have never emailed my wife. Ever. She does not even have an email address! I have to go and make her an email address, send her some emails, \"Hi, hon. Sending you an email for the US Embassy. How about that conception day?\", print them, and submit them. WHY???\n\nOK, I am venting. But I want to share this with others. And I also want to find out in anyone knows what the purpose of all this is?  Thanks for reading!\n\n​\n\n**EDIT: Thank for all your replies, guys! One thing! You know, another user pointed out possibly not needing a CRBA.**\n\n**According to the passport application, you don't! You can get a US Passport with a foreign birth certificate.**\n\n**So why do people file for the CRBA if it is such a pain in the ass!?**",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.73,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": null,
        "sex": "Hombre",
        "document": "CRBA / US Report of Birth Abroad"
    }
]