[
    
    
  
  
    {
        "id": "1jn0twc",
        "title": "Giving Birth in Mexico",
        "score": 33,
        "num_comments": 11,
        "author": "pussycat432178",
        "created_utc": 1743295632.0,
        "created_readable_utc": "2025-03-30 00:47:12 UTC",
        "url": "https://i.redd.it/kz4ckm5y4qre1.jpeg",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1jn0twc/giving_birth_in_mexico/",
        "selftext": "I just toured Santa Fe hospital in Mexico City (pictured here) I’ve reached out to a birthing center to keep my research going. \n\nCan anyone share their experience of giving birth in Mexico as a foreigner?\n\nLanguage barrier, cost, common interventions, normal practices (like piercing girls ears in hospital I know will be offered) are all topics I’d love to read more about! \n",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 0.92,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },
    {
        "id": "1jfsk4y",
        "title": "Driving to CDMX to finish Canje and live. Looking for validation on my plan and some advice.",
        "score": 5,
        "num_comments": 17,
        "author": "i11u5ion",
        "created_utc": 1742487185.0,
        "created_readable_utc": "2025-03-20 16:13:05 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1jfsk4y/driving_to_cdmx_to_finish_canje_and_live_looking/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1jfsk4y/driving_to_cdmx_to_finish_canje_and_live_looking/",
        "selftext": "Hey everyone! \n\nSo I'm doing everything in one swoop and have spent endless hours reading various blogs (shout out to mexicorelocationguide and mexperience), reddit posts and government pages, both for getting residency and moving down. There's quite a bit of outdated and conflicting info so I just wanted to see if my plan / understanding has any glaring holes in it or if there's a better way to do something. \n\nThanks in advance for any help! Also sorry so much in post but it seemed better than several specific ones, so i'll group by step.\n\nBasic overview: \n\n* read / speak decent spanish but have trouble understanding when people speak fast (was in MX for 6 months a few years ago, lived in Spain or a few months, etc)  \n* have temporary residency visa\n* driving into Mexico with dad (just helping) and dog in my truck pulling cargo trailer (in 2 weeks or so) \n* looking to rent a place in CDMX\n\n  \nCrossing Border\n\n* Plan on crossing at Columbia bridge north of Laredo (better for trailers & avoid Tamaulipas); will cross on a weekday morning\n* Duty/Customs: researched doing the official Menaje de Casa but seems like extra steps to pay a similar amount (don't have too much stuff) and have lots of restrictions. Still going to label / number the boxes and have a detailed manifest to show.\n* FMM/TIP: initially was going to do online beforehand but now planning on doing at border (importance of making sure it's stamped as Caje instead of visitante & seems fairly easy). Will have registrations & copies of everything.\n* Dog: I'll have a rabies / good health certificate. \n   * Q: You're supposed to stop at SENESICA / SAGARPA to have the dog inspected but seems like nobody really does? I've also read some people say those staff are onnly at airports and not land borders. Not sure if I should worry about it.\n\nDriving to CDMX\n\n* Current plan is kinda to just get to CDMX asap - especially with a trailer. \n   * Q: Not sure if I'm trying to go too fast and/or if it's worth spending an extra day or two to check out interesting cities along the way. Ex: Guanajuato, aguascalientes, etc\n* That plan:\n   * Stay the night in Monterrey after crossing border\n   * Next day drive to and stay in San Luis Potosi\n   * Next day drive to CDMX\n* There's an RV park (Pepe's) north of the city I'll plan on leaving the trailer and maybe the truck until I have a place rented\n* Besides the usual tips of only driving during day, use toll roads, under speed limit - how should i prepare for any potential police shakedowns?\n   * Q: Should I always refuse to pay and say take us to the station? Or maybe just have a certain amount of $ handy ($50?) I can offer after some arguing and haggling?\n\n  \nCanje\n\n* Going to get an airbnb in CDMX for 2 or so weeks initially, to complete Canje and find a place to rent. Can always book another if needed.\n* While I could probably do the whole Canje process myself, I'd rather hire an immigration facilitator to get the appointment and make sure everything is correct the 1st time.\n   * Q: Does anyone have recommendations / contact info for a facilitator? How much do they cost?\n   * Q: I'm guessing I should wait for them to help fill out the official immigration forms?\n*  Most lists of needed documents have the normal items (FMM, passport, visa, letter, bank statements, immigration forms, etc) \n   * Q: However I've also references to a myriad of other potential documents like birth certificates (apostilled, translated, etc) and people having to fly back to the US, etc? I just want to make sure I have everything.\n\nRenting a place\n\n* Looking to rent a 2 bedroom flat somewhere in the usual areas (Roma nte, Polanco, Juarez, Rosa, etc) for 12 or possibly 6 months. Also have a dog.\n* I was first planning on connecting and meeting up with local expat group(s) as I assume they would have connections / recommendations with access to better places than just using websites\n   * Q: There's a bunch of different sites listing places for rent but not sure if there's one or two that are the best to use?\n* Finding / renting a place\n   * Q: Is it recommended to use some kind of realtor to do this process or is it fine doing it on your own?\n   * Q: Is it reasonable to expect to be able to move in to a place with in a week or two of signing a lease / etc? Or is there some bureaucratic process that drags it all out?\n   * Q: Everybody from CDMX I've talked to in the US has told me to have a Mexican friend do the initial call / get rent prices / etc as they will automatically jack the rates up if they know I'm a gringo. Is that a thing and how would that work? I feel like they would know as soon as I went to look at the place but maybe they usually honor the initial rate? Not trying to scam anyone but not trying to get scammed either.\n\nThanks again for any help or advice!! \n\n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.73,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },


    {
        "id": "1jdm7j5",
        "title": "Best CDMX suburbs or smaller cities for families",
        "score": 2,
        "num_comments": 3,
        "author": "_pupp0",
        "created_utc": 1742241664.0,
        "created_readable_utc": "2025-03-17 20:01:04 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1jdm7j5/best_cdmx_suburbs_or_smaller_cities_for_families/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1jdm7j5/best_cdmx_suburbs_or_smaller_cities_for_families/",
        "selftext": "Hi all, I am a U.S. citizen married to a Mexican citizen and we have two children who are dual citizens. We currently live in the United States but are seriously considering our options in Mexico given everything happening here. What are some CDMX suburbs or smaller cities that have good schools and at least somewhat of an American immigrant community? A university presence would be a plus too so I can take classes. The kids speak fluent Spanish but I’d like them to continue learning English. FWIW, we live in a large American city now and are used to that lifestyle (even though I know CDMX is next level). Thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },
  
    {
        "id": "1jaf3i0",
        "title": "Which consulate for family of four wanting TR with six months income",
        "score": 2,
        "num_comments": 34,
        "author": "cap10morgan",
        "created_utc": 1741880900.0,
        "created_readable_utc": "2025-03-13 15:48:20 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1jaf3i0/which_consulate_for_family_of_four_wanting_tr/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1jaf3i0/which_consulate_for_family_of_four_wanting_tr/",
        "selftext": "I live in Denver and am planning to move to Mexico with my wife and two kids. I want to apply for temp residency with my qualifying income (i.e the amount is high enough for all four of us). My employer has given me permission to work remotely from Mexico.\n\nHowever, I’ve only had my current job since early November, 2024. So I won’t have six months of steady qualifying income until May, and we’re hoping to move this summer. So I’d like to avoid consulates that require 12 months of qualifying income if possible.\n\nThe Denver consulate, for whatever reason, refuses to consider income for temp residency. They will only look at 12 months of qualifying savings, which must be liquid (i.e. IRAs, 401k’s, etc. don’t qualify). They told me all this over several emails back and forth recently. So I can’t go to my local consulate.\n\nIt looks like Las Vegas could work, but they seem pretty booked up. They said I’m on a waitlist but I’m not going to hold my breath there.\n\nIt also looks like Phoenix could work and maybe San Diego. But I haven’t gotten a reply from the scheduling email I sent the former and the latter uses this citas.gob.mx website to schedule appointments and I cannot for the life of me get that thing to work. Are others using that successfully? If so, are you logging in using the Llave MX thing or just email and password?\n\nANYway my real question is which other consulates should I be looking at? Has anyone had recent success getting TR with these qualifications at other consulates?\n\n¡Gracias!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },


    {
        "id": "1j8h7ym",
        "title": "TR via family unity: multiple name changes and translation Q's",
        "score": 1,
        "num_comments": 0,
        "author": "cyber-ham",
        "created_utc": 1741662288.0,
        "created_readable_utc": "2025-03-11 03:04:48 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1j8h7ym/tr_via_family_unity_multiple_name_changes_and/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1j8h7ym/tr_via_family_unity_multiple_name_changes_and/",
        "selftext": "My husband and I are looking at the possibility of moving to Mexico and applying through the consulate here in the US for my TR via family unity. He is a Mexican citizen, and I am a US citizen.\n\nI have multiple name changes through court orders, and one due to a previous marriage. The thing that concerns me most is that my most recent name change via court order has a different first and last name than my marriage certificate because I wanted to revert to my old first and middle name and only take one of my husband's surnames rather than both.  The probate court will not update it. My birth certificate also has a completely different name, but I have the complete paper trail of my name changes. Has anyone had issues with this when dealing with trying to get the Family Unity TR through the consulate in the US? If it's approved in the US, will I have issues completing the visa processing when I get to Mexico?\n\nI also have a document from another country that I may or may not need to present. I know I need the apostille, but from what I understand,  the translation of the document happens after the apostille and can be done anywhere as long as it's one of the approved, certified Mexican translators, correct?\n\nThanks for the help.\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },
  
 
 
    {
        "id": "1j4c57p",
        "title": "Mexican passport requirements for Dual Citizenship",
        "score": 4,
        "num_comments": 4,
        "author": "Comprehensive_Gap778",
        "created_utc": 1741204339.0,
        "created_readable_utc": "2025-03-05 19:52:19 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1j4c57p/mexican_passport_requirements_for_dual_citizenship/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1j4c57p/mexican_passport_requirements_for_dual_citizenship/",
        "selftext": "Our family is considering moving to Mexico as an emergency option and we're in the process of obtaining all of our documents. My husband is a Mexican born naturalized US citizen and I'm a US born citizen. We'd like to get our son's birth registered so he can have a Mexican passport. All of my husband's official Mexican documents have his father's last name and mother's maiden name as his last name, but his US documents have only father's last name. My son's birth certificate has my husband's US last name. I've heard the Mexican embassy is picky about names matching. Do I need to have my son's birth certificate changed before proceeding with everything. I can't get any info from our consulate. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.83,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },

    {
        "id": "1iwmj71",
        "title": "Recovering Mexican Citizenship as a Transnational Adoptee",
        "score": 4,
        "num_comments": 4,
        "author": "Expect-The-Dicastery",
        "created_utc": 1740349910.0,
        "created_readable_utc": "2025-02-23 22:31:50 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1iwmj71/recovering_mexican_citizenship_as_a_transnational/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1iwmj71/recovering_mexican_citizenship_as_a_transnational/",
        "selftext": "My partner, who was born in Mexico but adopted by parents in another country where we now live, would like to reclaim their Mexican citizenship.\n\nWe have almost all of the documents that the Mexican government requires for the process, according to [these ](https://consulmex.sre.gob.mx/albuquerque/index.php/avisos/18-cat-comunicados/46-recuperacion-de-nacionalidad)[two ](https://consulmex.sre.gob.mx/sanjose/index.php/registro-civil/recuperacion-de-la-nacionalidad-mexicana)pages from Mexican consulates.\n\nWhat we don't have is their original Mexican birth certificate. Due to (very stupid) laws in the jurisdiction where their adoption was finalized, it is extremely difficult, and potentially impossible, to have that document unsealed.\n\nI wrote to the local Mexican consulate about how to reclaim citizenship in the absence of the Mexican birth certificate, but I'm still waiting for them to respond. \n\n(I know consulates move slowly.)\n\nIn the meantime, where else might we look for information on recovering Mexican citizenship in this case?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.83,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },
    {
        "id": "1ihbry7",
        "title": "Possibly looking to relocate from Arizona to Mexico",
        "score": 10,
        "num_comments": 28,
        "author": "Timid_Tanuki",
        "created_utc": 1738651569.0,
        "created_readable_utc": "2025-02-04 06:46:09 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1ihbry7/possibly_looking_to_relocate_from_arizona_to/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1ihbry7/possibly_looking_to_relocate_from_arizona_to/",
        "selftext": "My husband and I are looking to sell our house in Phoenix and potentially move to Mexico. We're intending to visit a few cities once we get our tax return. We would be moving on a budget - just the proceeds of our home sale, which would probably be \\~$180-200k.\n\nBased on that, what cities are relatively welcoming to Americans that would be within our price range, with the caveat that the city be LGBTQ+ friendly as well?\n\n\\[edit\\]\n\nTo clarify a few points:\n\n* First, thank you for all the feedback. I've learned a lot just from the responses I've gotten so far.\\\\\n* I understand that the community has a restriction on politics. Let me just say, this is something my husband and I have talked about doing extensively in the past, but we feel that it might be necessary to make those tentative plans a reality in a shorter order than we intended.\n* My husband has a job and makes roughly $84k a year gross. We would not be looking to retire. However, I'm currently unemployed. My hope had been to find a job there, but I understand the restriction; I'll have to give that some thought. \n* I do speak a little Spanish - I took about 5 years through high school/college but I never had an opportunity to do any immersive learning (I grew up in southern Indiana and there weren't many people fluent in Spanish) so a lot of it didn't stick. My husband grew up in Arizona and knows about as much as I remember. But learning the local language of wherever we move would be a priority.\n\nThis has given me a lot to chew on, and at a time when my mouth is already full :/ Thank you everyone",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1i9hbcw",
        "title": "Better to marry in US or Mexico?",
        "score": 5,
        "num_comments": 19,
        "author": "Expert-Cattle8306",
        "created_utc": 1737788008.0,
        "created_readable_utc": "2025-01-25 06:53:28 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1i9hbcw/better_to_marry_in_us_or_mexico/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1i9hbcw/better_to_marry_in_us_or_mexico/",
        "selftext": "I’m a US citizen, my fiancé is dual citizen US/Mexico. We live in Mexico but travel back and forth frequently. \n\nI’m trying to figure out where it’s better for us to get married. If we marry in San Diego, would we then apply at the local consulate for my temporary resident visa? I looked on their site and it doesn’t mention requiring apostille, translation of documents, or my birth certificate.\n\nOr we marry in Mexico with having to translate my papers first, medical exams and other hoops to get married then apply in country. I don’t have to translate the marriage cert that way but it seems all of my papers would need translation, apostille, medical exams, and who knows what else.\n\nMaybe I just hire a lawyer in either country who could handle the process smoothly? \n\nAnyone who has insight in this situation would be appreciated! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.78,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },

    {
        "id": "1h9a5fr",
        "title": "Looking for advice/Birth Stories!",
        "score": 0,
        "num_comments": 4,
        "author": "TeaGnomes",
        "created_utc": 1733629757.0,
        "created_readable_utc": "2024-12-08 03:49:17 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1h9a5fr/looking_for_advicebirth_stories/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1h9a5fr/looking_for_advicebirth_stories/",
        "selftext": "Hey! Our family is moving to MX, maybe 2.5 hrs from Puerto Vallarta. About a month and a half later I'm supposed to have a baby. I haven't heard awesome stuff about people having babies where we will be living and was thinking about us maybe going over to Puerto Vallarta for the week of the due date to deliver there. Anyone given birth there? I'd love to hear your personal experiences and if you feel comfortable the name of the Dr.! I know that A LOT of people in MX have C-sections, but I'm really hoping to have a natural birth... Let me hear your stories! (Cross posted) We are also maybe considering Guadalajara if that would be way better?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1h4lyhv",
        "title": "Mexico dual citizenship issue",
        "score": 1,
        "num_comments": 0,
        "author": "lm9230",
        "created_utc": 1733111075.0,
        "created_readable_utc": "2024-12-02 03:44:35 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1h4lyhv/mexico_dual_citizenship_issue/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1h4lyhv/mexico_dual_citizenship_issue/",
        "selftext": "Hello! We are having an awfully hard time getting my child his dual Mexican citizenship. My husband,  a Mexican citizen by birth, changed his last name when he became a US citizen very slightly. He was turned away from registering our son as a citizen at the consulate because of the difference of last name between our child's birth certificate and my husband's Mexican birth certificate. We have proof of the legal name change that was not accepted at the consulate and we have been given varying advice about how to fix the issue so our child can be registered as a Mexican citizen. Any specific or actionable advice would be greatly appreciated. changing my child and my husband's last name in the US is not an option.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
 
    {
        "id": "1gvizqa",
        "title": "Expired TIP",
        "score": 3,
        "num_comments": 15,
        "author": "DolemiteSWFL",
        "created_utc": 1732082744.0,
        "created_readable_utc": "2024-11-20 06:05:44 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1gvizqa/expired_tip/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1gvizqa/expired_tip/",
        "selftext": "I moved to Mexico in April(24') and was given a 180 day TIP at the border for my vehicle (2000 Toyota 4runner). That TIP is now expired and I am looking for assistance with legalization and registration.\n\n I have visited and spoken with several gestoría vehicular locations in my town as well as a couple of online ones. I was told today that because my vehicle entered the country after October 2021 that it is ineligible for legalization. \n\nThis vehicle is older and not particularly valuable but I'd like to keep it as it is a great 'beater' truck. Also I live in Oaxaca so making a run back to the border is out of the question.\n\nCan anyone recommend any fixers, gestoría, etc that can help me come up with a workaround to this issue?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1glsp4z",
        "title": "Has anyone gone back to their home country to give birth? (US/Mexico)",
        "score": 5,
        "num_comments": 20,
        "author": "Singlemama2b",
        "created_utc": 1730992368.0,
        "created_readable_utc": "2024-11-07 15:12:48 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1glsp4z/has_anyone_gone_back_to_their_home_country_to/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1glsp4z/has_anyone_gone_back_to_their_home_country_to/",
        "selftext": "Living and working in Mexico and trying to decide whether to give birth here and register a birth abroad, or plan to go back to the US to give birth. \n\nCurrently I meet eligibility to pass citizenship to my daughter through birth but I’m worried with the political climate whether that could change or she could later have fewer rights in the US if she were born in Mexico/has Mexican dual citizenship. \n\nOn the other hand, if she were born in the US it might be hard to get her a Mexican visa quick enough for me to return to work with her here? If anyone has experience with Mexican visa issues for dependents. I’m on a permanent residency for work purposes. \n\nAll insights welcome thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.78,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },

    {
        "id": "1gl36so",
        "title": "Relocation 2025: Advice please ",
        "score": 1,
        "num_comments": 14,
        "author": "Pure-Jump6975",
        "created_utc": 1730912321.0,
        "created_readable_utc": "2024-11-06 16:58:41 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1gl36so/relocation_2025_advice_please/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1gl36so/relocation_2025_advice_please/",
        "selftext": "My family will be relocating to Mexico in 2025. We are excited and a little nervous. There are several things we’ve already taken care of: We know we qualify for temporary residency visas based on economic solvency and have all our documents ready to go. We understand we’ll be able to ship some household items to our new home without a formal Menaje de Casa. My job is letting me work remotely, so our gross household income will be about $130K USD even with my spouse not working. It’s time to pull the trigger and get an appointment with our Consulate. \n\nWe are still narrowing down places to live, based on the needs of our family:\n\n-Excellent English-speaking health care including mental health care for our kid with ADHD\n-Excellent English-speaking veterinary care for our diabetic cat\n-Three bedrooms (or two plus an office) as I will be working from home and need a dedicated office space\n-Walkable or well served by public transport\n-Has an international school nearby\n\nRight now, front runners are all in Mexico City: neighborhoods of Santa Fe, Roma Norte, Condesa, and Polanco. Pretty sure we can’t afford Polanco based on my research. We have been told about the Providencia and Chapalita in Guadalajara but the public transit is warding us off. Same with Monterrey in general. Would love to know if this is true.\n\nWe can probably swing upwards MXN 40,000 a month for rent but would like to keep it below that given we will have to pay private school tuition.\n\nWe don’t speak Spanish (yet) but my spouse is ahead of me, having taken it in school albeit many years ago. \n\nWe have a few outstanding questions! \n\nLocations: I’d love to hear from you about our location finalists. Is there somewhere we didn’t consider that we should? Is one of those finalists a bad idea?\n\nFinances: We prefer to live below our means, which is how we can afford an international move in the first place. I know I’ll have to source health care in Mexico since my health insurance through work will be invalid there, but even considering that cost, I think my income more than covers typical living expenses for a family of three. Is this accurate?\n\nTaxes: I’m probably going to need an accountant’s advice who is familiar with ex-pats on temporary residency visa keeping their US-based jobs. Do you have one to recommend? \n\nRenting: Once we narrow down our area, we’re not sure if it makes sense to hire a real estate agent to take us around to apartments once we arrive, or if I should go down first to scout and sign a lease, or something else? We can probably swing an AirBNB for a month or two if we have to, but since we want to ship household items and we’ll be in Mexico 1-4 years (and permanently if we love it!) we don’t want to be bouncing around and we’ll need a place to ship our household items. \n\nTransportation: We have a perfectly fine car, but it seems impractical to get it to Mexico, since we live more than 1,000 miles from the border. We can’t drive it, and shipping it seems exorbitant. Can we get along without a car in our desired location(s)? Should we be looking at budgeting to buy a car in Mexico?\n\nEducation: Since we’re likely moving in the middle of a school year, we figure on “home schooling” to finish out the school year, and then enrolling our kid in local elementary school in the fall. We like the idea of enrolling in an international school, and are nervous about ADHD supports. We welcome any advice about schooling for English-speaking kids with ADHD particularly in the locations we’re considering. We’re also open to specific school recommendations.\n\nThe Awkward Stuff: We know our Spanish isn’t good yet, and certainly won’t be ‘bureaucracy-good’ for a while. We’re willing to spend money on helpers/translators that are trustworthy to help get us settled in. I’d love to get some referrals or hear your experiences with this type of service. While there are concierge services geared towards the ultra-wealthy, we are not that. Very willing to pay a local or another ex-pat though, is this a service that exists?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },

    {
        "id": "1fulg77",
        "title": "Considering Starting A Family in CDMX",
        "score": 0,
        "num_comments": 9,
        "author": "Asleep_Acadia829",
        "created_utc": 1727889027.0,
        "created_readable_utc": "2024-10-02 17:10:27 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1fulg77/considering_starting_a_family_in_cdmx/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1fulg77/considering_starting_a_family_in_cdmx/",
        "selftext": "My wife and I (both American citizens) are in Mexico City on tourist visa's and really enjoying the quality of life here.\n\nWe are considering what starting a family could look like here and are looking for support with trying to understand the process.\n\nWe do not currently have healthcare insurance or Temporary Residency in Mexico--open to making this happen if easiest.\n\nAlso trying to understand the care process here for mother and child during pregnancy, delivery, and post. Questions we're trying to understand include: \n\n* What does the care team look like (ex. Gyno, Pediatrician, Dula, Lactation Consultant, Night Nurses, etc)\n* What is the best insurance policy to cover all of the things\n* Parenthood courses to better understand the process and system\n* Any recommended English speaking doctors that proactively care for the mother and the child without having to advocate for ourselves too much given how challenging the process can be\n* Any recommended Hospitals that are well known\n* Process for getting our child a US passport after birth\n\nI don't know what I don't know but would really appreciate any advice from someone who's specifically gone through this experience in CDMX and could help us learn :-) ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.31,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1f9gazj",
        "title": "Going to Mexico to marry my fiancee. I want to bring my personal belongings with me through Menaje de Casa. Is it possible to do this before entry, or will I have to make two flights?",
        "score": 3,
        "num_comments": 18,
        "author": "MonkAndCanatella",
        "created_utc": 1725519915.0,
        "created_readable_utc": "2024-09-05 07:05:15 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1f9gazj/going_to_mexico_to_marry_my_fiancee_i_want_to/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1f9gazj/going_to_mexico_to_marry_my_fiancee_i_want_to/",
        "selftext": "Context: I've been more or less living in mexico for about 3 years, and been with my fiancee for about as much time. I had to return to america for a job, but I've finally gotten a remote job again and plan to move back. I proposed recently, but my apostille/birth certificate has taken months to arrive, so we haven't been able to marry. I have much of my personal belongings here in america - including my personal laptop, personal pc, NAS, and work laptop for the most expensive items. I don't want to have to pay duties on them and since I'm marrying soon anyway, I'll have the Menaje de Casa to allow me to bring my personal possessions. \n\nMy question is, is there a case to be made to allow me to bring my possession through menaje de casa on the trip I make to actually do the civil marriage? The alternative is fly there to get married, fly back out and fly back in with my personal belongs. That seems like an epic waste. Do you think this is possible?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.71,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },
    {
        "id": "1f0iy47",
        "title": "Our Exp with TR in CDMX in 2024",
        "score": 6,
        "num_comments": 14,
        "author": "victronic",
        "created_utc": 1724542921.0,
        "created_readable_utc": "2024-08-24 23:42:01 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1f0iy47/our_exp_with_tr_in_cdmx_in_2024/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1f0iy47/our_exp_with_tr_in_cdmx_in_2024/",
        "selftext": "Wanted to share our experience successfully receiving TR via economic solvency and TR via family unification in CDMX this past week.\n\nI’ll skip everything pre-arrival in Mexico, except for noting that only one spouse applied for and received a TR visa in the US with our plan always being to apply for family unification.\n\nDay 1 - Arrived at INM at 730AM to handover passport and sign documents with hired facilitator. Grabbed breakfast nearby and waited to hear what time my appointment would be.\n\nAt about 930, I was told I had an appt at 11 and to be back at INM by 1045. Waited outside in the courtyard near the fountains until 1pm when I was finally ushered to the payment counter by my facilitator.\n\nAfter paying, I was handed a single piece of paper and asked to wait near an office where I was promptly assisted and given a second piece of paper to take upstairs. On the top floor, it’s similar to a DMV with a bunch of counters and biometric stations.\n\nMy documents were submitted and in a couple mins my name was called for processing. Fingerprints, signature, photos. Card was printed in less than 5 mins and I was on my way back to our Airbnb by 2pm.\n\nDay 2 - My facilitator knew we wanted the family unification appointment to be on day 3, but they failed to tell me that they would need my spouse and child’s passports on day 2 in order to make the appointment. So, I had to bring the passports to INM on day 2 at 9am. I was told I would know the appointment time for the following day by 3pm (when INM starts to close for the day), but that wasn’t the case. My facilitator kept our passports overnight (with my prior permission)\n\nDay 3 - at 8am, I was told we should all arrive at 1145 for our 12 appt. We hung out in the courtyard until 230 when my wife and child had to go in alone with my facilitator to make four separate payments (1705 per person for the review + 5328 per person for the 1 yr TRs). \n\nThey were then inside for what felt like an hour and our facilitator said we would need to come back the next day for their biometrics. At 3pm, I was told I would need to leave the courtyard.\n\nAt around 330, my spouse exited, but quickly explained that the immigration officer had only provided the paperwork for herself but not our child. Our facilitator took everything back inside by himself and after a few minutes he came out and shook his head saying we would have to get that tomorrow even though it is such a simple task after you’ve paid the fees.\n\nDay 4 - Since the family unification TRs had already been approved and we just needed the paperwork for our child plus biometrics, we were told we could come anytime and it should only be 30 mins tops. We settled on 9am and my spouse and child quickly went inside. This time they had to wait somewhere on the opposite side of the floor so I didn’t have any visibility of when they made it upstairs for biometrics, but they were finished in about an hour and a half.\n\nDay 5 - Only thing to note is that the “IMN office” at CDMX in terminal 2 for receiving an exit stamp is just a information kiosk that we actually missed since the signage points to a restaurant and the kiosk isn’t clearly marked on all sides. After backtracking, I quickly found it near the duty free store and HSBC/Citibanamex/Amex lounges.\n\n\n\nI was prepared for things to be slow and bureaucratic, and this is not a complaint since that would be too entitled, but it essentially took three full days to do an individual TR plus two family unity TRs. We felt the process was “easy” given our use of a facilitator, but draining with a toddler. We were each dealing with stomach bugs for one of the days and it rained every evening, so the trip was short of exploring/attractions.\n\nOne other note is that I never felt like I knew what our facilitator was doing or where they were. They were obviously inside waiting in lines, which I appreciate not having to do myself, but I don’t feel like the process was that well explained to us. I realize the INM rules dictate what they are not allowed to do, such as chaperoning us to biometrics, but I would ask for an update on where my spouse was in the process and they didn’t really know. \n\nNow we get to decide where to visit next summer to renew!\n\nHappy to answer any questions. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1ebezhz",
        "title": "Dual citizenship - names on birth certificates",
        "score": 6,
        "num_comments": 21,
        "author": "forceholy",
        "created_utc": 1721861185.0,
        "created_readable_utc": "2024-07-24 22:46:25 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1ebezhz/dual_citizenship_names_on_birth_certificates/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1ebezhz/dual_citizenship_names_on_birth_certificates/",
        "selftext": "Hello there! I have a question about dual citizenship. The vital records office and my local consulate are giving me the run around with this question and /r/immigration downvoted me. I hope I can get some answers here. \n\nI am an American citizen by birth, but I can claim Mexican citizenship through my parents. I am in the process of gathering documents to claim it, but I noticed that the names of my parents on my birth certificate and those of my parents don't match. For instance, in Mexico, it is common to use both of your parent's last names. My US birth certificate only has one. My worry is that my US birth certificate won't be accepted at all if the names don't match. I can't get a clear answer out of the consulate or my local records office, and I am willing to make those changes if possible.\n\nHas anyone else run into this problem and how was it fixed? Thanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.88,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },
    {
        "id": "1e52eci",
        "title": "Thinking About Moving to Oaxaca",
        "score": 8,
        "num_comments": 31,
        "author": "AustenPowers666",
        "created_utc": 1721170384.0,
        "created_readable_utc": "2024-07-16 22:53:04 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1e52eci/thinking_about_moving_to_oaxaca/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1e52eci/thinking_about_moving_to_oaxaca/",
        "selftext": "So, as the title suggests, I (24f American) am thinking about moving to Oaxaca in the next 2 years. I'm looking to do so because my in-laws, both parents and a brother, are thinking of giving up their plan to become US citizens and just moving back down to Mexico. There is a lot going into this decision, and I'm not even sure where to begin.\n\nI am married to my husband (31M Mexican) who is a US citizen by birth and does not have Mexican citizenship, though I am trying to make him get it so this transition is easier. He alone does not earn enough to meet the financial obligations of moving, as the local consulate says they want proof of $5,000/month or the equivalent in savings. I have not been working due to a multitude of health issues (osteoporosis and psoriasis related health conditions, as well as a back injury) and do not believe I'll be able to earn enough doing side jobs to help us towards this goal.\n\nAm I going to be denied a visa due to the financial insufficiency? Or could I be denied due to my health problems? Our local mexican consulate never answers the phones and is booked out 6 months, so I can't even ask them for a very long time.\n\nAnd I know my husband and his family are thinking of opening a restaurant/bar in Oaxaca when they get back. Is that something feasible? Can someone with a visa even be involved in that? Can it be done while being out of the country, or would they need a physical address in Mexico to do it? \n\nI'm struggling to find resources online about this, as most of it being opinions pieces rather than on if it's even worth moving to Mexico. And I'm stressing trying to line-up the financial plan before we even really think about leaving. Any and all tips/advice or otherwise is greatly appreciated!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.83,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },

    {
        "id": "1e0u5hw",
        "title": "anyone have experience giving birth in mexico? (american expat)",
        "score": 8,
        "num_comments": 33,
        "author": "Sensitive-Time8522",
        "created_utc": 1720717937.0,
        "created_readable_utc": "2024-07-11 17:12:17 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1e0u5hw/anyone_have_experience_giving_birth_in_mexico/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1e0u5hw/anyone_have_experience_giving_birth_in_mexico/",
        "selftext": "Hi, my spouse and I live in Mexico. He is a citizen, as well as our son and I am here on a tourist visa. We also go back to the US several times a year. \n\nI am pregnant and trying to decide whether to have the baby in the US or Mexico. I live near large cities (Saltillo/Monterrey) with private hospitals. It appears they offer reasonably prices birth packages. We currently do not have any type of Mexican Health Insurance coverage. \n\nDoes anyone have any thoughts on their experience with maternity care here or on whether we need some type of Mexican Health insurance? If it is helpful, the birth of our son was an uncomplicated vaginal birth. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1d9wpdl",
        "title": "Moving to Mexico for 6 months - Next Steps",
        "score": 5,
        "num_comments": 27,
        "author": "Suikoden1983",
        "created_utc": 1717717358.0,
        "created_readable_utc": "2024-06-06 23:42:38 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1d9wpdl/moving_to_mexico_for_6_months_next_steps/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1d9wpdl/moving_to_mexico_for_6_months_next_steps/",
        "selftext": "Hey everyone:\n\nI am planning on trying to stay in Mexico for 6 months, starting closer to end of 2024. I am a US citizen and 41 years old. I tried to read through several similar posts about this, but wanted to see if my \"next steps\" are correct in moving forward. Note I spent 1 week in CDMX in September 2023 working remotely to \"try\" this out, and also spent two weeks there in 2018 for some business meetings and sightseeing. My goal is to try and go to both CDMX and Guadalajara. My next steps are as follows (with some questions):\n\n1) Try to find an air bnb starting around late October 2024 or January 2025 if I need a bit more time to prepare. Though I want to stay for six months, I will probably try and reserve something for about 2 months first, in case I want to change locations. \n\n2) Given that I may change locations while there, do I just use the initial air bnb address as my place of stay when submitting any immigration documents upon entering the country?\n\n3) I will be working from my computer the whole time. If I am asked why I am coming into the country for so long, should I just say vacation or can I up front say I plan to just work from my computer? I know some countries are very hard on this, which is why I ask (for example, the UK or Ireland).\n\n4) Is there any chance that even if I state I will stay for 5-6 months that they stamp me for less? When I went in Sept 2023, they stamped me for only 3 months, but that may have been because I said I was staying for only one week.\n\n5) Does anyone have any experience receiving mail at their temporary Mexican residence, which may be forwarded from relatives back in the US? I have some concerns mail may not make it to an air bnb. \n\n6) If I leave the country temporarily during the six month stay (for example, if I need to go back to the US for business or to go see a relative), has anyone had bad experiences trying to get back in if still within the stamped time frame? \n\n7) Has anyone had any difficulty utilizing their US bank accounts while from MX? I plan to just withdraw funds from Mexican ATMs or tellers where needed, but otherwise use credit cards. \n\nThanks for any advice.   \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.73,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
    {
        "id": "1d2sgo7",
        "title": "My Experience: Temporary Residency in Puebla via Marriage ",
        "score": 6,
        "num_comments": 5,
        "author": "hippoposthumous1",
        "created_utc": 1716925452.0,
        "created_readable_utc": "2024-05-28 19:44:12 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1d2sgo7/my_experience_temporary_residency_in_puebla_via/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1d2sgo7/my_experience_temporary_residency_in_puebla_via/",
        "selftext": "Most of the posts on this topic have been from a CDMX perspective. I wanted to give an account of my experience here in Puebla, in case someone is looking to compare and contrast the experience in different locations. Since most here have already read through the process, I'm going to keep this brief. There is a lot of information about what you need to bring for this process, but I didn't need most of what I was told I would need. What I ACTUALLY needed: \n\n1. Tramite. Make sure you print out the right one, because it is very easy to get wrong. This is the one you need:https://www.inm.gob.mx/tramites/publico/solicitud\\_estancia.html\n   1. In the first field select: Cambiar condición de etancia. \n   2. in the second field select: Cambio condicion a residente temporal por unidad familiar\n   3. fill it out completely\n   4. If you bring the wrong form, they won't print out the correct one. You will have to leave, print it, and come back.\n2. Your name. This seems simple, but it's confusing. In Mexico, you have a first name or names, and then your maternal and paternal last name. In the USA, we usually have a first, middle, and last name. I have learned that your Nobre is your First AND Middle name. Your Apellido is your last name. Don't combine middle and last. More confusing yet, is that sometimes maternal and paternal last name are called \"primer apellido\" and \"segundo apellido\" or something similar. Don't put your middle and last there either. Your last name is your apellido (usually your father's, unless you do a hyphenated situation). So Nombre: First and Middle. Apellido: Last name. This WILL save you headaches on all manner of forms.\n3. Passport with stamp that replaces the FMM. Note that even though most airports aren't using the physical FMM form anymore, they require one. The good news for me was that the INM was used to this, and was ready to print one out for me, no problem. She didn't even ask me for one, she just automatically printed one. \n4. Spouse Mexican Passport\n5. Apostilled Marriage Certificate\n   1. And official translation if USA or other foreign certificate\n6. Spouse Passport\n7. Copies, only needed one copy each of\n   1. Your passport\n   2. Mexican spouse passport\n   3. Marriage License with Apostille \n   4. Translated Marriage License with Apostille\n8. Debit or Credit card for 2 payments, one to look at documents, one to issue the temporary residency permit\n9. A form they gave me that my spouse agrees we're really together, etc... It's a single page attestation that you can pre-fill here: [https://drive.google.com/file/d/1nM1utBVjOehQeD7k2BPr5WPYsdODS9j7/view](https://drive.google.com/file/d/1nM1utBVjOehQeD7k2BPr5WPYsdODS9j7/view)\n\n<<<<<<<<   SIGNATURES MUST MATCH PASSPORT SIGNATURES. >>>>>>>>\n\n\n\nWhat I was told I needed but DID NOT NEED, WAS NOT ASKED FOR\n\n1. Birth Certificates of any kind from either party\n2. Proof of residence- lease, bills, etc\n3. Spouse INE\n4. More than one copy \n5. Prepaid Pago de Derechos receipts(you can do this at the bank if you want like I did, but you can just pay at the counter now)\n6. Photographs\n7. A lawyer\n\nI spent a considerable amount of extra money on apostilled birth certificates and translations, copies of my lease, copies of bills, and multiple sets of copies for everything. I didn't need any of it in Puebla, nor did anyone else (I was in a front seat and could see the process for others). \n\nIt is maddeningly slow. The process, more or less:\n\nThey open at 9AM\n\nI arrived at 6AM and was third in line. Once I got in, I was seen at around 9:45 and told I had the wrong tramite. The nice lady explained (in English) the correct one, showed my on her computer how to get it, and gave me a paper with all of the requirements. I told her I'd be back later that day. I found a copy shop that's about a block from the INM. I was able to fill out the right form on my phone, save the pdf and email it to the copy shop to print. I went back, and had to wait about 45 minutes in line to get back in. It took me about 1.5 hours to get back up to the window, and everything seemed fine. About 2 hours later they called me up and told me my spouses signature didn't totally match the signature on the attestation, so I called her from the cafe she was at and she fixed it. Then it was another 3 hours until I was seen for my photograph. I received my card about 1.5 hours after that. \n\nIt was a stressful, long day, but I left with my temporary resident card, and we went out for a couple of negronis. \n\nMake sure you have the right forms the first time, make sure all of your signatures match. Make sure your name is in the correct format, and you'll be out in a day. Then you are clear for a couple of years until it's time to get a permanent card. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.8,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cp593i",
        "title": "Trouble moving deposit to escrow ",
        "score": 3,
        "num_comments": 5,
        "author": "ghostpie666",
        "created_utc": 1715389069.0,
        "created_readable_utc": "2024-05-11 00:57:49 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/1cp593i/trouble_moving_deposit_to_escrow/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/1cp593i/trouble_moving_deposit_to_escrow/",
        "selftext": "Anyone here who has purchased a property in Mexico have trouble wiring cash to the escrow? The realtor claims transfers from Canada are notoriously problematic and my bank insists they are entering the information exactly as given and I've triple checked it myself. I posted a couple weeks ago about one particular escrow and it just won't go through. Why is this so difficult? Anyone have a similar experience and how did you get it fixed? Thanks in advance. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Question / Advice"
    },



    {
        "id": "11ckiet",
        "title": "Musician moving to mexico",
        "score": 5,
        "num_comments": 8,
        "author": "Flashy_Swordfish_359",
        "created_utc": 1677426791.0,
        "created_readable_utc": "2023-02-26 15:53:11 UTC",
        "url": "https://www.reddit.com/r/mexicoexpats/comments/11ckiet/musician_moving_to_mexico/",
        "permalink": "https://reddit.com/r/mexicoexpats/comments/11ckiet/musician_moving_to_mexico/",
        "selftext": "Edit: Forgot to say hello. Hello!\n\nPlanning a move to Mexico, and trying to narrow down a location. Budget is about $1000/month + occasional/emergency expenses. I'm working on my Spanish, which is currently \"survival\" level (asking for directions, paying for stuff, ordering food, small talk), and want to eventually become fluent. I am a musician, and want to rent a place that will allow me to play music (sometimes loud), eat, sleep, shower, and have internet access, with a minimum of 10\\^2 meters of living space not including the bathroom. Loud neighbors don't bother me at all. At any given time I might be doing something as loud as playing a drum kit, but usually quieter than that. I don't have any expensive habits, and am fine with any kind of local food or cooking at home.\n\nMexico is a big place, so I'm sure there are lots of places that would fit this bill. Access to an expat community would be great, but I also want to be able to learn and enjoy the local culture.\n\nVery interested in hearing your case for one town/city or another. This will help me narrow my research. I've heard great things about so many places!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.86,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    }
   
]