[
    {
      "id": "15o7v1b",
      "title": "I130 living with husband in Mexico, and online application",
      "score": 1,
      "num_comments": 1,
      "author": "Spirited-Motor-6110",
      "created_utc": 1691757640.0,
      "created_readable_utc": "2023-08-11 12:40:40 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/15o7v1b/i130_living_with_husband_in_mexico_and_online/",
      "permalink": "https://reddit.com/r/USCIS/comments/15o7v1b/i130_living_with_husband_in_mexico_and_online/",
      "selftext": "Good Morning,\n      First thank you to this community - I’ve already learned so much, I just wanted to share where we have started and get some feedback.\n      I am from the US (citizen/born) and have been a resident in Mexico for 3 years (official resident).  I work for an airline, and I met my husband in December 2021.  We married in June ‘23 and applied for I130 in July 3,2023. I know we will have a year or so wait, but that’s expected .  We live with his parents in Mexico City,\nWhen I applied I used the online systems , it was pretty straight forward processed although I did notice it populated address dates a little weird when I clicked the electronic filed version of the i130. I expected it may have been an issue , so before I submitted I included an explanation of how I own a home in Mexico and the USA and commute between the countries and clarified we live together in Mexico City. \n    He is a doctor here, and luckily my routes with my job give me layovers here in Mexico City .  When it came to evidence I threw everything but the kitchen sink at them, including not only photos, and letters all the usual but copies of him being the beneficiary on everything from my life insurance to my 401k and will. He has very little so there isn’t much he could submit , but  I am blessed to know that he will be taken care of if something happens to me. I even submitted a translated letter from the Mexican Government Institute of Nacional Migration (USCIS Mexican equivalent), that acknowledged that my civil status changed from single to married to a Mexican National. I even documented every single flight for work and flight for commuting and pleasure to Mexico City . Literally hundreds. We even went to the US consulate here in Mexico City and swore an affidavit from my company that we are domestic partners  so he may enjoy some of my flight benefits .\n   I intend to continue to update photos documents and evidence each month as they allow it on the website (USCIS). I will be moving back to USA in spring or fall of 2024 at the latest so there may be a time when we are separated but we are doing everything we can to avoid any pitfalls. I am going to finish nursing school. \n  I have read so many amazing storied on here, and hope to join the many successes. We did not use an attorney but plan to tap one if need be. The I130 with consular processing has really turned out to be the best option for us , because he can continue to work here and I can be here, I really look forward to bringing him home and he can begin the process of becoming a physician in the USA.\n Neither of us have any criminal records and he’s never been to the USA thus no immigration issues. \nWhen we got married Mexico City did put my last name as the name on my birth certificate , but I was married and got a divorce before (to a US citizen) so I have a hyphenated last name now. So I had to get my previous marriage license apostilled and translated into Spanish so CDMX can correct it , and I will submit that to USCIS. I’m trying to think of everything possible to avoid any issues. \n\nSo what do you think ? Any comments and questions are welcome. THANK YOU again for sharing your happiness and heart aches, we’re all in this together.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "I-130 (Standalone)",
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": "Mexico City"
      },
      "sex": "Mujer",
      "document": "I-130"
    },
    {
      "id": "15noy7s",
      "title": "Help - fastest way for Mexican National to enter US? Her husband is in critical condition.",
      "score": 6,
      "num_comments": 7,
      "author": "Kaizen777",
      "created_utc": 1691702804.0,
      "created_readable_utc": "2023-08-10 21:26:44 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/15noy7s/help_fastest_way_for_mexican_national_to_enter_us/",
      "permalink": "https://reddit.com/r/USCIS/comments/15noy7s/help_fastest_way_for_mexican_national_to_enter_us/",
      "selftext": "Hi!  My g/f's aunt is a citizen of Mexico.  She just found out her husband is hospitalized in critical condition.  What's the fastest way she can legally enter given the circumstances?  Is it humanitarian parole?  What's the fastest this can happen?  My g/f seems to think she can bring evidence of her husband's condition to the border and be admitted.  I don't think so!    \nAgain he's in critical condition and the prognosis is not good.  Thank you!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "NIV (Visitor)",
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": null,
      "document": "humanitarian parole / proof of condition"
    },
    {
      "id": "15hqnfs",
      "title": "Permanent Address",
      "score": 1,
      "num_comments": 8,
      "author": "Fearless_Original520",
      "created_utc": 1691125439.0,
      "created_readable_utc": "2023-08-04 05:03:59 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/15hqnfs/permanent_address/",
      "permalink": "https://reddit.com/r/USCIS/comments/15hqnfs/permanent_address/",
      "selftext": "Is it big of an issue if the permanent address mentioned in birth certificate differs from the permanent address given in the passport?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "Passport Support",
      "us_president": "Joe Biden",
      "location": null,
      "sex": null,
      "document": "birth certificate / passport"
    },
    {
      "id": "12rgq6e",
      "title": "Are some of you guys who are filing for a spouse outside the US currently separated or living in your spouses country?",
      "score": 6,
      "num_comments": 8,
      "author": "Difficult-Ad-9789",
      "created_utc": 1681878503.0,
      "created_readable_utc": "2023-04-19 04:28:23 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/12rgq6e/are_some_of_you_guys_who_are_filing_for_a_spouse/",
      "permalink": "https://reddit.com/r/USCIS/comments/12rgq6e/are_some_of_you_guys_who_are_filing_for_a_spouse/",
      "selftext": "I (US citizen) am currently filing for my husband whose from Mexico we have a 7 month old baby and I recently returned to the Us because our lawyer recommended that I go back to the USA to work and have bills in my name to prove to Uscis that I’ve been I guess residing in the Usa because supposedly me staying with my husband and not working would likely get my case denied. However I’ve seen many people living with their spouses in their home country waiting for their cases and was wondering if anybody here is currently waiting with their spouses in their home country and if you’ve been told something similar. Lately being separated has really gotten to me and him and I’m considering just going back to Mexico with my baby and waiting it out there with my husband and hopefully with a additional sponser our case would be okay. He’s already missed the birth and the first three months of her life I don’t want him to miss the next one or even two years of her life.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "I-130 (Standalone)",
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Mujer",
      "document": "I-130 / proof of domicile"
    },
    {
      "id": "1285i2z",
      "title": "Birth of U.S Citizen Abroad",
      "score": 2,
      "num_comments": 9,
      "author": "12kaboom",
      "created_utc": 1680308868.0,
      "created_readable_utc": "2023-04-01 00:27:48 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/1285i2z/birth_of_us_citizen_abroad/",
      "permalink": "https://reddit.com/r/USCIS/comments/1285i2z/birth_of_us_citizen_abroad/",
      "selftext": "I am not sure exactly how to go about this question. My mother in law was born in Mexico. She went through the immigration process and became a US citizen in 1996.\n\nHowever, her biological mother was a US Citizen by birth (born in California). It would mean a lot more for my mother in law to have been a US citizen by birth, since she was born to an American.\n\nIs it possible to have her citizenship status changed? Even though, yes, she is a US citizen she would like to be considered legally as a US citizen by birth. It’s more of a “pride” thing. Can this be done?\n\nThanks in advance for any and all information, I appreciate it.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "USCIS Support",
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": null,
      "document": "Proof of US citizenship by birth"
    },
    {
      "id": "11hhlyo",
      "title": "Can I apply for a US passport?",
      "score": 0,
      "num_comments": 0,
      "author": "Practical-Card488",
      "created_utc": 1677883679.0,
      "created_readable_utc": "2023-03-03 22:47:59 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/11hhlyo/can_i_apply_for_a_us_passport/",
      "permalink": "https://reddit.com/r/USCIS/comments/11hhlyo/can_i_apply_for_a_us_passport/",
      "selftext": "I am currently in the US on a f1 visa. My mother was born in the US and lived here for more than 365 days but less than 5 years. Due to the supreme courts ruling of sessions vs morales Santana in 2017, there was confusion whether the new 5 year rule would be held in effect for me since I was born before 2017. Even lawyers have given different answers.. As far as I’ve read because I was born out of wedlock the 365 days should apply. Does anyone have some guidance on this - would be much appreciated! At this point I’m inclined to apply with my mothers birth certificate, my birth certificate and form ds5507 but not sure.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.33,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "Passport Support",
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "US passport / DS-5507 / birth certificates"
    },
    {
      "id": "za12wx",
      "title": "Any experts here? My wife needs some documentation for a job offer",
      "score": 1,
      "num_comments": 0,
      "author": "knoxcreole",
      "created_utc": 1669931522.0,
      "created_readable_utc": "2022-12-01 21:52:02 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/za12wx/any_experts_here_my_wife_needs_some_documentation/",
      "permalink": "https://reddit.com/r/USCIS/comments/za12wx/any_experts_here_my_wife_needs_some_documentation/",
      "selftext": "She's a permanent resident alien. She's lived here her whole life and has worked/paid taxes since 96. She got her right-to-work papers from the DHS but that isn't enough. She kept her social/green card together and lost them both. She put in for a new card back in June and she's still waiting (obv) for a replacement. Without her green card, she can't get her social. She's given every bit of info this job offer needed but they want to see a social security card. She got her father to find her birth certificate and he's sending that up. Are there any options for a temporary proof of social security card or anything we're missing here?\n\nThanks",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "Social Security Support",
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Hombre",
      "document": "Green Card (I-90) / Social Security Card / birth certificate"
    },
    {
      "id": "xv30tt",
      "title": "Strength of Physical Presence case",
      "score": 2,
      "num_comments": 0,
      "author": "SamuelTheKitty",
      "created_utc": 1664850957.0,
      "created_readable_utc": "2022-10-04 02:35:57 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/xv30tt/strength_of_physical_presence_case/",
      "permalink": "https://reddit.com/r/USCIS/comments/xv30tt/strength_of_physical_presence_case/",
      "selftext": "Hello r/USCIS,\n\nI am assembling a citizenship claim for my spouse under INA 309 (c), for which I need to demonstrate continuous physical presence of her mother (deceased) for one year any time prior to my spouse's birth.\n\nI have largely assembled the case, believe I have met the required burden of proof, and am preparing to submit it to the Consulate. That said, additional opinions as to if I have gathered enough evidence for physical presence would be helpful.\n\nThe transmitting US citizen parent (mother) spent the first seven years of her life in the USA. Given this young age, I have not been able to gather much in the way of direct evidence regarding the transmitting parent. However, I have established by way of subsequent birth certificates and a tax lien document the physical presence the transmitting parent's mother over a period of time.\n\nThe best evidence I have are documentation of the divorce proceedings of the transmitting parent's parents. The first document, dated October 1966 is an interlocutory judgement of divorce which names the transmitting parent, and orders her into the \"care, custody, and control\" of her mother. The second document, dated September 1967 is a final judgement of divorce and reaffirms the custody of the transmitting parent to the mother. The final document, dated August 1967, is a modification of the final judgement of divorce. It outlines the current circumstances of the two parents (including the living arrangements of the transmitting parent and her mother, and the fact that her mother could not obtain employment due to caring for the children), indicates neither parent are in violation any previous judgements, and grants custody of the transmitting parent to the father.  \n\n\nGiven these are court documents that outline that the transmitting parent was in the custody of an individual who was clearly present in the USA over two year period, in addition to the pattern of evidence of physical presence leading up to these events, I believe this is pretty strong evidence. Am I correct in this assessment? I understand that the standard of proof in this case is the preponderance of the evidence. Considering that fact, I can't fathom how that burden hasn't been met, but I'm willing to be told otherwise in which case, I will attempt to gather more evidence.\n\nThank!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "USCIS Support",
      "us_president": "Joe Biden",
      "location": null,
      "sex": "Hombre",
      "document": "Proof of physical presence / citizenship claim documents (birth certificates, court records)"
    },
    {
      "id": "wrzqox",
      "title": "CRBA application still under processing after passport was issued for the baby",
      "score": 2,
      "num_comments": 9,
      "author": "Subject_Ad_927",
      "created_utc": 1660869547.0,
      "created_readable_utc": "2022-08-19 00:39:07 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
      "permalink": "https://reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
      "selftext": "I am a U.S citizen by Naturalization and my wife is not. My wife gave birth to our second child in May 2022 in Mexico as we are still waiting for her I-130 approval(my wife). I filed out the application for CRBA online and choosed Mexico city as interview location, made the payment online. Few days later I received an email from U.S Embassy in Mexico city with interview appointment date scheduled in August(application was filled  in May), I tried to get earlier appointment but they told me that there is no earlier appointment that I can try to see if other consulate have opening , I checked the online system and we were lucky to find May 26 appointment at the U.S consulate in Merida.Scheduled another interview and asked Merida to request that Mexico city transferred our online application to Merida, they did and we went for the interview with all documents, officer at the interview told us that everything was fine and we request for an emergency passport for our daughter, the U.S passport was issued the same day, officer told us that our approved documents will be transferred to Mexico city for them to issue the CRBA since the online payment was made to them. In July I received email from U.S embassy in Mexico city asking for more proof of presence in the U.S, I sent 6 years of my credit card bills and also my bank statement as requested, few days later they contacted me and ask for more proof like travel history, I sent them record from the CBP with travel record from 2011-2021 (that was what FOIA/CBP sent me) Yesterday I received a call from them again that the assistant consul still need more documents but they did not say which documents. My question is, is this normal? My daughter already have a U.S emergency passport issued by the U.S consulate in Merida Mexico and valid for 1year, can the officer at the U.S embassy in Mexico city denied my daughter's CRBA application even though she already have a U.S passport? I got my citizenship last year and I travel on business trips from time to time but maintain physical presence in the U.S.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "Passport Support",
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": "Hombre",
      "document": "CRBA / Passport / proof of physical presence"
    },
    {
      "id": "wetoim",
      "title": "Im a US citizen my gf is from Mexico can me and my gf get married on her tourist visa here if there's no intent to stay afterwards I plan to go to mexico after anyways and stay there. it's just easier to get married here because in mexico they require birth certificate and mine has a patronymic nam",
      "score": 1,
      "num_comments": 10,
      "author": "Cold_Ad5055",
      "created_utc": 1659491552.0,
      "created_readable_utc": "2022-08-03 01:52:32 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/wetoim/im_a_us_citizen_my_gf_is_from_mexico_can_me_and/",
      "permalink": "https://reddit.com/r/USCIS/comments/wetoim/im_a_us_citizen_my_gf_is_from_mexico_can_me_and/",
      "selftext": "Im a US citizen my gf is from Mexico  can me and my gf get married on her tourist visa here if there's no intent to stay afterwards I plan to go to mexico after anyways and stay there. it's just easier to get married here because in mexico they require birth certificate and mine has a patronymic name in it so it's better we get married here and I'll just go to Mexico after , there no intent to get her a green card here , she'll leave right after we get married \n\nis that ok?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.67,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "Timeline Request",
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Hombre",
      "document": "Marriage certificate / birth certificate / tourist visa"
    },
    {
      "id": "w8y74y",
      "title": "Do I fill out the N-600 or N-400 form?",
      "score": 2,
      "num_comments": 2,
      "author": "machinaOverlord",
      "created_utc": 1658877189.0,
      "created_readable_utc": "2022-07-26 23:13:09 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/w8y74y/do_i_fill_out_the_n600_or_n400_form/",
      "permalink": "https://reddit.com/r/USCIS/comments/w8y74y/do_i_fill_out_the_n600_or_n400_form/",
      "selftext": "My deceased biological dad is an American citizen, met my mom in another country and got married there and given birth to me. I lived in my birth country for a while with its citizenship before moving to the US with a permanent residency status. After my biological dad died of a heart attack, my mom met someone else here in the US and is also an american citizen.\n\nShould I fill out the N-600 form or the N-400 form since N-600 form says that \" you were born outside the United States to a U.S. citizen parent\" However, there was also a point that says \"You must be living in the United States in the legal and physical custody of your U.S. citizen parent\". Does the \"U.S citizen parent\" meant that I must be living with my biological dad or it doesn't matter? Also, I am an adult now, does that change anything?\n\nI saw the application fee to be over 1k so I wanted to make sure that I am right before continuing on. Thank you for any help!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.76,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "N-600 (Citizenship)",
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "N-600 / N-400"
    },
    {
      "id": "uut756",
      "title": "Consular Record of Birth Abroad and Passport",
      "score": 3,
      "num_comments": 2,
      "author": "Snoo-94705",
      "created_utc": 1653158324.0,
      "created_readable_utc": "2022-05-21 18:38:44 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
      "permalink": "https://reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
      "selftext": "I've been trying to schedule an appointment for a CRBA and passport for my daughter for months now.\n\nEvery time that I go the appointment scheduling [link](https://evisaforms.state.gov/Instructions/ACSSchedulingSystem.asp) for the U.S. Consulate General in Tijuana, Mexico, there are no available slots.\n\nBecause of this, I have not been able to bring her into the U.S. since her birth more than seven months ago.  I am having to constantly travel between Chicago and Tijuana to be able to see my daughter.\n\nI have all documentation ready and on hand and I would like to see if I can get the process started as soon as possible.  Any ideas?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "Passport Support",
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": "Tijuana"
      },
      "sex": null,
      "document": "CRBA / Passport"
    },
    {
      "id": "us4hqx",
      "title": "I need help with an apostille living abroad.",
      "score": 2,
      "num_comments": 1,
      "author": "Thaidakelsier",
      "created_utc": 1652847225.0,
      "created_readable_utc": "2022-05-18 04:13:45 UTC",
      "url": "https://www.reddit.com/r/USCIS/comments/us4hqx/i_need_help_with_an_apostille_living_abroad/",
      "permalink": "https://reddit.com/r/USCIS/comments/us4hqx/i_need_help_with_an_apostille_living_abroad/",
      "selftext": "I plan on getting married in Mexico with my GF (She is Mexican) but apparently I need to apostille my Consular report of birth abroad ( I was born in Tijuana, México. My dad was American, that's how I got the citizenship) Any idea of how I can get it apostilled? I would appreciate any advice,  I'm a bit lost because of my specific situation.\n\nGreetings\n\nP.S. Living in Mexico city ATM.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": "Self Post",
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": "Mexico City"
      },
      "sex": null,
      "document": "Apostille / CRBA"
    }
  ]