[

    {
        "id": "1jzay4w",
        "title": "Denied Passport at Post Office — Derivative Citizenship Confusion, Need Help",
        "score": 0,
        "num_comments": 6,
        "author": "BrokeKartel",
        "created_utc": 1744667127.0,
        "created_readable_utc": "2025-04-14 21:45:27 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jzay4w/denied_passport_at_post_office_derivative/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jzay4w/denied_passport_at_post_office_derivative/",
        "selftext": "I was brought to the U.S. as a child and have been a lawful permanent resident since 1993. My father became a U.S. citizen before I turned 18, and I was living with him at the time. Based on what I’ve read about **derivative citizenship under INA §320**, I should already be a U.S. citizen.\n\nI went to the post office recently to apply for a U.S. passport, but they told me I needed a **Certificate of Citizenship (N-600)** or naturalization certificate to prove my citizenship. I explained that I derived citizenship through my dad when I was a minor, but they said they couldn't process my application without official proof from USCIS. She looked at me and was like you were supposed to do this back then. Not now. I figured the post office would not be helpful in this matter. I then called the passport agency but they are telling me I need to provide an itinerary that I am going somewhere internationally before I get an appointment and also made mention of me needing my parents wedding certificate which I cant get. They were married in Mexico back in 83. \n\nI have the following 1. Dads naturalization certificate 2. 4 notarized affidavits that I was living with him one being from him. 3. my expired resident alien card at that time 4. my birth certificate 5. current state ID 6. The passport application itself. \n\n\n\n* Should I just go ahead and file Form **N-600** with USCIS?\n* Has anyone else successfully gotten a passport approved **without** the N-600 (maybe through affidavits or with the right documents)?\n* Is it worth hiring a lawyer for this, or can I handle it myself if I have the documents?\n\nAny insight or shared experiences would be really appreciated. I just want to get this resolved the right way.\n\nThanks in advance 🙏🏼",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

    {
        "id": "1iyu78i",
        "title": "FOIA request for US entry as toddler 30 years ago",
        "score": 4,
        "num_comments": 19,
        "author": "scotch_please",
        "created_utc": 1740593858.0,
        "created_readable_utc": "2025-02-26 18:17:38 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1iyu78i/foia_request_for_us_entry_as_toddler_30_years_ago/",
        "permalink": "https://reddit.com/r/USCIS/comments/1iyu78i/foia_request_for_us_entry_as_toddler_30_years_ago/",
        "selftext": "TL;DR My father immigrated to the US, obtained a green card and then my mom came over with me in the early '90s. Both parents eventually got naturalized and because I was under 18 when that happened, I derived citizenship. My parents were told the expensive N600 wasn't necessary to file since it was just a proof document. They got me a passport instead, which I've renewed since then.\n\nFast forward to today, I'm learning that the government requires a Certificate of Citizenship for certain security clearances and doesn't accept a US Passport as proof for foreign born US citizens, so I'm preparing to file the N-600. **Where do I get my port-of-entry and A-number info?**\n\nThe form asks for the entry date and the document number for my entry. My mom vaguely remembers my name and picture was on her foreign passport and the visa doc, which was allowed back then instead of needing a separate passport for your toddler. But the entry documentation is long gone. I also do not know my A-number or if I even had one. Did minors under 6 get green cards in the late '90s? If I had one, it was turned in once I was given my US passport and my parents don't have a photocopy. \n\nI don't want to request my entire A-file because I'm reading it can take over 6 months. Can someone tell me which files or documents I should request for entry details and whether that should be under my name, or will I have to do the same pull on my mom? Should I be requesting this info from CBP instead? Will my A-number be on anything I request from USCIS? I'm hoping all of this won't matter since I'll be including my US passport info but I don't want to skip anything and get RFE'd.\n\nThe other concern I have is both my parents' Naturalization Certs list them as divorced and my original birth certificate is missing. I found a photocopy of my foreign BC and the original translation that was stamped/certified. The translation clearly has both my parents' names on it, and I have a copy of their divorce decree. Unfortunately it doesn't seem to name me directly in it. Should I collect grade school transcripts to submit as proof of physical custody?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.76,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    {
        "id": "1itw6rz",
        "title": "Denied U.S. Passport| Was My Rejection Justified",
        "score": 0,
        "num_comments": 17,
        "author": "junhoonbrainrot",
        "created_utc": 1740050188.0,
        "created_readable_utc": "2025-02-20 11:16:28 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1itw6rz/denied_us_passport_was_my_rejection_justified/",
        "permalink": "https://reddit.com/r/USCIS/comments/1itw6rz/denied_us_passport_was_my_rejection_justified/",
        "selftext": "Hey everyone,\n\nI went for my passport appointment  at the embassy, but my application was outright rejected without proper review. They told me I’m not eligible to apply directly and that my father must first file an immigrant petition (I-130) and get me a green card since I was born before he became a U.S. citizen.\n\nI wasn’t even given a chance to submit any evidence—they just dismissed my application immediately. From what I understand, some people in similar situations have been able to apply directly. Was the embassy correct in rejecting me outright, or should they have processed my case differently?\n\nWould really appreciate any insights from anyone who has gone through something similar!\n\nEDIT: I'm sorry I didn't include the details in this post earlier. So my father naturalized after my birth and I visited U.S. on an I-551 visa before I turned 18 and lived there for some time under the legal and physical custody of my dad. For some reasons my dad dragged the passport application and now that I'm an adult I applied for one myself but I'm so heartbroken that without even reviewing evidence they outright rejected my application. \n\nThank you,",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.31,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1itjrxq",
        "title": "N400 Application - Incorrect DOB on birth certificate, NBC Service Center",
        "score": 1,
        "num_comments": 1,
        "author": "Freebird0429",
        "created_utc": 1740007085.0,
        "created_readable_utc": "2025-02-19 23:18:05 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1itjrxq/n400_application_incorrect_dob_on_birth/",
        "permalink": "https://reddit.com/r/USCIS/comments/1itjrxq/n400_application_incorrect_dob_on_birth/",
        "selftext": "I've got a little dilemma here which I hope somebody can help to clarify.  \nI'm a Syrian national who's resided my entire life in Europe. I went through my GC application in Europe through my parent who's an American citizen. I was less than 21 years old when all this started, so I was placed in that category.  \nNow, advance the story to this January—I had submitted my N-400 (citizenship), and I had done a bit of research and observed that my birth certificate and status of entry into civil life have an error. It has provided my date of birth as 30/05, whereas in reality it would be 30/04. Now, my passport, GC, and driving license all have the correct date (30/04), so that's okay—only the birth certificate and civil entry status.  \nI’ve reached out to several lawyers for advice, and I’ve gotten mixed responses. Some say, “It’s no big deal, it’s just a clerical error—carry on!” while others are warning that it could be an issue because USCIS typically follows the birth certificate and advising me to withdraw my N-400.  \nThis is the catch—I know that when my parent had applied for me, they have applied on the correct date (30/04). Given the current state in Syria, it cannot be changed from, and I have no one who can help me there.  \nHas anyone ever experienced the same issue? Some people have had it reversed, having the incorrect passport but the correct birth certificate. Do I just go ahead and follow through with my application, or do I withdraw it so I don't give myself a headache later on? Any advice from people who've gone through the same would be much appreciated!  \nThanks in advance for all help.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-400 (Citizenship)"
    },

    {
        "id": "1imhufm",
        "title": "Ina 321 a 3 US Citizenship through American Born Mother and in her custody",
        "score": 1,
        "num_comments": 1,
        "author": "Future-Mention-7041",
        "created_utc": 1739223422.0,
        "created_readable_utc": "2025-02-10 21:37:02 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1imhufm/ina_321_a_3_us_citizenship_through_american_born/",
        "permalink": "https://reddit.com/r/USCIS/comments/1imhufm/ina_321_a_3_us_citizenship_through_american_born/",
        "selftext": "Hi, I’m new here. Question: how can I get someone to help me fight my US Citizenship? I’m 47 yrs old mother was born in USA. I was born in Mexico. Mother was 16 years old at the time and married to my alien father who received permanent residence two weeks after my birth and I received my lpr two months after my birth and crossed through port of entry San Ysidro CA. Parents divorced when I was 4 yrs old and in American born mothers custody with visitation rights to father. Do I qualify for INA 321 (a) (3) ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

  
    {
        "id": "1i8bpzv",
        "title": "Adult CRBA and US Passport Application",
        "score": 1,
        "num_comments": 9,
        "author": "MoodImportant",
        "created_utc": 1737660571.0,
        "created_readable_utc": "2025-01-23 19:29:31 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i8bpzv/adult_crba_and_us_passport_application/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i8bpzv/adult_crba_and_us_passport_application/",
        "selftext": "Hello everyone,\n\nI’m in the process of preparing for my Adult CRBA (Consular Report of Birth Abroad) and (1st time) US passport request appointment and I’m hoping to get some advice from those who have gone through the process, especially with a situation like mine.\n\nHere’s some background:\n\n- I was born on December 31, 1989, in Honduras, to a US citizen father and honduran national mother.\n- Born out of wedlock\n- My father passed away in 2005, so I am wondering how this might affect the documentation process. (In terms of the applications I should fill out. e.g: DS-5507)\n- I was legitimated under Honduran law by both of my parents.\n\nCan anyone share what documents I should absolutely bring with me for the appointment? I have the following:\n\n- Birth and death certificate of my father\n- Military record (only given to me in digital by NARA)\n- Honduran birth certificate\n- Legal document with a permit to travel with my father\n- Pictures (mostly after being born)\n\nAlso, if there’s anything you wish you knew beforehand or things that were unexpected during your appointment, I’d really appreciate hearing about it.\n\nTIA for your help!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family"
    },
    

    {
        "id": "1i2ihqs",
        "title": "How to get U.S passport through born citizen parent?",
        "score": 0,
        "num_comments": 12,
        "author": "Rezlyyy",
        "created_utc": 1737007545.0,
        "created_readable_utc": "2025-01-16 06:05:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "selftext": "Brief summary, I am almost 24, I was born in Mexico in 2001, to a born U.S citizen father and a Mexican mother who were not married at the time, married couple years later, and I did NOT get a Consular Report of Birth Abroad (CRBA).\n\nMy dad was born in the U.S but stayed in Mexico until he was about 25 ish, then they married and he got my mom and I green cards and we moved to the U.S, I was 7 at the time. I’ve been living here ever since. \n\nThey ended up separating when I was around 12, but did NOT divorce, they are still technically married.\n\nSome immigration services recommend naturalization, some people I’ve talked to recommend getting a passport as I should have the right to get citizenship through my dad. \n\nWhat documents would I need to get a U.S passport through my dad? \n\n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },

 

    {
        "id": "1hsxk8o",
        "title": "N600 - Notice of Intent to Deny... ",
        "score": 1,
        "num_comments": 23,
        "author": "DisastrousStudent764",
        "created_utc": 1735939697.0,
        "created_readable_utc": "2025-01-03 21:28:17 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hsxk8o/n600_notice_of_intent_to_deny/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hsxk8o/n600_notice_of_intent_to_deny/",
        "selftext": "Maybe it's the universe's way of testing me this 2025, but I just received a NOID from USCIS regarding my N-600. It's a long letter detailing why all the secondary evidence I submitted is not good enough to prove my mother resided in the U.S. for a cumulative of 5 years prior to my birth in 1999. And it says I have 30 days to submit either more evidence or a rebuttal.\n\nThe matter is, I have exhausted all possible evidence, so that is not an option. It took me a year to put together the evidence that I did submit, working with a private investigator, estranged relatives, and doing my own research. I was told by two lawyers that the evidence I submitted was pretty good. but even if I spent another year looking for evidence, I would not find a thing... so, I have to write a rebuttal.\n\nMy question here is about this rebuttal--does anyone have any advice for this? Would this rebuttal letter have to be in legalese, or written for emotional appeal? Do I tell them that it was extremely difficult to produce the evidence I did submit, given that it was from 1981-1986? Do I tell them how desperate I am to be able to build a future in the U.S., where I've lived for 15 years? I'm at an utter loss here so my suggestions might be ignorant. ANY advice will be sincerely appreciated. I have 30 days...\n\nThank you. Happy new year to all.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

    {
        "id": "1hoq0uw",
        "title": "❓ Clarification on Eligibility Category for N-600K Application for My Child\n\n",
        "score": 1,
        "num_comments": 2,
        "author": "Weary-Resolve4746",
        "created_utc": 1735453576.0,
        "created_readable_utc": "2024-12-29 06:26:16 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hoq0uw/clarification_on_eligibility_category_for_n600k/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hoq0uw/clarification_on_eligibility_category_for_n600k/",
        "selftext": "Hello, I’m seeking clarification on selecting the **appropriate eligibility category in Part 1 of Form N-600K** for my child.\n\n**🧒 Child's Background:**\n\n* My daughter is **under 18 years old**.\n\n**👩 Parent's Background (Me):**\n\n* I am a **U.S. citizen by birth**.\n* However, I **have not met the physical presence requirement** to transmit citizenship to my child.\n\n**👴 Grandparent's Background (My Father):**\n\n* My **father (the child’s grandfather)** is a **U.S. citizen**.\n* He **has fulfilled the physical presence requirement** by residing in the United States for **at least five years**.\n\n**❓ My Question:**  \nGiven these circumstances, which option should I select in **Part 1 of Form N-600K**?  \n1️⃣ The **biological child** of a qualifying U.S. citizen parent.  \n2️⃣ The **adopted child** of a qualifying U.S. citizen parent.  \n3️⃣ The **grandchild** of a qualifying U.S. citizen grandparent.\n\nI would greatly appreciate any guidance, advice, or insights from those who have experience with similar cases or expertise in this process.\n\nThank you in advance for your help! 🙏\n\n**📌 Posting Tips:**\n\n* Use a flair such as **Question** or **Advice Needed** if available.\n* Consider posting in relevant subreddits like r/USCIS or r/immigration.\n* Engage with comments and provide clarifications if needed.\n\nLet me know if you’d like further adjustments or suggestions for a specific subreddit! 🚀",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },

    {
        "id": "1hnjtb8",
        "title": "I just got married in Mexico ",
        "score": 4,
        "num_comments": 2,
        "author": "Alone_Asparagus7651",
        "created_utc": 1735320058.0,
        "created_readable_utc": "2024-12-27 17:20:58 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hnjtb8/i_just_got_married_in_mexico/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hnjtb8/i_just_got_married_in_mexico/",
        "selftext": "My wife has two kids and I am wanting to move them to the US. I am going to bring the marriage certificate and birth certificates and apostille with me is there anything else I need to get while I am in Mexico? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.76,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Biometrics"
    },

    {
        "id": "1hlok90",
        "title": "Birth Outside of the US",
        "score": 2,
        "num_comments": 9,
        "author": "Jen_arwin55",
        "created_utc": 1735081067.0,
        "created_readable_utc": "2024-12-24 22:57:47 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hlok90/birth_outside_of_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hlok90/birth_outside_of_the_us/",
        "selftext": "Hello, I wanted to know if anyone has given birth outside of the US? More specifically in the Philippines? \nI wanted to give birth there, but before I do what are the requirements to be able to bring back my baby with me to the US? As a green card holder? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "CBP Support"
    },


    {
        "id": "1hjczlr",
        "title": "N-400 LA Field Office - Naturalization and Citizenship",
        "score": 13,
        "num_comments": 18,
        "author": "LeeisureTime",
        "created_utc": 1734797576.0,
        "created_readable_utc": "2024-12-21 16:12:56 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hjczlr/n400_la_field_office_naturalization_and/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hjczlr/n400_la_field_office_naturalization_and/",
        "selftext": "So I lurked on this sub to find out everything I could about the appointment for my wife to finally naturalize. I found so many informative posts I wanted to leave one for someone else, so here goes.\n\nWe applied for her citizenship this September. At first, the waiting time was 6 months so we expected no movement until next year. All of a sudden, a bunch of things started happening, and suddenly we're in November and she has an appointment 30 days later. We received notification that her appointment was set for today, 12/20 and boy, were we happy. Unfortunately, we had a cruise that we were going on and it arrived in the port of LA the morning of the 20th (I know, insane). But her appointment was 12:30pm so we decided to risk it and went anyway (it was awesome, and there was a moment when she said to me, \"Hey, I think this might be the last time I ever use my green card!\").\n\nLuckily no delays so we had plenty of time to get off our cruise, get some breakfast, do some last minute cramming, and then head over the LA Field Office near Little Tokyo. For those who are not familiar, the LA FO (field office) has no public parking, so you either gotta get lucky on the street or find a parking lot nearby, and the two largest ones were under construction so they were closed. We ended up parking in the lot directly across from the field office at the Los Angeles mall (but there are a TON of homeless and the place reeks). The parking itself is fine, $17 max. And given how long we were stuck at the Field Office, we just ended up paying the max, lol.\n\nWe crossed the street and there are two entrances, one with a red barrier - we went there first and the guard told us we needed to go around the corner to the black barrier.\n\nWe got the barrier and they asked to see our appointment letter, then asked us if we had any bombs, explosives, weapons, drugs, etc (just like at the airport). We went through security and then got directed to the 8th floor.\n\nFrom there, we went to suite 8024, where we checked in before when we got her permanent green card. No picture this time, they just checked our letter, then told us to go out to suite 8054.\n\nAbout 10 people in total were waiting, one couple was practicing the 100 questions so we sat in the back away from them. We got there at 11:50 for her 12:30pm appointment and nobody told us how long the wait would be. We were just told to sit and wait for our names to be called, but nobody's name got called for a good hour. There are NO vending machines in that building, so if you get there early, bring water and a snack. The second floor has a cafeteria, if you really want something. We brought our own water.\n\nFinally, around 1:30pm, her name gets called and she asks if I can go in with her. Guy is super nice, asks to see her appointment letter, and lets me go with her. I heard stories about a mean Latino lady, so I figure we were in the clear. I dunno if she's mean or just nitpicky, either way, we didn't bump into her. Our guy was named John and he was so friendly and kind.\n\nHe did let me know that I was there as a courtesy, so I couldn't answer questions and I needed to be silent. He started out with a little small talk, like how was the wait, etc. Then we got into it.\n\nFirst he asked her about her name, birthdate, etc (information to confirm she is who she says she is). We brought her appointment letter, her green card, and her current passport (my wife is Taiwanese so she has a Taiwanese passport). We also brought my birth certificate (citizen by birth), our marriage license, and my passport. He did ask for her driver's license as well, so don't forget US government-issued ID, if you don't have a driver's license.\n\nThen he asked her to read a sentence, which was just one of the 100 questions: How many US Senators do we have? And then he had her write a sentence, which was the answer: \"We have one hundred senators\" but she had to write out the numbers, not just use 100.\n\nThen we did the test, which was 6 questions and she thankfully nailed them all. I sadly don't remember because I was worried she would give goofy answers like she did when we were practicing (If the President and the Vice President cannot be president, who becomes the President? - ME! no, the Speaker of the House, stop saying that)\n\nWe moved onto the N400 and he asked some of the required questions like \"Have you ever been arrested for a crime, have you ever been part of the military or police\" etc. He didn't ask them all - I know this because we also went over the N400 just in case, so she wouldn't get tripped up by some of the weird wording. He then asked about her time outside of the US and she had the dates memorized, but he only asked if she spent 6 months or more outside the US.\n\nIn the end, she nailed everything, and when he asked if she was willing to become a US citizen, take up arms if necessary, serve in a noncombat role if necessary, etc, she answered correctly, and we were done! Holy shit, I felt so relieved, he had our file in front of him and it was at least 2 inches thick full of documents. Since she never committed any crimes, he said it does make it easier, also we had a ton of evidence so he wasn't concerned about our application and no red flags.\n\nThe only snag was she wanted to change her name (she doesn't have an English name so everyone mispronounces her name and she's fed up with 5 years of it lol, so she wanted an English name, her birth name, last time) but he said she wouldn't get to take the oath until at least March, maybe later. With the new administration coming in Jan 20th, we decided to just change her name later (despite how much of a hassle that will be!) and get her citizenship now.\n\nAn hour later, we had her certificate in hand! The guy who administered the oath said that Social Security now changes status automatically but he can't be sure (there is a question on the N400 that asks if you want them to do it for you). Other than that, same experience as others, but I was a little thrown by the oath timeline if you wanted a name change (could be because it's the end of the year, who knows).\n\nWe have to go to SSA on Monday and then apply for her passport, we couldn't today because it was late and we were tired. Hope this helps - edit, tried to post this last night but it didn't go through so I went to bed. Realized I needed a flair, so I added one, but I'm not going to go back and change everything from \"Today\" to \"yesterday\"",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.93,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-400 (Citizenship)"
    },
    {
        "id": "1hi7pqc",
        "title": "Biometrics appt and important gender question! ",
        "score": 1,
        "num_comments": 6,
        "author": "No_Understanding_353",
        "created_utc": 1734655315.0,
        "created_readable_utc": "2024-12-20 00:41:55 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hi7pqc/biometrics_appt_and_important_gender_question/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hi7pqc/biometrics_appt_and_important_gender_question/",
        "selftext": "Hello everyone! \n\nMy biometrics appointment is tomorrow and as \na trans man who has socially and physically transitioned to male, I was wondering if I can check the M box in the biometrics appt questionnaire.\n\nFor context, I’m applying under VAWA, green card for Amerisian, widower, etc. \nI heard the biometrics is to get your fingerprints to get your EAD. Before I petitioned for vawa, I was legally in the US under an F1 visa that had my gender as female, same with the EAD card that I was given during my year of work authorization.\n\nMy question is, is this data collecting appt like a new slate where I can mark the gender that best identifies me in the present time? \n\nMore context: I have a passport from my country of origin with my sex assigned at birth \n\nBut I also have my Maryland State license with my gender set as, Male. I was very relieved to find out at the MVA that I could choose whatever I wanted for my license. \n\nSo I guess I have an ID for both tomorrow. \n\nI’m just wondering if there will be hiccups with my process, which will already take a long time, if I sign off on everything as male in tomorrows appt. \n\nThank you in advance for helping me brainstorm the best course of action 😅",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Biometrics"
    },



    {
        "id": "1hde3st",
        "title": "Will an American passport be enough proof of citizenship for my upcoming interview?",
        "score": 3,
        "num_comments": 30,
        "author": "isekaid_villainess66",
        "created_utc": 1734102143.0,
        "created_readable_utc": "2024-12-13 15:02:23 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1hde3st/will_an_american_passport_be_enough_proof_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/1hde3st/will_an_american_passport_be_enough_proof_of/",
        "selftext": "\nHi everyone,\n\nI’m preparing for my citizenship interview scheduled for January, and I have a question regarding proof of citizenship for my husband.  Since I'm applying for naturalization as the spouse of a US citizen they need me to bring his birth or naturalization certificate or citizenship certificate but he became a U.S. citizen in when he was 2 in 1995 through his parents, but back then, they didn’t provide a separate certificate of citizenship for him. \n\nHe does have a U.S. passport, which I believe serves as proof of his citizenship. However, I want to confirm if this will be sufficient for my interview, given that he automatically acquired citizenship and doesn’t have a formal certificate.\n\nHas anyone been in a similar situation? Will his passport be accepted as proof of citizenship during my interview? Any advice or experiences would be greatly appreciated!\n\nThank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-400 (Citizenship)"
    },
  
    {
        "id": "1h9kd2k",
        "title": "DS-11 - Claiming Citizenship by Descent",
        "score": 1,
        "num_comments": 2,
        "author": "jaas543",
        "created_utc": 1733669282.0,
        "created_readable_utc": "2024-12-08 14:48:02 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1h9kd2k/ds11_claiming_citizenship_by_descent/",
        "permalink": "https://reddit.com/r/USCIS/comments/1h9kd2k/ds11_claiming_citizenship_by_descent/",
        "selftext": "Hello, \n\nI'd like some clarification on a requirement listed on this [gov page](https://travel.state.gov/content/travel/en/legal/travel-legal-considerations/us-citizenship/Acquisition-US-Citizenship-Child-Born-Abroad.html). I'm 22, born and residing in the UK,  claiming US citizenship & applying for my first US passport with my US citizen father. I was born in wedlock and my father has spent 30+ years in the US before my birth. \n\nWe're pretty much ready to head to the embassy. We've obtained proof of his presence in the US (college transcripts, IRS records), my identifications (my UK birth cert, current and expired UK passport), his identifications (US birth cert, US passport), marriage and marriage dissolution records, my passport photo, and some forms. \n\nAlthough, I'm unsure of one thing. The page I linked mentions: \n\n>*\"A child must also meet other requirements including:*\n\n>*i) At least one parent has a* [*genetic or gestational connection*](https://travel.state.gov/content/travel/en/legal/travel-legal-considerations/us-citizenship/US-Citizenship-DNA-Testing.html) *to the child*\n\n>*ii) Both parents in the marriage show a parental relationship with the child: Examples of this relationship include: medical, tax, educational, or other documents that show the individual has acted in a parental role\"*\n\nNowhere on this [UK US embassy page](https://uk.usembassy.gov/u-s-citizen-services/citizenship/claiming-u-s-citizenship-and-applying-for-your-first-u-s-passport-aged-18-or-over/) about claiming citizenship mentions obtaining evidence of point ii. It does cover point i:\n\n>*\"3) Evidence of parentage*\n\n>*Credible and substantial evidence of the blood relationship between yourself and your U.S. parent(s) is required in the form of a birth certificate.\"*\n\nI haven't obtained any evidence to show that both my parents have had a parental role with me. I would be able to get strong & conclusive evidence to that effect from before I turned 18, but it'd take a bit of time to obtain it, so I want to know if it's necessary. My thinking is that the first linked page is referring to children, and the second page is specific to over 18s. So, perhaps point ii isn't relevant to us given my age?\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },

    {
        "id": "1glflxy",
        "title": "So, what now? An immigration attorney perspective ",
        "score": 2902,
        "num_comments": 727,
        "author": "Honest-Grape-9352",
        "created_utc": 1730944876.0,
        "created_readable_utc": "2024-11-07 02:01:16 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1glflxy/so_what_now_an_immigration_attorney_perspective/",
        "permalink": "https://reddit.com/r/USCIS/comments/1glflxy/so_what_now_an_immigration_attorney_perspective/",
        "selftext": "(Before I begin, I kindly ask that I not be DM'd for consultations. I am happy to provide firm or probono recommendations via DM, but nothing more). \n\nHi all, \n\nUsing a throwaway. I have been lurking here for a while without commenting anything, but I feel like I need to give my two cents given the amount of posts on this sub. Excuse any typos or grammatical errors. I am typing this while I am highly caffeinated and dealing with my own caseload. \n\nFellow immigration attorneys, please correct me if I'm wrong on any points. If you're not a legal professional, I do not want to hear it. \n\nFinally, none of this is legal advice. Please always consult with an attorney before making any decisions on your specific case. \n\n\n**1. Will DACA be taken away?**\n\nRemember, nothing can be guaranteed. Genuinely, no one knows what will happen. \n\nI will say that in my opinion, likely no-- the economy makes way too much money from DACA folks. I do believe that they will dangle it like a carrot to appease right-wing voters. Major corporations employ DACAmented folks. The SSN from work permits have allowed more tax revenue to come in. Too much is at stake. Legally, the legal arguments at the courts surrounding DACA involve constitutional rights, which themselves aren't going anywhere anytime soon. It's honestly just a topic that is often talked about, but hardly understood by many. \n\n**2. What about I-131F PIP?**\n\nAs of today (11/7), this has been revoked. \n\n**3. Will the mass deportations actually happen? Is it actually feasible?**\n\nI want to put this into perspective. There are 11 million undocumented immigrants in the US. Currently, DHS has about 92,000 officers, and ICE has about 21,000 officers. It is asinine to try to achieve this. \n\nLet's say it actually does begin and people are getting rounded up. Guess what? Not all undocumented folks are just undocumented-- many have TPS, pending asylum applications, pending T/U Visas, and work permits (see my point regarding #1). Unless a migrant has an expedited removal (not likely), DHS/ICE still needs to process each deportee, assign them A#s, and follow basic procedures. If they don't? That's a very easy way to reverse a deportation order. It's the equivalent of convicting someone of murder using a confession made under a very obvious 4/5th amendment violation. Slam dunk case. \n\nOh, and you know who has to handle all of these deportation cases? Federal DHS attorneys. They're already overworked, and they tend to exercise discretion. If no discretion, the overworked ones tend to gloss over cases and provide weak arguments. Only major attention is paid to serious crimes. You'd be surprised the amount of times DHS attorneys have gotten my clients' names wrong or made procedurally embarrassing typos. \n\n**4. What about ICE roundups?**\n\nThey still happen. Still need to follow procedures. If not, lawsuits and lots of deportation reversals. \n\n**5. Will there be a plan to denaturalize? Is it actually feasible? What about birthright citizenship?**\n\nSee #1 and #3. \n\n**6. What is likely to happen coming January?**\n\nIMO, the end of prosecutorial discretion in deportation proceedings will likely happen immediately. This means that DHS attorneys will have to prosecute all cases. However, see my point for #3. \n\n**7. What will happen to my pending USCIS case? What will USCIS do now?**\n\nVaries. USCIS is highly understaffed right now, and the backlogs are ridiculous. My guess is that between now and December, there will be a push to try to get as many I-485/N400s adjudicated before January. This may result in fees increasing for future applications. \n\n**8. Should I try to file my [insert case here] with the USCIS?**\n\nI cannot answer this. I highly recommend an attorney. Unless your case involves a complex immigration history (think border apprehensions, previous deportations, court hearings or USCIS interviews), probono organizations may be able to take your case. \n\n**9. Can greencards be taken away?**\n\nGreencard refers to lawful permanent resident status (aka \"LPR\"). LPR status is given under a plethora amount of reasons-- each have their own statutory and common law requirements. Yes, theonewhoshallnotbenamed definitely enacted policies that made obtaining these harder, but not impossible. Again though, to take an LPR status, the USCIS is required to issue a Notice of Intent to Rescind, and it would allow you to argue your case. \n\nAgain, USCIS is backlogged. When backlogs continue, immigration attorneys threaten mandamus lawsuits. Who has to handle these? US Attorneys. Guess what they will try to do? Try to dismiss as quickly and easily as possible, bringing the process back to square one. What do lawyers hate (among many things)? Their success ratings going down. \n\n**10. I legit think that they're gonna throw the whole rulebook away and just try to remove DACA, deport people, and do whatever erratically.**\n\nThen we'll cross that bridge if we get to it. IMO, I never underestimated THAT ONE and his team. They are strategic and play the irrational and ludicrous card very well. Do I think they actually want to achieve the above? Definitely. However, I don't think it will come from the White House necessarily. They'll try to slowly change the social and political atmosphere, beginning at home. \n\nThis means that the revolution starts at home. It starts in how we educate ourselves and each other. It starts by breaking generational curses and preventing history from repeating itself. It means raising our children better. It means being in community. \n\n**11. I want to leave the US.**\n\nI can't blame you. I cannot give any information on this, and this is beyond the scope of this subreddit. \n\n**12. So, what now?**\n\nAs naive as it is for me to say, I think good always wins. The right is banking on your apathy, despair, and helplessness. \n\n**13. I'm glad that this is all happening. We need stricter immigration laws.**\n\nWhy are you in this sub? Let me know when you've joined the Olympics though, because the amount of mental gymnastics you are doing to justify your ignorance should be enough to give you a gold medal. \n\n\nEDIT: WOW. Lots of questions. I promise to try to get to as many as I can. I am but a mere attorney trying to meet his billable hours and trying to comfort my immigrant parents at the same time. \n\n\nEDIT #2: I'm adding some extra points that might help cover the general theme of questions I've been getting: \n\n\n\n**A. What about Operation Wetback?**\n\nCrackdowns and ICE sweeps are still happening. Furthermore, they gotta be processed still. This means that they need to be in detention centers while ICE gets the proper paperwork from the deportee's home country (or Mexico), set up transportation, and deport them. Yes, this includes if it's even in a sweep and go type of crackdown. \n\nI don't underestimate the vile nature of THAT ONE and what he wants to do, but I mention the facts as someone who is heavily involved in this legal work. \n\n\n**B. What will change with my [enter type of application]? Do you think orangeblob will change it?**\n\nNo law has changed. This includes statutory and common law. Your case will move forward as is unless told otherwise. \n\nIn terms of likelihood-- again, look at #1 and #3. They can dangle the hateful rhetoric as a carrot to right-wingers all they want, but money talks the most.\n\n\n**C. Will family petitions change? Employment?**\n\nThey didn't during 2017-2021. They very likely will not change here. Major corporations, especially tech ones, rely on employment-based petitions heavily. \n\n\n**D. Everyone said don't worry and things got worse years ago. I'm scared.**\n\nThis is exactly what they want you to feel. This is their goal. This is why I made my post. Let this fear and grief transmute into courage and motivation for a better world for all of us. Overall, it's not attorneys or people in fancy suits that make the most change. It's the community leaders, the librarians, the students, the homeless shelter managers, and the barbers that know the names of everyone on the block. Hope is not lost. \n\n**E. I came here the “right way,” so everyone should follow the law/it’s only “illegals” that have to worry/any other unoriginal variation**\n\nDM me for resources on how to have better empathy. \n\n\n**EDIT #3 (FINAL EDIT).**\n\nFew more frequently asked questions: \n\n**F. Why do you think there will be a push to adjudicate AOS/N400? Isn't USCIS understaffed?** \n\nIt happened post election in 2016. Pragmatically, it was probably because USCIS was expecting a large influx of applications come 2017. They decided to increase the fees, but they needed to give proper notice and time for people to file AOS/N400. Thus, leading to a mass influx of applications. \n\nAs for adjudication: N400s are the last hurdle for most folks, and they're generally not as difficult to adjudicate as other applications. It's another application officers can remove from their plate. Immediate relative based AOS or AOS based on current priority dates (without inadmissibility issues) are also generally easy to adjudicate. Yes, they are understaffed, but sometimes USCIS can shift focus briefly to some applications.\n\nWill all of this happen come 2025? That's the hope. My naive side wants to believe that USCIS wants to make as many people residents and citizens as quickly as possible. There were a numerous amount of natz approvals in my firm right before the election. My guess is that they wanted people to vote.\n\nNow, do I think CONSULAR ones will also get pushed? No clue. That didn’t happen 2017-2021. See Item G below. \n\n**G. What about I-130s with priority dates? What will happen now?**\n\nThis type of question is complex for several reasons. (1) I-130s are provided for all sorts of reasons, both family and employment based, (2) It depends on the type, the country, and the field office handling this case and (3) It also depends if consular processing will need to get involved. \n\nRight now, nothing has changed. This means that the priority dates on the visa bulletins are ones to look at. \n\nWhat a lot of immigration attorneys do is if there's a valid reason to expedite (most common being a family medical emergency back home), then they request it. If that doesn't work, a threat of a lawsuit sometimes helps. If not, then we file a mandamus. The key to doing all of this is for when the I-130 has been pending for longer than the processing times. Keep in mind that US Attorneys are not a fan of mandamus because they are contractually required to take these cases, so they try to dismiss as quickly as possible. This usually leads to the government agency making their decision on the case.  \n\nNow, if consular processing is involved: Each consular office operates on their own timeline and their own procedures. They hardly post these procedures. Guatemala takes about 6 months, and Peru takes about 2 years. Some attorneys also threaten to involve the courts for delays here, but consulates are controlled by the Department of State, making this a bit more challenging. \n\nNow, the burning question: will the above change? Pragmatically, overrunning and delaying the above is a poor financial decision, and money talks. You don't wanna mess with the golden nuggets of massive corporations. Can it happen though? Yes. Orangeblob did make the process slower for folks, and yes RFEs were issued annoyingly often. However, there is always room for argument and litigation, so not all hope is lost. \n\nWhat about priority dates? Will they change? Priority dates vary on visa type, availability, and country of origin. There could be delays, yes. No certainty just yet. \n\n**H. What about [insert student or business related visa]?** \n\nI unfortunately do not have experience in this field of immigration law. I cannot give a proper educated answer. \n\n**I. What about asylum? Title 42?**\n\nToo soon to tell. Asylum interviews are in a massive backlog at the moment. In 2018, when DV/gang based claims were slashed, many asylum offices tried to help by \"stalling\" their decisions. It put people in limbo, but there was at least no referrals to court or initiation of removal proceedings. Will that happen here? Maybe, but again, too soon to tell. \n\n**J. If ICE starts rounding people up, am I next? Can I get picked up? What if I have an upcoming court hearing? Will they deport me?**\n\nThere is generally a priority system for ICE. They tend to be: those with pending removal orders (especially if removal order was based on criminal conviction) or those convicted of deportable crimes. \n\nIf you have a criminal conviction, do not freak out. Not all convictions are deportable ones. This is a specific legal definition that is too complicated for me to type out. If you were charged after 2010, you must be provided with full legal advice of any immigration consequences of a potential conviction. \n\nHaving an upcoming court hearing (even via a CBP One appt) doesn't necessarily make you a priority. Some of those hearings may be for pending asylum cases and there are no crim issues. \n\nEven if you have a previous deportation order, there are still options and there are still ways to fight a deportation. \n\nIf you're still scared about being on a priority, think of this: A cop is doing speed checks on a 65mph speed limit freeway. There are a lot of cars on the freeway. Who is he likely to go after? Someone going 67, 75, or 90? Someone with a pending removal order (especially due to a serious criminal conviction) is much higher up there. Remember, if you fall under this category, there are options and there are ways to protect you. \n\n**K. But what if [insert scary scenario]? These are all just legal protections, and he wants to get rid of all of this. He's a fascist.** \n\nRemember, they are banking on your anxiety and uncertainty. The need for certainty and comfort during turbulent times is human nature. What is also human nature is innovation, the quest for justice, and community. Even if the worst comes to light, you have so many folks who are on your side and ready to fight for you (not just attorneys). \n\nHere is another metaphor I like to use: In the show Supernatural, Lucifer knew that Sam was going to give consent to take over his body. He had the whole timeline planned, down to the smallest detail. You know what he underestimated? Sam's love for his brother, Dean. Sure, Lucifer could predict human behavior, but he could never outsmart it. I say this here as well: don't underestimate the love that people have for one another. (also, the first five seasons in Supernatural were the superior ones, and I will immediately block anyone who tells me otherwise).\n\n**L. I messaged you requesting recommendations for nonprofit orgs and firms. When can I hear back?**\n\nI will do what I can. I will most likely answer these questions over the weekend. Any specific legal questions, unless something urgently stands out to me, I will likely not be able to answer.  \n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.96,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },

    {
        "id": "1gfboqq",
        "title": "Getting Naturalization Form Interesting Problem",
        "score": 1,
        "num_comments": 13,
        "author": "X_Da_BoB_X",
        "created_utc": 1730253149.0,
        "created_readable_utc": "2024-10-30 01:52:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1gfboqq/getting_naturalization_form_interesting_problem/",
        "permalink": "https://reddit.com/r/USCIS/comments/1gfboqq/getting_naturalization_form_interesting_problem/",
        "selftext": "I have an interesting problem. My mom has to renew her license but this year is different due to Real ID which is a requirement by 2025. \n\nIn order to renew she has to show her naturalization form. Somewhere down the line she lost it or it got stolen (still not sure on this). We have to retrieve it but theres another issue on her license it says she was born 1958 but on her birth certificate from Mexico it says 1959. My mom swears the 58 one is accurate but I'm not so sure at this point (and my grandma recently passed so we can't ask her). \n\nWe need to get her naturalization form but my dad is afraid to because he thinks they might turn this around on us and say she isn't who she says she is even though she has a license, social security, and various other proofs of who she is just not the naturalization or a passport. Moreover, he's afraid they might revoke her Medicare benefits.\n\nIs this a legitimate concern?\n\nAlso if we go through the process what are the chances of getting the form? \n\nFrom my standpoint, I'm thinking she's just a record in a database and without numbers lining up to that record they aren't going to give it to her but I don't know.\n\nOther information: my Grandpa was born in the United States and was a US citizen. He never got my mom her citizenship because my mom said he was a go with the flow kind of guy and this was just work he didn't want to do. My mom got naturalized at age 14 (she believes) since my grandpa wouldn't do it. We have the birth certificate of my Grandpa and his obituary that cites my mom. Do you think this would help? \n\nShould I continue with filling out the N-565 form or should we just get a lawyer?\n\nAny advice would be greatly appreciated and thanks in advance! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },
  

    {
        "id": "1g2ugzq",
        "title": "Non-biological US citizen father; alien mother",
        "score": 3,
        "num_comments": 9,
        "author": "zephen_just_zephen",
        "created_utc": 1728839330.0,
        "created_readable_utc": "2024-10-13 17:08:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1g2ugzq/nonbiological_us_citizen_father_alien_mother/",
        "permalink": "https://reddit.com/r/USCIS/comments/1g2ugzq/nonbiological_us_citizen_father_alien_mother/",
        "selftext": "My girlfriend is a Mexican national.  At the time of birth of her 10 year old son, she was married to a US citizen and living in Mexico.  The child was born via IVF from donor sperm.\n\nAccording to several things I read, the child acquired US citizenship at birth.  For example, [this](https://www.uscis.gov/policy-manual/volume-12-part-h-chapter-2) states:\n\n> To be considered a child of a U.S. citizen father, the child must be: ...  The child of a U.S. citizen father who is married to the child’s genetic or gestational parent at the time of the child’s birth (even if no genetic or gestational relationship exists with the U.S. citizen father) if both parents are recognized by the relevant jurisdiction as the child’s legal parents ...\n\nBut all the instructions for all the forms I have seen (e.g. N-600, CRBA, etc.) seem to require that the father be the biological father of the child.\n\n1) What is up with this?\n\n2) Assuming we can get past this, it seems a CRBA (if possible) would be much cheaper and quicker than a N-600.  We live in Texas but could easily travel to Mexico.  Is that allowed for the CRBA?\n\nTIA",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

 
    {
        "id": "1fsc3xu",
        "title": "Derivative Citizenship—no go?",
        "score": 0,
        "num_comments": 7,
        "author": "Straight_Leopard_614",
        "created_utc": 1727637006.0,
        "created_readable_utc": "2024-09-29 19:10:06 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1fsc3xu/derivative_citizenshipno_go/",
        "permalink": "https://reddit.com/r/USCIS/comments/1fsc3xu/derivative_citizenshipno_go/",
        "selftext": "Location: SLC, UT\n\nLooking for weigh ins/opinions on our case. I’ll try to make this short and can expand if needed in comments. \n\n- My husband naturalized as a USC in 2021. \n\n- His youngest daughter was 16 so had the opportunity to receive derivative citizenship. \n\n- She lived outside the US and we petitioned for her visa/green card. In her visa interview and packet, we presented, unsolicited, a notarized letter from her mother releasing her to her father. \n\n- She entered the country two weeks before her 18th birthday, in 2023. This should’ve qualified her for citizenship.\n\n- We applied for her passport after she got here. They wanted additional documentation. We provided it. They came back asking for more, including the full divorce proceedings of her parents. Sent the 70-page hearing that I previously did not know existed. Apparently all parties “agreed” to make up a story about my husband and he never showed up to the hearing because he wasn’t informed.\n\n- Full custody was granted to the mother over given the story they claimed.\n\n- Mexico does have laws surrounding potestad paternal, and we did have a lawyer and notary in Mexico draft a document showing both the state law where the custody hearing was filed as well as the federal laws, which, in spite of the ruling, do give the mother release to allow the children to be with their father. We submitted this with the full hearing, hoping it would give credence to her letter she provided to release her daughter into her father’s custody to get her visa. \n(BY THE WAY—how on earth did they approve the visa with that letter if they don’t find it valid for citizenship?! They approved him to take her out of the country for the visa!)\n\n- We finally received rejection on the passport, saying he had no paternal rights (which is indicated in the decree) but can dispute it. I wanted to exhaust all options, and I think we are pretty much there.\n\nQUESTION: Are there any ideas if there is a way to make this successful, or do we just wait out her time on a green card before she gets to apply for citizenship? If so, what would you recommend?\nI’m trying to get an appt with USCIS to discuss. The website says I can make it online, then it says to call, but calling, if it’s not for biometrics or one other item, it doesn’t allow me to make an appointment. \n\nIf we paid $$$$ for a citizenship certificate for her (silly), would it be granted? Or would they send us through these same hoops? I don’t know if they want all these burdens of proof. \nIf I knew about all this in the start, I wouldn’t have pushed to get her petition going in any hurry before she was 18. \n\nShe’s now 19.5.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Citizenship"
    },
   
    
    {
        "id": "1fhfl99",
        "title": "Passport /USCIS",
        "score": 0,
        "num_comments": 1,
        "author": "mission1complete",
        "created_utc": 1726415175.0,
        "created_readable_utc": "2024-09-15 15:46:15 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1fhfl99/passport_uscis/",
        "permalink": "https://reddit.com/r/USCIS/comments/1fhfl99/passport_uscis/",
        "selftext": "Does anyone know ? If when a passport gets issued through the US embassy’s in Mexico City does USCIS get notified of said passport being issued ? I was given citizenship through the derivative process from the born out of wedlock law before the 2017 change . Will I need to report to immigration ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
  
  
    {
        "id": "1f9mx10",
        "title": "Applying for citizenship as person born abroad, over 18 years of age",
        "score": 1,
        "num_comments": 4,
        "author": "dirtynikeairs",
        "created_utc": 1725544007.0,
        "created_readable_utc": "2024-09-05 13:46:47 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1f9mx10/applying_for_citizenship_as_person_born_abroad/",
        "permalink": "https://reddit.com/r/USCIS/comments/1f9mx10/applying_for_citizenship_as_person_born_abroad/",
        "selftext": "Good Afternoon, r/USCIS,\n\nBasically, the title summarizes it pretty well. I am 22 years old, having been born and raised in Germany to an American father and German mother. I am fairly certain I did not automatically obtain citizenship at birth due to my dad not meeting the residency requirements (5 years in total LIVING in the US, with two of the years being completed after the 14th birthday). He never filed a CRBA, or form N600K. Still, he is a US citizen, having and having kept ONLY the US Citizenship (despite living in Germany for close to 50 years). \n\nMy Grandfather, however, would very much be meeting the requirements (He lived in the USA for about 40 years before my Dad was born, and about 5 years just after), and as stated in the Instructions for form N600K, this would also count, given I can prove my Dads dependency on my Grandpa (which I also can). The problem here is that I am now over 18 years of age, which means form N600K doesn't apply to me anymore. Another important factor would be that my grandpa was in the Air Force for a pretty long time, with this also being the reason for him moving to Germany 5 years after adopting my Dad. We have multiple files documenting his service and exceptional performance during these years, on North American AND \"foreign\" US soil (\"Foreign\" as in the barracks here in Germany). \n\nI am currently residing in Germany, but I'm very much planning on moving to the US sooner than later. I believe I do have everything it should take to be granted citizenship / prove I am eligible for citizenship, my only REAL issue is the fact that theres no Form to fill out as I am, as stated before, resident in Germany, over the Age of 18 and have never lived in the USA myself. \n\nMy question now is the following: What are my options? How, where, and to whom can I prove my eligibility for citizenship based on the factors I just listed? Are there any forms I can fill out (except for N-600, N-600K, and DS-2029, as I don't meet the eligibility requirements for these)? Are there any resources for cases as mine? Sadly, the two USCIS agents I talked to weren't of much help, which is why I am asking here. If you made it this far, I appreciate you taking time to read through this, and if you have any answers/tips/ideas where to start, I'd greatly appreciate you telling me either through the comments or PMs. If you need any more information to be able to help me, please let me know as well.\n\nThank you very much and have a great rest of your day,\n\nJake\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.57,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },
  


    {
        "id": "1ewonls",
        "title": "Naturalization 2024",
        "score": 4,
        "num_comments": 7,
        "author": "just_here2019",
        "created_utc": 1724135443.0,
        "created_readable_utc": "2024-08-20 06:30:43 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ewonls/naturalization_2024/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ewonls/naturalization_2024/",
        "selftext": "Reddit has helped me immensely and I hope by sharing my naturalization experience to become US citizen will be helpful to someone one day.\n\nI already had an application for removing the condition on my green card which was already over 2 years in with no movement. I got i751  stating I can continue residing for another 48 months until my green card came in. I figured since I have been eligible to apply for naturalization for over a year now to go for it. I was hesitant only because my origin country doesn’t allow dual citizenship. But given my family is American, I figured it’s time. \n\nSo I sent my online naturalization application in January 2024. I pretty much already had everything from my green card application so I added more pictures and my second child’s birth certificate as additional proof to show my marriage is legit. Probably the easiest of all applications (F1, H1B, green card). Since they already had my biometric from green card application, I was shortly sent a letter stating I won’t have to do it again. \n\nI believe in June, I got a letter stating I was scheduled for interview in Centennial, CO office at 8.15am in July. I like a fool assumed 8.15am means time I need to be building. By the time I made it to second floor for the interview, my name was already called out before. But the person interviewing was kind and told me not to stress about being late. \n\nHe was wonderful from start to end. I had a very simple test on my understanding of English language followed by civic test. All questions were from the guide they have on USCIS website (100 questions). I did get one wrong, but made up with follow up question. As soon as I got 6 right, not more questions were asked. Rest of the interview was more of a conversation. Though I had a minor police record (no charges), he said it’s not a big deal himself. He made it clear I did a thorough job on documents I provided and it answered any questions he had. \n\nThe only thing I didn’t print in entirety was my lease agreement. Since we did move between green card and citizenship application, that’s the only document he asked for. He just asked me to email it to him. I took his permission to use my phone and sent him the file during the interview itself. \n\nDuring the interview, he told me that he will approve my application and next step is review by his supervisor. He said I will receive a letter indicating the review step shortly. I did clarify if his supervisor might ask more documents or re interview to which he responded it’s unlikely since all applications are reviewed by him and supervisor together before the interview I was in. \n\nI interpreted that shortly will mean a week but it took 3 weeks I think to get that letter. Within another 2 weeks, I got a letter saying my case was approved and I will get another letter for oath of allegiance. I got letter that my oath of allegiance date has been scheduled in first week of Aug. The actual oath date was within 3 weeks from date letter was received.\n\nOn the oath day, we accidentally went to 2nd floor  after security. Oath was on third floor. 5 mins befor the oath, security perosn asked the room if anyone is here for the oath and off we went to correct floor. Now this room made lot more sense. There were lot of people there like 150ish. There were some 40+ new citizens. Straightforward and whole thing wrapped up in an hour and person hosting was kind to allow people to take pictures/vidoes at each step. \n\nThe whole thing was a dream and end to end took probably 6 months. \n\n(Minor but worth mentioning: the entry security guy is horrible. He speaks fast and sort of strange. It was very hard to understand what he was saying: Basically to put shoes directly on the X-ray roller instead of bins. Given it is USCIS office where people come whose English is not a first language, he seemed very standoffish. So was his buddy. All other officers on other floors were nice is it was just these two. The guy actually made a child cry since his parents had to ask him a few times to repeat what he said. Which he did loud and FAST again. If not for him, I would say this Centennial office is amazing)",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.84,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-400 (Citizenship)"
    },
    {
        "id": "1ewko85",
        "title": "Need Guidance on Filing for N-600 vs. N-400 vs. US Passport",
        "score": 1,
        "num_comments": 1,
        "author": "Beneficial-Phrase-76",
        "created_utc": 1724121720.0,
        "created_readable_utc": "2024-08-20 02:42:00 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ewko85/need_guidance_on_filing_for_n600_vs_n400_vs_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ewko85/need_guidance_on_filing_for_n600_vs_n400_vs_us/",
        "selftext": "Hello,\n\n  \nThanks in advance for any guidance able to be offered here as I know this is a fairly complex issue...\n\n  \nI was originally born in India, but have been a lawful permanent resident via Green Card living in the US for the past 30 years when my parents immigrated here. I am trying to determine what my best course of action is to be issued a US Passport, as I was originally planning to file an N-400 for Naturalization, and just now discovered that believe I may already be a US Citizen under INA 320 and the Child Citizenship Act, but am not entirely sure. My parents are now divorced, but while still married, my father became a US Citizen through Naturalization in 2003 (well before I turned 18), my mother did not file at that time and is still currently a Green Card holder. I believe at this point I also acquired Citizenship as his child who was a LPR residing in the US, which if true, I believe would make me eligible to file an N-600 as proof of citizenship and in turn obtain my US Passport.\n\n  \nThe main issue is that I do not have much official documentation due to losing my documents over the years, so am not sure what I can/can't file for. I do not currently have a physical copy of my green card, which expired within the last year, though I do have my USCIS Alien Number presumably allowing for my file/status to be looked up and verified. I don't have a valid driver's license or other ID as this expired, and requires my green card (which I do not physically have) to renew. I also do not have my birth certificate, or a copy, as this was lost. I am not in active communication with my father, though I could likely reach out to obtain his proof of citizenship if absolutely needed.\n\n  \nI am trying to determine what my best course of action is to ultimately be issued a US Passport, and again greatly appreciate any guidance anyone can offer. Some specific questions I have are:\n\n* Am I indeed already a US Citizen through INA 320 / the Child Citizenship Act?\n* If so, what documents will I need for N-600 and can I still file this given I do not have a copy of my birth certificate? Can this someone how be discerned from my USCIS Alien Number and associated Green Card file?\n* Am I able to / should I submit a FOIA to obtain my original Green Card application and associated birth certificate from USCIS? Would this help me to file any of the other methods?\n* Can I apply directly for a US Passport or would I still need my N-600 first given the lack of documentation? Do I need a copy of my birth certificate for this?\n* Will I need to obtain proof of my Father's Citizenship from him, or is there some other way for USCIS to verify this?\n* Is my Green Card currently being expired a blocker for any of this, and would I need to first file to replace/renew this?\n* Given my lack of birth certificate, would it be easier for me to file N-400 as I'm still a LPR via Green Card? Would I still be eligible to do this, or would I be denied and routed to N-600?\n\n  \nMy main goal is simply to obtain a US Passport to be able to travel, as I have never actually held a passport of India or any other country. During my first and only trip from India to the US, I travelled on my parents passport. I'd like to understand what the easiest and eligible path would be for me given the documentation/evidence I have, ideally taking into consideration the quickest processing times.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

    {
        "id": "1epeoyu",
        "title": "Need some advice",
        "score": 0,
        "num_comments": 3,
        "author": "Frequent-Signal-1878",
        "created_utc": 1723359956.0,
        "created_readable_utc": "2024-08-11 07:05:56 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1epeoyu/need_some_advice/",
        "permalink": "https://reddit.com/r/USCIS/comments/1epeoyu/need_some_advice/",
        "selftext": "Hello everyone, I'm new to this and just wanted some advice.  \n  \nMy wife was a studying here in the US from her home country vietnam, we met and I fell in love with her. After 3-4 years I decided to marry her. Before we met, she had already given birth to my step daughter who was about 1 year old when we started dating. My step daughter is a legal US citizen as she was born here. On her birth certificate it only identifies her mother and that she has no biological father listed. \n\nMy wife and I were worried if it was possible for my step daughter to petition her biological father to America even though he has no legal relationship with her, neither in his own country nor the US. She and her family have told me stories about how she was in an abusive relationship with him and took the opportunity to leave. We were afraid he might try to come in contact with our daughter in the future and convince her to sponsor him.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    

    {
        "id": "1edmyug",
        "title": "Proving physical present for Consular Report of Birth Abroad (CRBA) without transcripts",
        "score": 3,
        "num_comments": 17,
        "author": "LuthienDragon",
        "created_utc": 1722104648.0,
        "created_readable_utc": "2024-07-27 18:24:08 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1edmyug/proving_physical_present_for_consular_report_of/",
        "permalink": "https://reddit.com/r/USCIS/comments/1edmyug/proving_physical_present_for_consular_report_of/",
        "selftext": "I will be having a baby soon, I am an American Citizen. We are at a crossroads currently, we need to make a choice of me going completely alone to the USA to give birth to guarantee citizenship or staying abroad with family, to later try to prove physical presence.\n\nI have some documents of me being raised there for the first three years of my life (mostly photos) and some pediatrician records plus vaccines. My parents were able to find some bills, obviously on their names as I was a baby.  \n  \nLater in my life, around my 20's, I lived in the USA for 3 years and some months but the only thing consistent in my name is my car registry (imported the car from Mexico which had always been on my name and continued to be on my name until I sold it in the USA, insurance payments, plus CarFax records). I lived with my parents, so all the bills are on their names.   \n  \nI have some W-2's, but I was never able to find full-time job, so it's usually on average three days a week payments or 39 hours a week. I do have passport stamps that record me staying in for long periods of time.\n\nI never went to the Doctor although I was assigned a PCP and everything, but I was terrified of going bankrupt in the American system, so I just drove down to Mexico and went for healthcare there when needed. So, no medical records.\n\nSo, in Summary I have:\n\n* Baby photos, medical pediatrician records and some bills on my parent's names (worth 3 years).\n* Bank Statements, with my name and address.\n* Car Registries and Insurance Payments with address.\n* Bills on my parent's names for water, electric and internet bills.\n* W-2's with part-time employment (three years).\n* Pet Records (vaccines, pet tax, etc).\n* Passport Stamps. I have all my passports, even when I was a baby, so this includes those stamps.\n* Four years of Tax Returns in which I paid taxes because I was living there at the time.\n* Realistically, I have around 5, maybe 6 years of proof.\n\n  \nWould that be enough? Are photos actually admissible (especially for toddlerhood?).   \nWhat uncommon documents do the accept? TIA!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },

  
    {
        "id": "1e6nh7c",
        "title": "Spouse pregnant ",
        "score": 1,
        "num_comments": 4,
        "author": "Left-Imagination632",
        "created_utc": 1721340067.0,
        "created_readable_utc": "2024-07-18 22:01:07 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e6nh7c/spouse_pregnant/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e6nh7c/spouse_pregnant/",
        "selftext": "Hi everyone,\n\nI'm seeking advice and insights regarding my I-130 case. It has been 876 days since I filed for my spouse, and my case status is still \"case is being actively reviewed.\" My spouse is pregnant and due to give birth this month. Has anyone experienced such a long wait? Any suggestions on what I can do to expedite the process or adjust my case given this situation?\n\nThanks in advance for your help!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1e6h3qq",
        "title": "Asylum for Mexican spouse",
        "score": 0,
        "num_comments": 5,
        "author": "CabbagesnKings",
        "created_utc": 1721323863.0,
        "created_readable_utc": "2024-07-18 17:31:03 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1e6h3qq/asylum_for_mexican_spouse/",
        "permalink": "https://reddit.com/r/USCIS/comments/1e6h3qq/asylum_for_mexican_spouse/",
        "selftext": "Hi, I'm an American citizen with a Mexican spouse. We got married last year and she is still in Mexico. I am starting the I-130 process for her and her kids but given the violence in her country, she is thinking of applying for asylum with the hope that she can enter the US legally and then we could petition for a status adjustment.\n\nDoes anyone know if that a viable option? Could she be penalized if she goes that route? Thanks for any advice!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (Family/Adjustment of status)"
    },
 
 
  
    {
        "id": "1dkozzf",
        "title": "CRBA Question (Sorry if wrong tag!)",
        "score": 1,
        "num_comments": 1,
        "author": "ThatMexicanyouknow",
        "created_utc": 1718924189.0,
        "created_readable_utc": "2024-06-20 22:56:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dkozzf/crba_question_sorry_if_wrong_tag/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dkozzf/crba_question_sorry_if_wrong_tag/",
        "selftext": "Hello!  \nI am currently trying to fill out a I-130 Petition for my Father. He has never lived in the US and I was born in Mexico to him and my American mother. She got me a Certificate of Birth Abroad (CRBA) immediately after I was born. In the form it asks me if I have a Certificate of Citizenship or a Certificate of Naturalization, I have neither and am confused as to what to enter here because currently my information makes it look like I shouldn't have citizenship since I state I was born in Mexico. To clarify the situation a bit more, parents got divorced long ago which is why my mom is not the one doing this process, and I have double checked that I have no certificate of citizenship, all I have is a CRBA, what should I do?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
  
    {
        "id": "1djz53w",
        "title": "My aunt (US citizen) lives with her two children in Mexico and wants to move to the us with them. Is it-130 suitable?",
        "score": 0,
        "num_comments": 8,
        "author": "DieSchungel1234",
        "created_utc": 1718845101.0,
        "created_readable_utc": "2024-06-20 00:58:21 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1djz53w/my_aunt_us_citizen_lives_with_her_two_children_in/",
        "permalink": "https://reddit.com/r/USCIS/comments/1djz53w/my_aunt_us_citizen_lives_with_her_two_children_in/",
        "selftext": "Children are not eligible for US citizenship currently (their mom never lived in the US she just got it at birth). One is 16 yo and the other is 14. They reside in Mexico. Would i-130 be the easiest way?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1djvf20",
        "title": "N-600 if I don’t have CRBA",
        "score": 1,
        "num_comments": 6,
        "author": "SadCard4805",
        "created_utc": 1718834661.0,
        "created_readable_utc": "2024-06-19 22:04:21 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1djvf20/n600_if_i_dont_have_crba/",
        "permalink": "https://reddit.com/r/USCIS/comments/1djvf20/n600_if_i_dont_have_crba/",
        "selftext": "I was born in Europe to a European mother and American father in the 80s. I moved to the US when I was two - my parents didn’t get a CRBA but somehow I was given a US passport right after we moved to the US (in addition to the European one). I am now being asked to prove that I was a US citizen at birth by the European country because they only allow dual citizenship if you were born into another citizenship. I have filed endless vital records requests, FOIA requests… no CRBA, N-400 has shown up… and no one can give me much information on how I “became” a US citizen. \n\nIf I met all the requirements for derivative US citizenship with clear evidence (I do), could I get an N-600 ~40 years later to “prove” I was born a Us citizen?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
   
    {
        "id": "1dhd52j",
        "title": "Marrying a US citizen who never lived in the US...",
        "score": 1,
        "num_comments": 8,
        "author": "BikinginNYC",
        "created_utc": 1718560408.0,
        "created_readable_utc": "2024-06-16 17:53:28 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1dhd52j/marrying_a_us_citizen_who_never_lived_in_the_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/1dhd52j/marrying_a_us_citizen_who_never_lived_in_the_us/",
        "selftext": "Long story short: We met online, so we have a long distance relationship and have met once when i traveled to Mexico. Also, I'm a DACA holder. She asked me to travel the world with her before I explained my situation, so when i told her I had DACA and can't travel whenever i wanted, she asked me to marry her. That's when she explained her situation. She was born in the US, but has never lived here, and doesn't have all her documents because her mother lost them after she send her to Mexico with her father. She also doesn't speak any English. Soon we'll begin the process to obtain her birth certificate and passport, once she's here we're planning to get married. My question is: do immigration officers may treat her differently  or discriminate our case because she doesn't speak any English, and because she hasn't live in the US.?  what advice do you have for me based on your experiences?  I appreciate your opinions and advice. Thanks 🙏🏾",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.56,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (Family/Adjustment of status)"
    },
    
    {
        "id": "1d2yl3x",
        "title": "Advice on eligibility of American citizenship through naturalised parent ",
        "score": 1,
        "num_comments": 6,
        "author": "shangodjango",
        "created_utc": 1716940820.0,
        "created_readable_utc": "2024-05-29 00:00:20 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1d2yl3x/advice_on_eligibility_of_american_citizenship/",
        "permalink": "https://reddit.com/r/USCIS/comments/1d2yl3x/advice_on_eligibility_of_american_citizenship/",
        "selftext": "I'm looking for some advice on a somewhat complicated situation regarding my potential eligibility for American citizenship.\n\nHere's a bit of background:\n\n* My dad is 68 years old, a Texan with an American passport. He has been an American all his life and traces his heritage through Texas and Louisiana.\n* He met my mum in London, where they had me.\n* They were not married when I was born, and my dad's name is not on my birth certificate.\n* I was born in London and am currently 28 years old.\n\nGiven this information, I'm wondering if it's possible for me to claim American citizenship through my dad. I know there are various laws and requirements regarding citizenship through a parent, especially when the parents are not married and the father's name is not on the birth certificate.\n\nHas anyone been through a similar situation or have knowledge about the process? What steps would I need to take to establish my citizenship, if it's even possible? Any advice or resources would be greatly appreciated.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },
 
    {
        "id": "1cui0kf",
        "title": "Just submitted today! We are both DEAF, I hope it won’t be an obstacle!",
        "score": 8,
        "num_comments": 6,
        "author": "Wizardscientist7",
        "created_utc": 1715984504.0,
        "created_readable_utc": "2024-05-17 22:21:44 UTC",
        "url": "https://i.redd.it/a6p4ot1ya21d1.jpeg",
        "permalink": "https://reddit.com/r/USCIS/comments/1cui0kf/just_submitted_today_we_are_both_deaf_i_hope_it/",
        "selftext": "I am 26M us citizen, sponsoring 29F Mexican citizen, to move to USA. We also have a baby born here in Mexico… I have already obtained CRBA birth certificate for our son… and had uploaded it to USCIS, to prove that we are legitimately married. \n\nI hope everything I am doing is right. I submitted I-130 with i-130a. Paid $625.\n\nWhat next? We wait…? And we apply for I-485 to change her status to green card right?\n\nWe are not able to use telephones, we are deaf… hopefully this won’t be a problem. \n\nI would appreciate any kind of input, tips, feedback, and all that.  \n\nMuch thanks ",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },

 
    {
        "id": "1co9opc",
        "title": "Fastest way to get a certified copy of a birth cert, have it apostilled and translated to Spanish? (Los Angeles, CA)",
        "score": 1,
        "num_comments": 5,
        "author": "MrLituation",
        "created_utc": 1715293070.0,
        "created_readable_utc": "2024-05-09 22:17:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1co9opc/fastest_way_to_get_a_certified_copy_of_a_birth/",
        "permalink": "https://reddit.com/r/USCIS/comments/1co9opc/fastest_way_to_get_a_certified_copy_of_a_birth/",
        "selftext": "I'm trying to get a certified copy of my birth certificate, have it apostilled and translated to Spanish for a civil marriage in Mexico. My trip is coming soon (June) so I really hope this is possible. Any guidance will be much appreciated ! thanks!\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
   
    {
        "id": "1ci2kgb",
        "title": "I, 26M USA citizen married to 29F Mexican Citizen. What’s the correct procedure to bring her in USA?",
        "score": 1,
        "num_comments": 7,
        "author": "Wizardscientist7",
        "created_utc": 1714611180.0,
        "created_readable_utc": "2024-05-02 00:53:00 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ci2kgb/i_26m_usa_citizen_married_to_29f_mexican_citizen/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ci2kgb/i_26m_usa_citizen_married_to_29f_mexican_citizen/",
        "selftext": "Hey guys, I really want to sponsor my wife to bring her into the United States. We are both deaf and use sign language to communicate. I read and write English and Spanish well. My wife only do Spanish, and not so much English. \n\nWe got married at Guadalajara 8 months ago. We have had a baby born in Mexico 6 months ago. I succeeded in doing the Consular Report of Birth Abroad, our son has two citizenships Mexico and USA. \n\nI am currently under process of obtaining Mexican Residente Permanente Visa. Right now I am still a “Tourist” with FMM in Mexico.\n\nAh now finally… we want to bring my wife to the United States. We tried to apply for B1 B 2 visa for her, we went to the interview in Mexico City 5 months ago. She got declined. I don’t know why.\n\nSo here we are… trying to figure out the REAL way for her to be able to permanently and legally move to the United States. \n\nWhere do we start? Do we need a lawyer to navigate this? Or you guys believe that we are able to do this ourselves? PLEASE HELPPPP give us any advice, which visa to apply for, and all the stuff!!!\n\nLove you all! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },
    {
        "id": "1chs7wb",
        "title": "Naturalization process going too fast, how should I delay?",
        "score": 1,
        "num_comments": 25,
        "author": "Liakada",
        "created_utc": 1714585292.0,
        "created_readable_utc": "2024-05-01 17:41:32 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1chs7wb/naturalization_process_going_too_fast_how_should/",
        "permalink": "https://reddit.com/r/USCIS/comments/1chs7wb/naturalization_process_going_too_fast_how_should/",
        "selftext": "I have been holding off on applying for naturalization for 15 years because my birth country did not allow dual citizenship without going through a burdensome process. They are finally changing their citizenship law and in late  June I will officially be able to keep my birth country citizenship as well get the US one. Based on the timelines posted for my service center (6-8 months) and experiences from others, I thought it was safe to file for naturalization 2.5 months ahead of the law change. I didn't want to wait too long to file in hopes I could get it after the law changes, but before the next election.\n\nWell, now I already got the interview notice after just one month and it is scheduled for early June. I read that sometimes the approval and oath is given the same day of the interview, so to avoid that I assume it would be safest to reschedule the interview? \n\n1. When I do so, do I need to provide any proof why I can't come in on the scheduled date? \n2. When I reschedule, can I request a certain date a month out, or would they require me to take the next available time slot? I want to be sure that they don't reschedule it just a week or two after which would still be too early.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Citizenship"
    },
  
   
    {
        "id": "1cci6ih",
        "title": "4 months pregnant husband in Mexico ",
        "score": 1,
        "num_comments": 1,
        "author": "lunamoon0114",
        "created_utc": 1714016508.0,
        "created_readable_utc": "2024-04-25 03:41:48 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1cci6ih/4_months_pregnant_husband_in_mexico/",
        "permalink": "https://reddit.com/r/USCIS/comments/1cci6ih/4_months_pregnant_husband_in_mexico/",
        "selftext": "I am 4 months pregnant my husband is in Mexico with an applied I-130/K3. I got the receipt notice March 10, 2023 in potomac center. It has yet to be approved. I am  just nervous he wont be here before I give birth. I know i can only expedite if I am a high risk pregnancy, and thankfully I am not and disqualifies me. But I was wondering if I could expedite on the grounds that I only make $21,000 a year and I will be taking of about 4 months, my job offeres no maternity care or does anyone think we are close to getting him here?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },

    {
        "id": "1c22j8w",
        "title": "Is my father a United States Citizen?",
        "score": 1,
        "num_comments": 9,
        "author": "Pizza0190",
        "created_utc": 1712904681.0,
        "created_readable_utc": "2024-04-12 06:51:21 UTC",
        "url": "https://i.redd.it/3r3bq1s1xztc1.jpeg",
        "permalink": "https://reddit.com/r/USCIS/comments/1c22j8w/is_my_father_a_united_states_citizen/",
        "selftext": "Sorry i just dug into the rabbit hole of everything ",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },

    {
        "id": "1bhockx",
        "title": "Renewing passport born overseas",
        "score": 2,
        "num_comments": 5,
        "author": "PurgeProjects",
        "created_utc": 1710761001.0,
        "created_readable_utc": "2024-03-18 11:23:21 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1bhockx/renewing_passport_born_overseas/",
        "permalink": "https://reddit.com/r/USCIS/comments/1bhockx/renewing_passport_born_overseas/",
        "selftext": "Edit: I only needed my old US passport. None of the supporting documentation requested on the form was required despite the form stating so. Something I probably should have realised was that you also have to complete the second half of the form stating both parents details even if one is not an American - this wasn’t immediately obvious given that the whole form is structured around parental permission and isn’t intuitive if you are either over the age of 18 or this is not your first passport. Thanks for the advice everyone. \n\nHi all, I’m a US citizen born overseas. My last passport was issued before I was 16 and as a consequence I am applying via DS11 and require an appointment. \n\nDS11 requires me to provide my consular report of birth abroad, my parents proof of us citizenship, my parents marriage certificate, and an affidavit showing all your US citizen parents periods and places of residence and physical presence before your birth (ds-5507).\n\nI’m able to provide all of this except DS-5507 owing to the fact my mother is now quite old - the events would have been 30 years ago and she can’t recall.\n\nDoes anyone have any experience in a similar situation applying without DS-5507? I have three previous passports (expired) and hope that if viewed holistically my application would be accepted - particularly considering DS-5507 is a prerequisite for the consular report of birth abroad when initially filed. \n\nAny advice or experience would be greatly appreciated. Thanks.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },

    
    {
        "id": "1b35txy",
        "title": "Are tax returns and passport stamps enough proof of having lived in the USA?",
        "score": 1,
        "num_comments": 16,
        "author": "LuthienDragon",
        "created_utc": 1709227444.0,
        "created_readable_utc": "2024-02-29 17:24:04 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1b35txy/are_tax_returns_and_passport_stamps_enough_proof/",
        "permalink": "https://reddit.com/r/USCIS/comments/1b35txy/are_tax_returns_and_passport_stamps_enough_proof/",
        "selftext": "We are currently expecting, **mother is a USA citizen** and father is not. Currently living in Mexico. Still plenty of time. We would love to apply for \"CONSULAR REPORT OF BIRTH ABROAD\" at the nearest consulate once baby is born, so we can comfortably give birth in Mexico due to insurance.  \n\n\nHOWEVER, mother has only lived 5 total years in the USA. 2 years as a baby and 3 after age 14. According to law:  \n\n*\"For birth on or after November 14, 1986, the U.S. citizen parent must have been physically present in the United States or one of its outlying possessions for five years prior to the person’s birth, at least two of which were after the age of 14.\"*\n\nWe still have the baby passport with the stamps of entry/leave. For recent years, we have tax returns (four) and pay stubs plus passport stamps too. Would that be enough?\n\n Is there a way to know beforehand if baby would be a born citizen? We want to avoid having to go to the USA to give birth with her family but willing if there is no other option. Thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },

 
    {
        "id": "1aqjyv7",
        "title": "K1 Visa, Ciudad Juárez",
        "score": 16,
        "num_comments": 64,
        "author": "North_Edge_8421",
        "created_utc": 1707907211.0,
        "created_readable_utc": "2024-02-14 10:40:11 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1aqjyv7/k1_visa_ciudad_juárez/",
        "permalink": "https://reddit.com/r/USCIS/comments/1aqjyv7/k1_visa_ciudad_juárez/",
        "selftext": "My fiancé was just approved for his K1 Visa in Ciudad Juárez, Mexico. Yay! I wanted to post about our experience so that it can give others insight into their process as well.\n\nHere’s our timeline:\n\nApplication mailed: September 27, 2022\n\nApplication received by U.S.C.I.S: September 30, 2022\n\nNOA 1: October 5, 2022 - Mailed by U.S.C.I.S. California Service Center\n\nNOA 2: September 21, 2023 - Petition sent to NVC in Portsmouth, New Hampshire \n\nNVC email: October 11, 2023 - Confirmation of receipt of approved I-129F petition and forward to Consulate in Ciudad Juárez.\n\nConsulate Ciudad Juárez email: January 16, 2024 - Immigrant Visa Appointment and instructions \n\nMedical Appointment: February 8, 2024\nBiometrics Appointment: February 9, 2024\nDay 1 Document Drop Off: February 12, 2024\nDay 2 Interview: February 13, 2024\n\nQuestions asked during the interview:\n\nWhat is your fiancés name? \nWhere does your fiancé live? \nWhat does your fiancé do for work? \nDo you have children together? \nWhere was your child born? \nIs this your first marriage? Your fiancé’s first marriage?\nIs your fiancé an American citizen by birth or naturalization? \nWhere was your fiancé born? \nWhat will you do when you live in the USA? \nAnd finally ended with, “Welcome the the United States, your visa has been approved.”✅\n\nHere are my tips:\n\n1. Submit as much documents as you can when you initially file for the K1 visa, I mean a stack of documents. Be as heavy handed with the documents as possible send photos, copies of text messages, call logs, social media posts, discussions with family and friends trip re: fiancé, trip itineraries - everything. This will help with processing and the interview (they won’t ask for much documents in the interview). We submitted a huge folder of documents with colored tabs, separators, highlighted parts, cover sheet, all the works. During the interview they only requested both petitioner & beneficiary birth certificates, police certificates (beneficiary), sealed medical packet, form I-134 and 2022 tax return (we printed previous 3 year tax returns, employment letter, bank accounts, proof of residency other evidence but they only took my 2022 tax return).\n\n2. Bring the petitioner’s (U.S. citizen) birth certificate to the interview, a certified copy or the original will suffice. This is important, if you do not have it this will cause a delay in your case.\n\n3. When filling out the form I-134 Declaration of Support, you only need to meet the minimum income requirements - assets are a plus but are not necessary. Income > assets. The government will always prefer an income because it’s consistent and measurable, even if you have 200K in assets that’s still not considered stable unless you have a job. There is a table listed on the U.S.C.I.S. government website that will show you how much money you need to make in order to qualify. IF your income does not meet the required amount THEN you can list your assets to close that gap. There’s a formula they use to calculate the amount of assets you would need to cover  the gap (a quick google search to find it). Also, be careful when listing assets (house, car, property etc.) they will consider how much debt you have and there’s a whole process for assessing value to these assets that also might cause delays if not done properly or they might need additional information. This form in my opinion was the most tedious, confusing form but I found helpful guides on YouTube. \n\n4. Try to arrive to the consulate as early as you can, they do not check appointment times. My fiancé had an appointment at 9 am (for both days) and he was able to enter the consulate at 7am. There are hundreds of people at any given time waiting in line at the consulate, so just take that into consideration. No appointment, no entry. (Sorry petitioners, you shall not pass).\n\n5. The “interview” is spread out in the course of two days, the official appointment date that is listed in the email confirmation from the consulate is just to drop off documents. They will give you a second appointment for the following business day. The second appointment includes the infamous interview which is super quick, 5 minutes more or less.\n\n6. One sleepless night, I scoured the internet looking for any and all tips. I found one that read - the interview is just a formality, the decision has already been made prior to your arrival. (There are many check points and the application could’ve been rejected before your interview. If rejected at the interview, it’s most likely because the consulate needs missing/more documents that you didn’t bring). If you see your hard copy file during the interview, try to look if there’s an “approval” stamp on the top page. If you see that, your visa has already been approved. (With the understanding that you’re not missing anything else on the day of the interview). My fiancé heard the same thing from the doctor at his medical appointment, and he saw it on the first day at the consulate for his document drop off. We didn’t put much weight on it, until it was approved.\n\nI wanted to share this for everyone who is going through this process and if you’re reading this, I hope it helps you! Best of luck to all the couples.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-129F (K1)"
    },
    {
        "id": "1ap6ofh",
        "title": "What’s next after priority date ?",
        "score": 1,
        "num_comments": 3,
        "author": "Akwardman",
        "created_utc": 1707761732.0,
        "created_readable_utc": "2024-02-12 18:15:32 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ap6ofh/whats_next_after_priority_date/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ap6ofh/whats_next_after_priority_date/",
        "selftext": "Am a permanent resident and I requested a f2 visa for my wife and children in Mexico. Their priority date are may30 2020 and based on the predictions for next month it will be up to jun20. So what happens after will we be given our interview dates ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },
    {
        "id": "1almive",
        "title": "Just finished Consular Interview in Juarez for my wife. Here's how it went",
        "score": 24,
        "num_comments": 19,
        "author": "mar1ocarr1llo",
        "created_utc": 1707364135.0,
        "created_readable_utc": "2024-02-08 03:48:55 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1almive/just_finished_consular_interview_in_juarez_for_my/",
        "permalink": "https://reddit.com/r/USCIS/comments/1almive/just_finished_consular_interview_in_juarez_for_my/",
        "selftext": "My wife, a DACA recipient, just received her green card last week in Ciudad Juarez finally completing our process to adjust her status, which began way back in 2017. She had not done advanced parole, and by the time we began the process to adjust, AP was revoked as a program by the previous admin, so we had to go the i-601a waiver route, and our waiver was approved back in November 2022. We got our interview notice on November 23, 2023 and the first consular interview was Tuesday Jan. 30, 2024. \n\nI'm writing out the process of the interview just because I've found similar posts helpful as we tried to navigate the process of the consular interview and to give folks a sense of the timeline, where we stayed, and other details in case it's helpful. \n\nWe have a three year old daughter which made the potential journey a little more challenging, but overall it worked out well. \n\nDay 1 (Wednesday, Jan. 24): Flew into El Paso and stayed the night there with my folks who live there, which also helped. \n\nDay 2 (Thursday, Jan. 25): Rented a car from the El Paso airport (got the Mexico insurance, which was more expensive than the actual rental, which for nine days was $408). We then drove into Juarez and on that day went to the office of the Attorney General of the state to get her Carta No Antecedentes Penales. I'd highly suggest to visit the office at Pueblito Mexicano, which is near the Puente Libre (the free international bridge into Juarez). That process only took maybe 40 minutes and that's because we didn't know exactly where to go. The price was $118 pesos, so not very much, but make sure you take Mexican cash because they don't accept American credit cards or dollars. Got the letter right then and there and that was the first step done. Checked into hotel, Maria Bonita near the consulate, which is walking distance from everywhere you need to go, but not the closest, or cheapest. But did include a good warm breakfast everyday plus had an indoor pool, which our toddler loved. \n\nDay 3 (Friday, Jan. 26): Wife had her medical appointment at Clinica Medica Internacional, which was recommended by our lawyers. The clinic offered to pick her up and drop her back off. My wife explained her experience, but overall it lasted about 3 1/2 hours, during which time I visited the nearby mall with our daughter. \n\nDay 4 and Day 5 (Saturday, Jan. 27 and Sunday, Jan. 28): Took our daughter to la Rodadora, a children's interactive space, and can't recommend it enough. Other than that, spent time with family who crossed into Juarez on Sunday and just had days to relax for what was ahead. \n\nDay 6 (Monday, Jan. 29): Wife had her biometrics appointment at the CAS, right near the consulate, and this was the quickest process. She got there before her appointment time at 3:00 p.m. and was out within 5-10 minutes. Process for that day done. \n\nDay 7 (Tuesday, Jan. 30): First consular interview day. Wife went in with all her documents, including original birth certificates for her, me and our daughter, all the other paperwork needed, her passport, and even more than 100 pictures proving our marriage (they never asked for any pictures or our daughter's birth certificate). Process took about 3 hours and at the end gave her the final interview appointment for the next day, Wednesday at 7:30 a.m. \n\nDay 8 (Wednesday, Jan. 31): Final consular interview. Got to the consulate with my wife at 7:00, line was already super long. Don't think anyone checks for anyone's actual scheduled time. But thankfully line moved very quickly. My wife was in the door of the consulate before 7:30. I waited at a nearby Starbucks, then on the bridge near the consulate and she came out at 10:30, smile on face and having just been approved for her green card, got the green piece of paper, and now we only needed to wait for her passport. \n\nDays 9 and 10 (Thursday, Feb. 1, Friday, Feb. 2) - Day 9 we just worked remotely from the hotel, anxious to get the email letting us know that her passport was ready. Didn't get the email that day, but did catch a movie at the mall and dinner nearby. Juarez is going through a bit of a violent rough patch, but felt safe throughout. Then finally on Friday, Feb. 2, as we were eating our latest breakfast at the hotel got the email that her passport was ready at the CAS location near the consulate, where she did her biometrics. Picked it up, worked a little, had lunch, purchased some final things to take home and crossed back into El Paso through the Zaragoza bridge (took about 25 minutes) BUT TAKE EXACT MONEY NEEDED to cross back. We didn't know we had to pay (our mistake) and the car behind us saved our life by giving us the $2.20 needed to cross. Wife had to get out and get a stamp, took about 7-9 minutes, and then met me back in the U.S. where I parked our car.\n\nAnd that was it. Flew back home to central Texas on Saturday after spending the night back with my folks in El Paso and back home now with my wife as an LPR. I'm sure I'm missing details but hope this is helpful to anyone going through the process. Process seems needlessly long and arduous, but in terms of days we expected to be there, it was definitely on the low end. \n\n&#x200B;\n\n&#x200B;",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.94,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Other"
    },
    {
        "id": "1ahxdz5",
        "title": "Marriage base green card",
        "score": 1,
        "num_comments": 1,
        "author": "alexmiles0249",
        "created_utc": 1706970715.0,
        "created_readable_utc": "2024-02-03 14:31:55 UTC",
        "url": "https://www.reddit.com/gallery/1ahxdz5",
        "permalink": "https://reddit.com/r/USCIS/comments/1ahxdz5/marriage_base_green_card/",
        "selftext": "Hi everyone,\nMy form i30A got approved and but my green card application got denied.\nThe reason given was I didn’t provide my birth certificate when they ask for it together with my medical.\nIn my initial application I added my birth certificate .\nAfter reading the denial letter and evidence carefully,they said my birth certificate was hand written which is not ….im from Ghana this is same birth certificate I used in the U.S. embassy in Ghana before coming into the U.S. 2 years ago.\nPlease advice ….",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 0.99,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (AOS)"
    },
 
    {
        "id": "19bfr2g",
        "title": "K1 interview, petitioner birth certificate required?",
        "score": 1,
        "num_comments": 9,
        "author": "JanetYellensFuckboi",
        "created_utc": 1705768705.0,
        "created_readable_utc": "2024-01-20 16:38:25 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/19bfr2g/k1_interview_petitioner_birth_certificate_required/",
        "permalink": "https://reddit.com/r/USCIS/comments/19bfr2g/k1_interview_petitioner_birth_certificate_required/",
        "selftext": "Hi everyone,\n\nJust a quick question. My fiancée and I have our K1 interview this coming Tuesday and we might have run into an issue where I did not bring my original long form birth certificate as the sponsor.\n\n I read online through various websites that only the foreign fiancée had to bring theirs, (from total.law - “Birth certificate- foreign citizen applicants are required to submit birth certificates as part of confirming their ID” | from boundless.com - “Birth certificate for the sponsored fiancé”) but nowhere did I see that the sponsor fiancé birth certificate was required.\n\nHowever, my fiancée is part of a Facebook group where individuals have said the sponsor fiancé birth certificate is required. Can anyone give some clarity regarding this issue? My fiancée is from Mexico, the interview is in Ciudad Juarez. Thanks in advance.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-129F (K1)"
    },

    {
        "id": "18yj4mj",
        "title": "DACA, PIP, and AOS",
        "score": 10,
        "num_comments": 12,
        "author": "mannypipiopi",
        "created_utc": 1704390609.0,
        "created_readable_utc": "2024-01-04 17:50:09 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/18yj4mj/daca_pip_and_aos/",
        "permalink": "https://reddit.com/r/USCIS/comments/18yj4mj/daca_pip_and_aos/",
        "selftext": "**TLDR: Timeline and our (U.S. citizen and DACA spouse) experience with the process from DACA to PIP and AOS.**\n\nHello! My spouse recently received approval for Adjustment of Status (AOS). We started the process in 2022, when we first applied for Parole in Place (PIP) to allow us to apply for AOS. We wanted to share our timeline and answer any questions people may have that are in a similar situation. We received a lot of help from online groups, including this subreddit, and we want to help out in any way we can. We cannot provide legal advice, but we can point you in a direction or share our personal experiences :)\n\n# Timeline\n\n* **Parole in Place (PIP)** \\[\\~11 months\\]\n   * October 2022 - PIP Application (Form I-131) Submitted\n   * November 2022 - Biometrics Appointment\n   * July 2023 - Request for Evidence (RFE) Received and Submitted\n   * August 2023 - PIP Approved (Form I-94 Received)\n* **Adjustment of Status (AOS)** \\[\\~2.5 months\\]\n   * October 2023 - AOS Application Submitted\n   * November 2023 - Biometrics Appointment\n   * December 2023 - AOS Approved\n\n# Parole in Place (PIP)\n\n[USCIS Website on PIP](https://www.uscis.gov/military/discretionary-options-for-military-members-enlistees-and-their-families)\n\n[USCIS Brochure on PIP](https://www.uscis.gov/sites/default/files/document/brochures/Brochure-Immigration_Options_for_Family_of_Certain_Military_Members_and_Veterans.pdf)\n\nAfter our marriage, the only issue keeping us from applying for an adjustment of status was my spouse's lack of legal entry into the U.S. My spouse has maintained residence in the U.S. since receiving DACA about a decade ago. We met with an immigration attorney, and they misinformed us that the only options would be consular processing or applying for Advance Parole (AP). A few online searches later, we stumbled upon Parole in Place and decided to try to apply for it ourselves. I am unsure why this was not mentioned as an option by the attorney, as I am a U.S. citizen and an active-duty service-member, so my spouse qualifies to apply.\n\nWe missed our biometrics appointment since the notice came in the mail after the date for which the appointment was set. We arrived at the local USCIS Application Support Center (ASC) the next day, anyways, to ask if anything could be done. They graciously saw us that day, but we are unsure if this is a standard practice.\n\nWhen we received our Form I-94, a passport-style photo was glued onto the top left corner of the card, covering the \"Departure Record\" and \"Admission Number\" areas. We didn't even know these were behind the photo, and we were confused when filling out the AOS forms that required the \"Admission Number.\" A hair dryer helped soften up the glue and we were able to remove the photo to see the number underneath. Holding the card up to a bright light also allowed us to see the number through the photo, but we needed to remove the photo so we could provide a copy of the card in our application. We wonder if this has happened to anyone else! The photo below is an example of a Form I-94 card that looks the most similar to the one we received.\n\n[Example Form I-94 \\(Source: https:\\/\\/help.asylumadvocacy.org\\/parole-document\\/\\)](https://preview.redd.it/0y9qmo34ogac1.jpg?width=723&format=pjpg&auto=webp&s=db7f8df859fe27f16cc90fa93cdd46f8da2f5ee1)\n\n**Forms Filed (All supporting documents are color copies unless otherwise stated)**\n\n* Form I-131\n* 2 Passport-style Photos\n* Marriage Certificate\n* Military Dependent Card\n* Military Card\n\n**Forms requested by RFE**\n\n* Military service member's statement explaining the reason for requesting PIP\n\n# Adjustment of Status (AOS)\n\nAfter receiving the Form I-94 for the PIP, we filed for AOS ourselves. However, if we didn't have the time to fill our the forms or had any doubts about our case, we would have absolutely found a reputable immigration firm to help us. Luckily, most information is readily accessible online, and the only thing that we really sacrificed was time (and sometimes our sanity).\n\n**Forms Filed (All supporting documents are color copies unless otherwise stated)**\n\n* ***Form I-130 Packet:***\n   * Form I-130\n   * Form I-130A\n   * 2 Passport-style Photos of Petitioner\n   * 2 Passport-style Photos of Beneficiary\n   * Petitioner's Birth Certificate\n   * Petitioner's Passport\n   * Beneficiary's Form I-94 (Parole in Place)\n   * Marriage Certificate\n   * Joint Residential Lease\n   * Joint Bank Account Statement\n   * Joint Auto Insurance\n   * Joint Photos\n* ***Form I-485 Packet:***\n   * Form I-485\n   * 2 Passport-style Photos of Beneficiary\n   * Beneficiary's Passport\n   * Beneficiary's Birth Certificate with Translation\n   * Beneficiary's Form I-94 (Parole in Place)\n   * Beneficiary's Driver's License\n   * Beneficiary's Military Dependent Card\n* ***Form I-864 Packet:***\n   * Form I-864\n   * IRS 1040 for 2022 for Petitioner and Beneficiary\n   * Petitioner's W-2 for 2022\n   * Beneficiary's W-2 for 2022\n   * Petitioner's Military Card\n   * Petitioner's Birth Certificate\n   * Petitioner's Passport\n* ***Form I-693 (Sealed)***\n\nWe wish for the best for everyone, and we are thankful to start off the new year on a high note! If you have any personal questions that you don't want to comment on here, please feel free to DM us and we'll try to get back to you, even if this post is old!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.92,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family"
    },
    {
        "id": "18yeesm",
        "title": "Advise on Multiple Names scenario.",
        "score": 1,
        "num_comments": 1,
        "author": "JGJ5",
        "created_utc": 1704378404.0,
        "created_readable_utc": "2024-01-04 14:26:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/18yeesm/advise_on_multiple_names_scenario/",
        "permalink": "https://reddit.com/r/USCIS/comments/18yeesm/advise_on_multiple_names_scenario/",
        "selftext": "We have a situation where the Birth Certificate ended up having the after-marriage name, hence it is consistent with Passport and marriage certificate.\n\nNeed advise on how the names should be used and whether birth certificate needs to be corrected.\n\n1. Birth Certificate, Passport and Marriage Certificate have \"First Name + Last Name\" (Last Name is husband's Last Name)\n\n2. Throughout the education, only first name was used, so, there is no surname in any of the educational documents.\n\n3. When the child was born in US, Maiden Name was to be specified, so, \"First Name + Last Name\" (Father's Last Name was given). This Last Name has never been used anywhere else, hence there is no document specifying this name other than US born child's birth certificate. There are several documents that contain the First Name and Father's name in separate column that has the Maiden surname.\n\nIs this a concern? How should this be handled?\n\n&#x200B;\n\nThanks for your help.\n\n&#x200B;",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (AOS)"
    },
   
    {
        "id": "18sjyag",
        "title": "Notarized affidavits as proof",
        "score": 4,
        "num_comments": 6,
        "author": "Left-Promise9718",
        "created_utc": 1703734459.0,
        "created_readable_utc": "2023-12-28 03:34:19 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/18sjyag/notarized_affidavits_as_proof/",
        "permalink": "https://reddit.com/r/USCIS/comments/18sjyag/notarized_affidavits_as_proof/",
        "selftext": "I made another post about USCIS accusing a foreigner that he committed fraud in his first marriage and wants to deny his petition with second USC spouse. there is 6 years gap between two marriages. now foreigner is trying to get notarized affidavits from first wife’s family to include as evidence in addition to photos, joint bank statements and bills to prove his innocence.\nDo you think those affidavits are strong evidence? she also has given birth in a marriage to another man’s child, that has caused the fall out. first wife told uscis officer he paid her during interview and withdrew i-130.\nplease let me know your experience with similar situations.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (AOS)"
    },
  
    {
        "id": "18gaxbr",
        "title": "very thorough process DACA--->AOS (married to US citizen) (still waiting)",
        "score": 20,
        "num_comments": 12,
        "author": "Far-Anywhere-8360",
        "created_utc": 1702347017.0,
        "created_readable_utc": "2023-12-12 02:10:17 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/18gaxbr/very_thorough_process_dacaaos_married_to_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/18gaxbr/very_thorough_process_dacaaos_married_to_us/",
        "selftext": "Hi everyone!  I just want to share my experience with you all because I love reading these :)\n\nI came to the US with my parents when I was 3 with a visitor VISA (we overstayed).  I've been undocumented, but that hasn't stopped me! I attended a top University in 2010 as an undocumented student until DACA was passed in 2012 (still \"undocumented\" but at least I can work!  I immediately applied and was approved in 2013. Every two years since I renewed my DACA- I always completed these myself & am happy to help anyone or answer any questions! :)  I am now in tech sales (have been for 7 years, and I am 30 btw).  \n\nI met my partner in 2021, and we got married in July 2022.  He was happy to start the process with me!  I looked at all of the forms for AOS- I-130, 1-131, I-485, I-864 and shopped around some attorneys.  They were charging 6k JUST for advanced parole (in LA) -\\_\\_-, in my opinion, that is ridiculous.  So I decided to do it myself! Below is my timeline. \n\n1. **Submitted form I-130 on 11/29/2022 ONLINE.**  \n\nIncluded:\n\n* 11 photos of us \n* marriage certificate\n* copy of husband's (US CITIZEN) passport\n* copy of his birth certificate\n* marriage license\n* 1 affidavit from my best friend \n* our lease\n* copy of our marriage license\n* Passport-style photos of both of us\n* copy of one joint investment account (very little money)\n   * In hindsight- I think I could've built a much stronger case with more photos, and more financials together (bank, insurance, utility bills etc) however, my application was accepted with no RFEs. \n\n**2. Submitted form I-131 on 12/05/2022 via mail ( advanced parole)** \n\n**VERY IMPORTANT STEP IF YOU HAVE NO RECORD OF COMING INTO THE COUNTRY WITH A BORDER CHECK. Using advanced parole as DACA provides you with a I-94 (arrival- departure) record that is necessary for I-485.**\n\n* form I-131\n* money order\n* two passport style photos\n* statement explaining purpose of travel (to visit my ill maternal grandmother)\n* copy of DACA approval notice (form I-797)\n* Copy of current EAD\n* MY birth certificate WITH translation (I use an online service called [rushtranslate.com](https://rushtranslate.com) for all of these)\n* my mother's birth certificate WITH translation (this is to prove my grandmother is my grandmother)\n* a letter on hospital letterhead signed and dated by doctor- this outlines all of her ailments, her history with diabetes, melanoma, her old age etc etc- it is addressed to USCIS and ends with her doctor's recommendation that she cannot travel at all.  WITH translation.\n* a  personal statement outlining why I would like to see my grandmother, that I am worried she will pass away without seeing me again, etc etc. \n   * **APPROVED ON 03/18/2023** for one month (I went to Mexico and came back a week before it expired). I went through customs, was taken back for additional inspection, they asked me a few questions and stamped my document and passport and I went on my way.  \n   * I later printed my I-94 online [https://i94.cbp.dhs.gov/I94/#/home](https://i94.cbp.dhs.gov/I94/#/home)\n\n**3.  Submitted a PACKET for AOS on 05/19/2023 including the following:** \n\n* I-485 filing fee\n* Receipt notice for I-130 (since we submitted this first and not together)\n* completed signed and sealed medical I-693\n* I-485- complete and signed\n* 2 passport style photos\n* copy of my (beneficiary) passport\n* copy of my birth certificate WITH translation\n* Copy of my I-94 (arrival-departure record from above)\n\nAs far as my affidavit for support- I requested an exemption because I qualify for one. \n\n* cover letter saying I request an exemption\n* completed and signed form I-864W\n* SSA (social security administration) statement of beneficiary (this document can be checked and requested on the SSA website- it calculates if you have worked enough to qualify for SS.  This takes 40 credits. \n* Statement of NON-receipt of public benefits of the beneficiary (me)- this can also be pulled from the SSA website. \n\n**I sent in another I-131 (advanced parole request) but this is still in review.** \n\n**I never received any RFEs.**\n\n**I received a notice for our interview on November 14th- the interview was scheduled for December 14th- then they rescheduled it for the 13th.**  ***That's this Wednesday- STAND BY!*** \n\nokay bye!\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.95,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline: Family"
    },
 
    {
        "id": "186sr5r",
        "title": "HELP! Asked for additional documents. 221g - DS5535. Do we need to mail original documents??",
        "score": 1,
        "num_comments": 5,
        "author": "Due-Jelly-7968",
        "created_utc": 1701273529.0,
        "created_readable_utc": "2023-11-29 15:58:49 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/186sr5r/help_asked_for_additional_documents_221g_ds5535/",
        "permalink": "https://reddit.com/r/USCIS/comments/186sr5r/help_asked_for_additional_documents_221g_ds5535/",
        "selftext": "\n\nHello, \n\nWe have a bit of a complicated immigration case, and we are a bit confused what to do next. \nMy spouse was DQed and had his interview in August 2023. He was given 221g and DS5535 because his visa category was changed. Civil documents and a new DS-260 were needed from my side. \n\nWe submitted all the required civil documents on the CEAC website as instructed. \nI read the form they gave him and it says submit all required ORIGINAL documents. Now do they mean birth cert, marriage cert, police clearance etc? Documents we already submitted on CEAC? \n\nOn the CEAC website the documents we uploaded still says submitted and hasn’t changed to accepted yet. \n\nTried calling and emailing to just make sure what we need to do and if we need to courier the docs but haven’t gotten a reply. Thought I’d ask here. \n\nThankyou",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },


    {
        "id": "17i1j1i",
        "title": "Timeline so far for I-130, I-864, and I-864A Canada to USA",
        "score": 3,
        "num_comments": 13,
        "author": "Last_Fuck_Given",
        "created_utc": 1698452168.0,
        "created_readable_utc": "2023-10-28 00:16:08 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/17i1j1i/timeline_so_far_for_i130_i864_and_i864a_canada_to/",
        "permalink": "https://reddit.com/r/USCIS/comments/17i1j1i/timeline_so_far_for_i130_i864_and_i864a_canada_to/",
        "selftext": "Hay there, everyone.\nI’m a very anxious person to begin with so I figured I’d let you all know my timeline to help other anxious individuals. (Please use this information for an approximate estimate and not a true estimate as timelines may vary.)\n\nWe sent in our documents the first week of February 2022, but got our packet back after an additional 2 weeks because of payment issues, we had to figure that out then were able to send it back first week of March 2022 and heard back from NVC after another 2 weeks.\n\nAfter this we simply waited to get papers together and build up more of a fund for any fees needed for the trip. During this time we got approved by USCIS in April or 2023.\n\nWe sent in additional paperwork June of 2023 and finally heard back from NVC in September of 2023.\n\nIn the email from September of 2023 we were given our interview appointment date and additional instruction to make sure we were ready for things like booking the medical appointment, making sure we had the proper papers to bring in and booking flights and hotel for the time we were needing to stay in Montreal.\n\nAs of now I have had my medical. It lasted roughly 2.5 hours, I needed to get 1 vaccine(an additional chicken poxx), blood drawn, X-ray and a pee test done as well as a physical. All very short procedures with 3 different people. My vaccine location had a slight reaction of discomfort and irritation but no fever or break out and my interview is on November 2nd and will update you all when I can.\n\nWE GOT ACCEPTED!!\n\nSo I got to the building at 9:30 for my appointment at 9:45. They give you a small piece of paper with a number and your are supposed to go to the window assigned when your number pops up on the screen they have. I was able to go right away, giving my birth certificate, photo and passport as well as questions that I had took about 10ish minutes if that. They then had me sit in waiting for about an hour and 30 and had like a 3 minute conversation before they told me I was accepted and good to go. so about 2 hours total.\n\nUPDATE!!!\n\nSo my passport was sent out (back home) a day after my appointment, went super well and the passport actually beat me home by like 6 days.\nOn top of that besides weather conditions messing up my flying schedule things also went really well. Slight storm delay, but hay! what can you do.\n\nGreen card arrived roughly 2 months after my landing date. But was sent the wrong card. Waiting to hear back from them (Hopefully by the 8th of April)\n\nHope this helps!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "17ezbhl",
        "title": "Im traveling by plane to Mexico from United States I’m trying to do a correction on my birth certificate because of a problem with my dual citizenship in Mexico",
        "score": 1,
        "num_comments": 1,
        "author": "FierroDz",
        "created_utc": 1698106219.0,
        "created_readable_utc": "2023-10-24 00:10:19 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/17ezbhl/im_traveling_by_plane_to_mexico_from_united/",
        "permalink": "https://reddit.com/r/USCIS/comments/17ezbhl/im_traveling_by_plane_to_mexico_from_united/",
        "selftext": "So on my birth certificate my mothers maiden name is in my middle name I’m a Mexican American I’m not sure if this problem is just me or others as well so what I’m trying to do is get my mothers maiden name after my last name since we use both of our parents last name in Mexico well my name in mexico is messed up my mothers maiden name is first then my actual last name I trying to fix this because God willing my son will be born soon and well he’ll take my mothers maiden name and not mine",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },
    {
        "id": "17d50s1",
        "title": "Can I apply for U.S passport after my n600 got denied?",
        "score": 2,
        "num_comments": 33,
        "author": "Ihaveabadheadachern",
        "created_utc": 1697901890.0,
        "created_readable_utc": "2023-10-21 15:24:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/17d50s1/can_i_apply_for_us_passport_after_my_n600_got/",
        "permalink": "https://reddit.com/r/USCIS/comments/17d50s1/can_i_apply_for_us_passport_after_my_n600_got/",
        "selftext": "Hello, to explain my situation, i have a biological father who has been a US citizen thru naturalization before I was born.  I was born abroad and my dad what he says “forgot to report my birth to US”?? I honestly don’t know how to explain it in more professional way haha.  I got my green card back in 2012 when I was a teenager and this year I applied for naturalization for citizenship but got denied, and USCIS notified me that apparently it was already denied in 2016 which I had no idea about.  So i sent my i290B form to reopen to the office last month but there has been no update on USCIS website on my account about receiving it, or needing my payment yet so hoping I just need to be patient with that.  While waiting that to process I couldn’t resist this anxiety so I made a reddit account to research further more.  Then I saw this one post that was pretty similar to my situation and some of the comment recommended to apply for the U.S passport and that kind of clicked in my head because when I got my green card, the agent who interviewed me told my dad that I could apply for passport and if I get it I wouldn’t have to file n600?? But mine got denied.  \nSo I want to know if I apply for U.S passport, is it given for me that it will be denied? Or worth a chance?\nAlso how long does I290B take to even make record on my account? Or did I file it wrong? Haha\nAny advise would be appreciated, thank you in advance!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },

    {
        "id": "15o7v1b",
        "title": "I130 living with husband in Mexico, and online application",
        "score": 1,
        "num_comments": 1,
        "author": "Spirited-Motor-6110",
        "created_utc": 1691757640.0,
        "created_readable_utc": "2023-08-11 12:40:40 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/15o7v1b/i130_living_with_husband_in_mexico_and_online/",
        "permalink": "https://reddit.com/r/USCIS/comments/15o7v1b/i130_living_with_husband_in_mexico_and_online/",
        "selftext": "Good Morning,\n      First thank you to this community - I’ve already learned so much, I just wanted to share where we have started and get some feedback.\n      I am from the US (citizen/born) and have been a resident in Mexico for 3 years (official resident).  I work for an airline, and I met my husband in December 2021.  We married in June ‘23 and applied for I130 in July 3,2023. I know we will have a year or so wait, but that’s expected .  We live with his parents in Mexico City,\nWhen I applied I used the online systems , it was pretty straight forward processed although I did notice it populated address dates a little weird when I clicked the electronic filed version of the i130. I expected it may have been an issue , so before I submitted I included an explanation of how I own a home in Mexico and the USA and commute between the countries and clarified we live together in Mexico City. \n    He is a doctor here, and luckily my routes with my job give me layovers here in Mexico City .  When it came to evidence I threw everything but the kitchen sink at them, including not only photos, and letters all the usual but copies of him being the beneficiary on everything from my life insurance to my 401k and will. He has very little so there isn’t much he could submit , but  I am blessed to know that he will be taken care of if something happens to me. I even submitted a translated letter from the Mexican Government Institute of Nacional Migration (USCIS Mexican equivalent), that acknowledged that my civil status changed from single to married to a Mexican National. I even documented every single flight for work and flight for commuting and pleasure to Mexico City . Literally hundreds. We even went to the US consulate here in Mexico City and swore an affidavit from my company that we are domestic partners  so he may enjoy some of my flight benefits .\n   I intend to continue to update photos documents and evidence each month as they allow it on the website (USCIS). I will be moving back to USA in spring or fall of 2024 at the latest so there may be a time when we are separated but we are doing everything we can to avoid any pitfalls. I am going to finish nursing school. \n  I have read so many amazing storied on here, and hope to join the many successes. We did not use an attorney but plan to tap one if need be. The I130 with consular processing has really turned out to be the best option for us , because he can continue to work here and I can be here, I really look forward to bringing him home and he can begin the process of becoming a physician in the USA.\n Neither of us have any criminal records and he’s never been to the USA thus no immigration issues. \nWhen we got married Mexico City did put my last name as the name on my birth certificate , but I was married and got a divorce before (to a US citizen) so I have a hyphenated last name now. So I had to get my previous marriage license apostilled and translated into Spanish so CDMX can correct it , and I will submit that to USCIS. I’m trying to think of everything possible to avoid any issues. \n\nSo what do you think ? Any comments and questions are welcome. THANK YOU again for sharing your happiness and heart aches, we’re all in this together.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
    {
        "id": "15noy7s",
        "title": "Help - fastest way for Mexican National to enter US? Her husband is in critical condition.",
        "score": 6,
        "num_comments": 7,
        "author": "Kaizen777",
        "created_utc": 1691702804.0,
        "created_readable_utc": "2023-08-10 21:26:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/15noy7s/help_fastest_way_for_mexican_national_to_enter_us/",
        "permalink": "https://reddit.com/r/USCIS/comments/15noy7s/help_fastest_way_for_mexican_national_to_enter_us/",
        "selftext": "Hi!  My g/f's aunt is a citizen of Mexico.  She just found out her husband is hospitalized in critical condition.  What's the fastest way she can legally enter given the circumstances?  Is it humanitarian parole?  What's the fastest this can happen?  My g/f seems to think she can bring evidence of her husband's condition to the border and be admitted.  I don't think so!    \nAgain he's in critical condition and the prognosis is not good.  Thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NIV (Visitor)"
    },
  
 
    {
        "id": "15hqnfs",
        "title": "Permanent Address",
        "score": 1,
        "num_comments": 8,
        "author": "Fearless_Original520",
        "created_utc": 1691125439.0,
        "created_readable_utc": "2023-08-04 05:03:59 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/15hqnfs/permanent_address/",
        "permalink": "https://reddit.com/r/USCIS/comments/15hqnfs/permanent_address/",
        "selftext": "Is it big of an issue if the permanent address mentioned in birth certificate differs from the permanent address given in the passport?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },

    {
        "id": "12rgq6e",
        "title": "Are some of you guys who are filing for a spouse outside the US currently separated or living in your spouses country?",
        "score": 6,
        "num_comments": 8,
        "author": "Difficult-Ad-9789",
        "created_utc": 1681878503.0,
        "created_readable_utc": "2023-04-19 04:28:23 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/12rgq6e/are_some_of_you_guys_who_are_filing_for_a_spouse/",
        "permalink": "https://reddit.com/r/USCIS/comments/12rgq6e/are_some_of_you_guys_who_are_filing_for_a_spouse/",
        "selftext": "I (US citizen) am currently filing for my husband whose from Mexico we have a 7 month old baby and I recently returned to the Us because our lawyer recommended that I go back to the USA to work and have bills in my name to prove to Uscis that I’ve been I guess residing in the Usa because supposedly me staying with my husband and not working would likely get my case denied. However I’ve seen many people living with their spouses in their home country waiting for their cases and was wondering if anybody here is currently waiting with their spouses in their home country and if you’ve been told something similar. Lately being separated has really gotten to me and him and I’m considering just going back to Mexico with my baby and waiting it out there with my husband and hopefully with a additional sponser our case would be okay. He’s already missed the birth and the first three months of her life I don’t want him to miss the next one or even two years of her life.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Standalone)"
    },
  
    {
        "id": "1285i2z",
        "title": "Birth of U.S Citizen Abroad",
        "score": 2,
        "num_comments": 9,
        "author": "12kaboom",
        "created_utc": 1680308868.0,
        "created_readable_utc": "2023-04-01 00:27:48 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1285i2z/birth_of_us_citizen_abroad/",
        "permalink": "https://reddit.com/r/USCIS/comments/1285i2z/birth_of_us_citizen_abroad/",
        "selftext": "I am not sure exactly how to go about this question. My mother in law was born in Mexico. She went through the immigration process and became a US citizen in 1996.\n\nHowever, her biological mother was a US Citizen by birth (born in California). It would mean a lot more for my mother in law to have been a US citizen by birth, since she was born to an American.\n\nIs it possible to have her citizenship status changed? Even though, yes, she is a US citizen she would like to be considered legally as a US citizen by birth. It’s more of a “pride” thing. Can this be done?\n\nThanks in advance for any and all information, I appreciate it.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },

    {
        "id": "11hhlyo",
        "title": "Can I apply for a US passport?",
        "score": 0,
        "num_comments": 0,
        "author": "Practical-Card488",
        "created_utc": 1677883679.0,
        "created_readable_utc": "2023-03-03 22:47:59 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/11hhlyo/can_i_apply_for_a_us_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/11hhlyo/can_i_apply_for_a_us_passport/",
        "selftext": "I am currently in the US on a f1 visa. My mother was born in the US and lived here for more than 365 days but less than 5 years. Due to the supreme courts ruling of sessions vs morales Santana in 2017, there was confusion whether the new 5 year rule would be held in effect for me since I was born before 2017. Even lawyers have given different answers.. As far as I’ve read because I was born out of wedlock the 365 days should apply. Does anyone have some guidance on this - would be much appreciated! At this point I’m inclined to apply with my mothers birth certificate, my birth certificate and form ds5507 but not sure.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
 
 
    {
        "id": "za12wx",
        "title": "Any experts here? My wife needs some documentation for a job offer",
        "score": 1,
        "num_comments": 0,
        "author": "knoxcreole",
        "created_utc": 1669931522.0,
        "created_readable_utc": "2022-12-01 21:52:02 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/za12wx/any_experts_here_my_wife_needs_some_documentation/",
        "permalink": "https://reddit.com/r/USCIS/comments/za12wx/any_experts_here_my_wife_needs_some_documentation/",
        "selftext": "She's a permanent resident alien. She's lived here her whole life and has worked/paid taxes since 96. She got her right-to-work papers from the DHS but that isn't enough. She kept her social/green card together and lost them both. She put in for a new card back in June and she's still waiting (obv) for a replacement. Without her green card, she can't get her social. She's given every bit of info this job offer needed but they want to see a social security card. She got her father to find her birth certificate and he's sending that up. Are there any options for a temporary proof of social security card or anything we're missing here?\n\nThanks",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Social Security Support"
    },
   
    {
        "id": "xv30tt",
        "title": "Strength of Physical Presence case",
        "score": 2,
        "num_comments": 0,
        "author": "SamuelTheKitty",
        "created_utc": 1664850957.0,
        "created_readable_utc": "2022-10-04 02:35:57 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/xv30tt/strength_of_physical_presence_case/",
        "permalink": "https://reddit.com/r/USCIS/comments/xv30tt/strength_of_physical_presence_case/",
        "selftext": "Hello r/USCIS,\n\nI am assembling a citizenship claim for my spouse under INA 309 (c), for which I need to demonstrate continuous physical presence of her mother (deceased) for one year any time prior to my spouse's birth.\n\nI have largely assembled the case, believe I have met the required burden of proof, and am preparing to submit it to the Consulate. That said, additional opinions as to if I have gathered enough evidence for physical presence would be helpful.\n\nThe transmitting US citizen parent (mother) spent the first seven years of her life in the USA. Given this young age, I have not been able to gather much in the way of direct evidence regarding the transmitting parent. However, I have established by way of subsequent birth certificates and a tax lien document the physical presence the transmitting parent's mother over a period of time.\n\nThe best evidence I have are documentation of the divorce proceedings of the transmitting parent's parents. The first document, dated October 1966 is an interlocutory judgement of divorce which names the transmitting parent, and orders her into the \"care, custody, and control\" of her mother. The second document, dated September 1967 is a final judgement of divorce and reaffirms the custody of the transmitting parent to the mother. The final document, dated August 1967, is a modification of the final judgement of divorce. It outlines the current circumstances of the two parents (including the living arrangements of the transmitting parent and her mother, and the fact that her mother could not obtain employment due to caring for the children), indicates neither parent are in violation any previous judgements, and grants custody of the transmitting parent to the father.  \n\n\nGiven these are court documents that outline that the transmitting parent was in the custody of an individual who was clearly present in the USA over two year period, in addition to the pattern of evidence of physical presence leading up to these events, I believe this is pretty strong evidence. Am I correct in this assessment? I understand that the standard of proof in this case is the preponderance of the evidence. Considering that fact, I can't fathom how that burden hasn't been met, but I'm willing to be told otherwise in which case, I will attempt to gather more evidence.\n\nThank!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "USCIS Support"
    },
 
    {
        "id": "wrzqox",
        "title": "CRBA application still under processing after passport was issued for the baby",
        "score": 2,
        "num_comments": 9,
        "author": "Subject_Ad_927",
        "created_utc": 1660869547.0,
        "created_readable_utc": "2022-08-19 00:39:07 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
        "permalink": "https://reddit.com/r/USCIS/comments/wrzqox/crba_application_still_under_processing_after/",
        "selftext": "I am a U.S citizen by Naturalization and my wife is not. My wife gave birth to our second child in May 2022 in Mexico as we are still waiting for her I-130 approval(my wife). I filed out the application for CRBA online and choosed Mexico city as interview location, made the payment online. Few days later I received an email from U.S Embassy in Mexico city with interview appointment date scheduled in August(application was filled  in May), I tried to get earlier appointment but they told me that there is no earlier appointment that I can try to see if other consulate have opening , I checked the online system and we were lucky to find May 26 appointment at the U.S consulate in Merida.Scheduled another interview and asked Merida to request that Mexico city transferred our online application to Merida, they did and we went for the interview with all documents, officer at the interview told us that everything was fine and we request for an emergency passport for our daughter, the U.S passport was issued the same day, officer told us that our approved documents will be transferred to Mexico city for them to issue the CRBA since the online payment was made to them. In July I received email from U.S embassy in Mexico city asking for more proof of presence in the U.S, I sent 6 years of my credit card bills and also my bank statement as requested, few days later they contacted me and ask for more proof like travel history, I sent them record from the CBP with travel record from 2011-2021 (that was what FOIA/CBP sent me) Yesterday I received a call from them again that the assistant consul still need more documents but they did not say which documents. My question is, is this normal? My daughter already have a U.S emergency passport issued by the U.S consulate in Merida Mexico and valid for 1year, can the officer at the U.S embassy in Mexico city denied my daughter's CRBA application even though she already have a U.S passport? I got my citizenship last year and I travel on business trips from time to time but maintain physical presence in the U.S.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },


    {
        "id": "wetoim",
        "title": "Im a US citizen my gf is from Mexico can me and my gf get married on her tourist visa here if there's no intent to stay afterwards I plan to go to mexico after anyways and stay there. it's just easier to get married here because in mexico they require birth certificate and mine has a patronymic nam",
        "score": 1,
        "num_comments": 10,
        "author": "Cold_Ad5055",
        "created_utc": 1659491552.0,
        "created_readable_utc": "2022-08-03 01:52:32 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/wetoim/im_a_us_citizen_my_gf_is_from_mexico_can_me_and/",
        "permalink": "https://reddit.com/r/USCIS/comments/wetoim/im_a_us_citizen_my_gf_is_from_mexico_can_me_and/",
        "selftext": "Im a US citizen my gf is from Mexico  can me and my gf get married on her tourist visa here if there's no intent to stay afterwards I plan to go to mexico after anyways and stay there. it's just easier to get married here because in mexico they require birth certificate and mine has a patronymic name in it so it's better we get married here and I'll just go to Mexico after , there no intent to get her a green card here , she'll leave right after we get married \n\nis that ok?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },
  
    {
        "id": "w8y74y",
        "title": "Do I fill out the N-600 or N-400 form?",
        "score": 2,
        "num_comments": 2,
        "author": "machinaOverlord",
        "created_utc": 1658877189.0,
        "created_readable_utc": "2022-07-26 23:13:09 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/w8y74y/do_i_fill_out_the_n600_or_n400_form/",
        "permalink": "https://reddit.com/r/USCIS/comments/w8y74y/do_i_fill_out_the_n600_or_n400_form/",
        "selftext": "My deceased biological dad is an American citizen, met my mom in another country and got married there and given birth to me. I lived in my birth country for a while with its citizenship before moving to the US with a permanent residency status. After my biological dad died of a heart attack, my mom met someone else here in the US and is also an american citizen.\n\nShould I fill out the N-600 form or the N-400 form since N-600 form says that \" you were born outside the United States to a U.S. citizen parent\" However, there was also a point that says \"You must be living in the United States in the legal and physical custody of your U.S. citizen parent\". Does the \"U.S citizen parent\" meant that I must be living with my biological dad or it doesn't matter? Also, I am an adult now, does that change anything?\n\nI saw the application fee to be over 1k so I wanted to make sure that I am right before continuing on. Thank you for any help!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.76,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
  
    {
        "id": "uut756",
        "title": "Consular Record of Birth Abroad and Passport",
        "score": 3,
        "num_comments": 2,
        "author": "Snoo-94705",
        "created_utc": 1653158324.0,
        "created_readable_utc": "2022-05-21 18:38:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
        "permalink": "https://reddit.com/r/USCIS/comments/uut756/consular_record_of_birth_abroad_and_passport/",
        "selftext": "I've been trying to schedule an appointment for a CRBA and passport for my daughter for months now.\n\nEvery time that I go the appointment scheduling [link](https://evisaforms.state.gov/Instructions/ACSSchedulingSystem.asp) for the U.S. Consulate General in Tijuana, Mexico, there are no available slots.\n\nBecause of this, I have not been able to bring her into the U.S. since her birth more than seven months ago.  I am having to constantly travel between Chicago and Tijuana to be able to see my daughter.\n\nI have all documentation ready and on hand and I would like to see if I can get the process started as soon as possible.  Any ideas?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
    {
        "id": "us4hqx",
        "title": "I need help with an apostille living abroad.",
        "score": 2,
        "num_comments": 1,
        "author": "Thaidakelsier",
        "created_utc": 1652847225.0,
        "created_readable_utc": "2022-05-18 04:13:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/us4hqx/i_need_help_with_an_apostille_living_abroad/",
        "permalink": "https://reddit.com/r/USCIS/comments/us4hqx/i_need_help_with_an_apostille_living_abroad/",
        "selftext": "I plan on getting married in Mexico with my GF (She is Mexican) but apparently I need to apostille my Consular report of birth abroad ( I was born in Tijuana, México. My dad was American, that's how I got the citizenship) Any idea of how I can get it apostilled? I would appreciate any advice,  I'm a bit lost because of my specific situation.\n\nGreetings\n\nP.S. Living in Mexico city ATM.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    }
 
]