[
    {
        "id": "1jf57h3",
        "title": "Difficulty accepting that I may need to move out of the US bc of erosion of trans rights and acceptance",
        "score": 26,
        "num_comments": 69,
        "author": "Sea_Abbreviations287",
        "created_utc": 1742411916.0,
        "created_readable_utc": "2025-03-19 19:18:36 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1jf57h3/difficulty_accepting_that_i_may_need_to_move_out/",
        "permalink": "https://reddit.com/r/expats/comments/1jf57h3/difficulty_accepting_that_i_may_need_to_move_out/",
        "selftext": "To preface this, I'm a dual citizen of the US and Chile who grew up in Chile, moved to the US for college and have mostly lived here ever since. I also have had stints of living in Mexico, Singapore and Japan. I'm fluent in English and Spanish and speak some Mandarin. However, my (cis) partner is a US citizen, has never lived abroad/barely traveled abroad and only speaks English.\n\nLiving outside of the US on its own is not a problem, but I hate that I'm feeling forced to make plans to leave my home because of the constant attacks on transgender folks coming from the Trump administration. Despite all of America's flaws, I love my life in the US. I have a great job, live very comfortably, amazing friends, half of my family lives here, and get to admire the stunning beauty of the PNW every day. Given my dual citizenship and having lived abroad, I've always considered living in the US as a decision I actively choose to make and that if I wanted to live else where in the world, I can likely make it happen. Where there's a will, there's a way kinda thing - with limitations of course.\n\nIt's just heartbreaking that I'm having to make a decision if I want to stay here for my personal safety. I don't want to leave the life I've created for myself over the past 15 years. I'm lucky that my state has strong protections, but the Trump admin is repeatedly showing its disregard for the rule of law and I highly doubt they are going to slow down on trampling on civil liberties. The most difficult part about this is having my partner come with me. She's always lived near her immediate family, and is struggling with the idea of potentially moving to a non-English speaking country, despite recognizing the move would be likely a last-minute decision if the worst comes to happen for safety purposes. The options she's been the most receptive to are Canada, New Zealand and the UK, specifically Scotland, but none of them are particular easy or quick to emigrate to.\n\nOur most easiest options for a move to an LGBTQ friendly country are Chile or Portugal. Mercosur countries would also be easy, with Uruguay being the only one I'd truly consider. It's possible that I could get a skilled worker visa without having to change jobs (I work remotely) - looking primarily at Canada and Australia - or get job sponsorship for immigration purposes, though that would require switching positions.\n\nIs anyone trans and/or queer and are dealing with similar feelings of being pushed out of your home country because of politics? Do people have any advice on how to make my partner more comfortable with a potential move abroad to a country that she doesn't particularly desire to go to/is afraid of a ton of culture shock? I guess I'm looking for some solidarity or words of encouragement during these tough times..",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.55,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": "PNW"
        },
        "sex": null,
        "document": null
    },
    {
        "id": "1jdlbwf",
        "title": "I'm afraid for my partner to travel to the US even though I'm American.",
        "score": 100,
        "num_comments": 151,
        "author": "DueDay88",
        "created_utc": 1742239536.0,
        "created_readable_utc": "2025-03-17 19:25:36 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1jdlbwf/im_afraid_for_my_partner_to_travel_to_the_us_even/",
        "permalink": "https://reddit.com/r/expats/comments/1jdlbwf/im_afraid_for_my_partner_to_travel_to_the_us_even/",
        "selftext": "My partner is from a developing country with a weak passport but has active US tourist and B1 visa. He has a work-related conference in the US coming up in about a week. He is highly educated with a PhD from the U.S., a professor and journalist, and was invited to attend this basically as training. It's a huge deal and he is very excited about it. He has a letter of invitation from the international organization whose headquarters for this region are based in D.C.\n\nWe are at a stage of relationship where we are planning to begin a family. We are saving for a home. We have a life here and I have no intention or interest to return to the US and even cancelled my trip for later this year. I am fully invested in our relationship, we have two pets and we share all the important core values.\n\nAfter I read about the Brown university professor who was detained and deported despite having an active H1B visa and a court order halting her deportation, and the German tourist who was detained by CBP, I am afraid for my partner to go to this conference in the US. I have been sending him articles about these situations. I am also angry at this international organization that has invited multiple people from developing countries in Latin America to come to the U.S. for the 3 day conference despite everything going on when it would have been easier and made more sense to meet in Mexico. The organization is based in Europe so it's not even an American org. \n\nI am also a person of color so I generally don't trust law enforcement in the US and know that not truly being a threat does not matter, especially now with the changes that allow detaining foreigners without due process. I have this terror that he will go and dissappear and maybe be shipped off to an El Salvador prison the administration is paying to detain people who will probably never be released or seen ever again.\n\nCan someone please share anything that can help? Am I being ridiculous? We have been arguing about it and he is frustrated with me, especially because I'm American and don't want him to go to my own country which  admit sounds weird.  But I am afraid he might be underestimating the risk. I also am concerned I might be overreacting. He sad it's driving him crazy and even cried about how stressful my fear is for him. He has said I'm not being supportive of this huge opportunity he earned (and he has earned it and I am proud). Tbh if he was going to any other country I would not feel this way. \n\nIt's just hard to know what to expect and how to act under these circumstances. And me being an immigrant myself and from the US makes it even more complicated.\n\n**UPDATE**: Thank you to everyone who offered validation and level-headed reassurance and ways to think through this. I apologized for letting my fear cause him so much distress, and he has expressed that I'm right to be worried, he is too and he is now leaning towards not going after some further reflection. He has reached out and let the organization know this to see if there are alternatives to the location or other ways to participate given the unpredictable and rapidly changing US border situation. I'm feeling less stressed since we're back on the same page. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.72,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "General Advice",
        "us_president": "Donald Trump",
        "location": null,
        "sex": null,
        "document": null
    },
    {
        "id": "1iedo2r",
        "title": "State & Federal Apostilles",
        "score": 0,
        "num_comments": 1,
        "author": "Such-Biscotti-4314",
        "created_utc": 1738326510.0,
        "created_readable_utc": "2025-01-31 12:28:30 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1iedo2r/state_federal_apostilles/",
        "permalink": "https://reddit.com/r/expats/comments/1iedo2r/state_federal_apostilles/",
        "selftext": "I will need a federal apostille sent to Washington DC on my FBI background check before I can apply for a temporary residency visa for a foreign country. I know it can take several weeks for an apostilled document to be returned from Washington DC, and since I want to move quickly I want to mail my stuff in today.\n\nOn the apostille request form I need to include with my background check, there is a question that asks which country the document will be for. Is it okay to write in it is for a “Hague convention/Apostille convention country” rather than the specific country’s name?\n\nI will definitely be applying to a country that is in The Hague Convention, but I am still deciding between the final contenders (Spain, Mexico, Costa Rica or Uruguay). \n\nI know I could probably try calling or emailing Washington to ask, but I figured I might be able to get a speedier answer here.\n\nI am not as concerned about the state apostille-\nMy state should have a faster turnaround time for doing an apostille for my birth certificate. It is close enough that I will probably go in person so they can answer any questions I might have about that. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "Apostille (FBI background check, birth certificate)"
    },
    {
        "id": "1h6l0rs",
        "title": "Youth summer programs?",
        "score": 0,
        "num_comments": 3,
        "author": "Own_Cupcake1855",
        "created_utc": 1733331638.0,
        "created_readable_utc": "2024-12-04 17:00:38 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1h6l0rs/youth_summer_programs/",
        "permalink": "https://reddit.com/r/expats/comments/1h6l0rs/youth_summer_programs/",
        "selftext": "First, some background: My wife works in K-12 education and we have 3 small children (ages 7, 4 and 2). Every summer they are on break from mid-May through early August. We live in the Midwest and summers here are very hot. We spend every spare second in our pool or at the lake. Having grown up with a pool and a mom who also teaches swimming lessons, our kids love the water. We love to vacation in Mexico and the Caribbean. Some of our favorite spots that we have been to are Isla Mujeres, Cozumel, Jamaica and St Lucia. Roatan and the USVI are next on our list of places to visit.\n\nGiven that my wife and kids have summer break and I have the ability to work remotely for short periods of time (up to about 30 days or so, as needed) we’ve been kicking around the idea of doing an extended vacation this summer or summer of 2026 before the kids start getting too busy with sports, friends, etc. I’m thinking we‘ll go somewhere in the Caribbean, find a month long rental, and stay for 30 days or so. The goal would be to allow the kids to experience a different culture, make some new friends, and sneak in some quality family time near some clear blue water. With this, we’d also love to find some kind of structured fun/learning/day camp experiences for our kids. In doing some research, I stumbled across this Junior Ocean Explorers program put on by the University of the Virgin Islands. Basically, a program for elementary aged kids to learn more about the ocean and marine biology. The incorporate swimming, snorkeling, learning about different plants and animals, etc.\n\nSomething like this would be absolutely perfect for our older two kids, however, it appears they would not be eligible as we don’t live in/have family in the Virgin Islands and that is one of the eligibility requirements. With that, I’m wondering if there are any other programs out there that would offer a similar type of experience? Basically, we’re hoping to find something fun and educational, ideally somewhere in the Caribbean, where our kids can try something new and make some new friends in the process. Bonus points if it involves the water, but that wouldn’t be a requirement. It doesn’t need to be 4 full weeks, and doesn’t have to be an all-day thing. If we can‘t find anything like this, we may start looking at some of the Montessori schools on the various islands to see if they offer any type of part-time summer programs. We really just want to give the kids an opportunity to experience something new and make some new friends in the process.\n\nThanks in advance for any thoughts/suggestions!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": "Midwest"
        },
        "sex": "Hombre",
        "document": null
    },
    {
        "id": "1gwx9my",
        "title": "Sloooooow travel and documents ",
        "score": 0,
        "num_comments": 3,
        "author": "Mystere_Miner",
        "created_utc": 1732242341.0,
        "created_readable_utc": "2024-11-22 02:25:41 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1gwx9my/sloooooow_travel_and_documents/",
        "permalink": "https://reddit.com/r/expats/comments/1gwx9my/sloooooow_travel_and_documents/",
        "selftext": "Something I’m wondering about.. I’m planning to spend several years slow traveling.  And by that I mean a year or more in one of several places.\n\nI’m thinking about traveling between Europe, sea, and South America.  But I’d rather have long term visas and possible residency to make it easier.\n\nMy concern is, to get long term visas or residency, you typically have to have recent documents, like criminal background checks.  I don’t want to have to go back to the U.S. in between to get new checks run every time I’m going to a new country to stay for a year.  How long are apostilles good for anyways on birth certificates or marriage certificates?\n\nHow do those Capital nomad guys get residency so easily when they’ve given up their citizenship in the U.S.?\n\nI’m just confused on how you manage to provide recent docs when you move around.\n\nHow do others handle this?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Visa / Citizenship",
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "Visa / Residency documents (background check, apostille)"
    },
    {
        "id": "1glr0l0",
        "title": "Has anyone gone back to their home country to give birth? ",
        "score": 0,
        "num_comments": 2,
        "author": "Singlemama2b",
        "created_utc": 1730987844.0,
        "created_readable_utc": "2024-11-07 13:57:24 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1glr0l0/has_anyone_gone_back_to_their_home_country_to/",
        "permalink": "https://reddit.com/r/expats/comments/1glr0l0/has_anyone_gone_back_to_their_home_country_to/",
        "selftext": "Living and working in Mexico and trying to decide whether to give birth here and register a birth abroad, or plan to go back to the US to give birth. \n\nCurrently I meet eligibility to pass citizenship to my daughter through birth but I’m worried with the political climate whether that could change or she could later have fewer rights in the US if she were born in Mexico/has Mexican dual citizenship. \n\nOn the other hand, if she were born in the US it might be hard to get her a Mexican visa quick enough for me to return to work with her here? If anyone has experience with Mexican visa issues for dependents. I’m on a permanent residency for work purposes. \n\nAll insights welcome thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.36,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "General Advice",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Mujer",
        "document": "Citizenship/Visa documentation for child born abroad"
    },
    {
        "id": "1frxoy6",
        "title": "Help needed - Apostille for Mexican Birth Certificate ",
        "score": 1,
        "num_comments": 1,
        "author": "Alex1980C",
        "created_utc": 1727589520.0,
        "created_readable_utc": "2024-09-29 05:58:40 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1frxoy6/help_needed_apostille_for_mexican_birth/",
        "permalink": "https://reddit.com/r/expats/comments/1frxoy6/help_needed_apostille_for_mexican_birth/",
        "selftext": "My husband is US citizen, born in Mexico. I am Austrian and want to apply for my baby‘s Austrian paperwork. We need to submit both parents‘ birth certificates and all foreign documents for use in Austria need an apostille. The US docs, no problem. But does anybody know how to get that Mexican BC apostilled, and where? My research online led nowhere. And I’d rather not just mail original documents around if I am not certain as to where they need to go. All I found out was that Mexican embassy in the US won’t do apostilles. I am just looking for maybe someone having a similar case and can share experience.  THANK YOU ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": "Mujer",
        "document": "Apostille (Mexican Birth Certificate)"
    },
    {
        "id": "1fpw4tg",
        "title": "Mexican Consulate won’t grant me INE or Passport because my Mexican Birth Certificate does not have second last name (Mother’s last name)",
        "score": 0,
        "num_comments": 1,
        "author": "Alternative-Ease3116",
        "created_utc": 1727357129.0,
        "created_readable_utc": "2024-09-26 13:25:29 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1fpw4tg/mexican_consulate_wont_grant_me_ine_or_passport/",
        "permalink": "https://reddit.com/r/expats/comments/1fpw4tg/mexican_consulate_wont_grant_me_ine_or_passport/",
        "selftext": "I am a US citizen living in Ireland, and I’ve been granted Mexican citizenship by descent through both Mexican parents. I have my Mexican birth certificate, both parents names and birth dates are correct, but because I did not use my mother’s last name along with my father’s then the consulate said this is an issue and they need to speak with Mexico City about what to do about this. \n\nI’m 100% sure that I’m not the only one with only my father’s last name as I’ve been raised in US and every single document I have only has my father’s last name. This would also have conflicting issues with my current EU immigration if I was to suddenly have dual citizenship documents with a second last name different to what I’m currently registered with now. The embassy has been cooperative, but with no real time frame in sight when we can find a solution. \n\nIs there anyone here who has seen or heard a similar situation? \n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Visa / Citizenship",
        "us_president": "Joe Biden",
        "location": {
            "country": "Ireland",
            "state": null
        },
        "sex": null,
        "document": "Mexican INE / Passport / Birth Certificate (name issue)"
    },
    {
        "id": "1f9p4zt",
        "title": "Applying for citizenship as person born abroad, over 18 years of age",
        "score": 0,
        "num_comments": 3,
        "author": "dirtynikeairs",
        "created_utc": 1725549889.0,
        "created_readable_utc": "2024-09-05 15:24:49 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1f9p4zt/applying_for_citizenship_as_person_born_abroad/",
        "permalink": "https://reddit.com/r/expats/comments/1f9p4zt/applying_for_citizenship_as_person_born_abroad/",
        "selftext": "Good Afternoon, r/expats,\n\nI am honestly feeling kind of lost right now, which is why I'm asking on this sub. I hope you guys, some of you pretty familiar with immigration processes, might be able to point me into a direction of who to talk to etc. - if not, I'm sorry to have posted in the wrong subreddit, and thank you for potentially reading my post.\n\nBasically, the title summarizes it pretty well. I am 22 years old, having been born and raised in Germany to an American father and German mother. I am fairly certain I did not automatically obtain citizenship at birth due to my dad not meeting the residency requirements (5 years in total LIVING in the US, with two of the years being completed after the 14th birthday). He never filed a CRBA, or form N600K. Still, he is a US citizen, having and having kept ONLY the US Citizenship (despite living in Germany for close to 50 years).\n\nMy Grandfather, however, would very much be meeting the requirements (He lived in the USA for about 40 years before my Dad was born, and about 5 years just after), and as stated in the Instructions for form N600K, this would also count, given I can prove my Dads dependency on my Grandpa (which I also can). The problem here is that I am now over 18 years of age, which means form N600K doesn't apply to me anymore. Another important factor would be that my grandpa was in the Air Force for a pretty long time, with this also being the reason for him moving to Germany 5 years after adopting my Dad. We have multiple files documenting his service and exceptional performance during these years, on North American AND \"foreign\" US soil (\"Foreign\" as in the barracks here in Germany).\n\nI am currently residing in Germany, but I'm very much planning on moving to the US sooner than later. I believe I do have everything it should take to be granted citizenship / prove I am eligible for citizenship, my only REAL issue is the fact that theres no Form to fill out as I am, as stated before, resident in Germany, over the Age of 18 and have never lived in the USA myself.\n\nMy question now is the following: What are my options? How, where, and to whom can I prove my eligibility for citizenship based on the factors I just listed? Are there any forms I can fill out (except for N-600, N-600K, and DS-2029, as I don't meet the eligibility requirements for these)? Are there any resources for cases as mine? Sadly, the two USCIS agents I talked to weren't of much help, which is why I am asking here. If you made it this far, I appreciate you taking time to read through this, and if you have any answers/tips/ideas where to start, I'd greatly appreciate you telling me either through the comments or PMs. If you need any more information to be able to help me, please let me know as well.\n\nThank you very much and have a great rest of your day,\n\nJake",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Germany",
            "state": null
        },
        "sex": "Hombre",
        "document": "US Citizenship application/proof (N-600K, N-600, CRBA context)"
    },
    {
        "id": "1eipkf0",
        "title": "What’s the most number of citizenship someone could hypothetically acquire solely by birthright?",
        "score": 19,
        "num_comments": 25,
        "author": "jryan14ify",
        "created_utc": 1722644181.0,
        "created_readable_utc": "2024-08-03 00:16:21 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1eipkf0/whats_the_most_number_of_citizenship_someone/",
        "permalink": "https://reddit.com/r/expats/comments/1eipkf0/whats_the_most_number_of_citizenship_someone/",
        "selftext": "This is just a fun thought exercise. Let’s say we have perfect records going back as many generations as we needed to make the hypothetical scenario legally work. What citizenships could they theoretically hold at the moment of their birth? Assume all processing could also go through immediately and without an issue.\n\nOff the top of my head, let’s say a child is born in Mexico on vacation to a Father who is US citizen, Mother who is Pakistani but who immigrated to Canada. \nPaternal grandfather was Jewish and Polish, paternal grandmother is Italian.\n\nThe child could have 7 birthright citizenships in my scenario: Mexico, Canada, US, Pakistan, Israel, Poland, Italy. \n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Visa / Citizenship",
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": "Citizenship by birthright"
    },
    {
        "id": "1dlwemw",
        "title": "Obtaining Spanish citizenship ",
        "score": 0,
        "num_comments": 5,
        "author": "Practical_Block4393",
        "created_utc": 1719065033.0,
        "created_readable_utc": "2024-06-22 14:03:53 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1dlwemw/obtaining_spanish_citizenship/",
        "permalink": "https://reddit.com/r/expats/comments/1dlwemw/obtaining_spanish_citizenship/",
        "selftext": "Hello everyone,\nMany thanks in advance for any help. \n\nMy situation is fairly complicated- I was born in Spain (American parents but are both of Spanish ancestry - have Spanish grandparents who immigrated to Mexico during the Spanish civil war) \n\nI was naturalized. I only have one original birth certificate and the consulate here in the U.S. have been very vague with my questions. I used their website to get more birth certificates and it's been crickets for nearly 2 months. Does this process take a long time?\n\nThe consulate told me about the memory law but it was my great grandparents who immigrated out of Spain. Would this law apply to me? \n\nI just want to get EU Citizenship- has been my dream my entire life. Moved out of Europe when I was 7 and just really want to go back. \n\nWhat would be my easiest route? I feel like because I was naturalized I have to start the process from the bottom even though I was born in Spain. \n\nAny advice or help! \n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "Spanish Citizenship / Birth Certificate"
    },
    {
        "id": "1cmeo38",
        "title": "Secrecy and selfishness among expat communities?",
        "score": 0,
        "num_comments": 12,
        "author": "GravitationalOno",
        "created_utc": 1715095803.0,
        "created_readable_utc": "2024-05-07 15:30:03 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1cmeo38/secrecy_and_selfishness_among_expat_communities/",
        "permalink": "https://reddit.com/r/expats/comments/1cmeo38/secrecy_and_selfishness_among_expat_communities/",
        "selftext": "I haven’t been an expat but I have quite a few friends who are, and I’ve visited them regularly.\n\nI’ve been considering becoming an expat too, but I’ve observed this phenomenon, and I’ve wondered if it’s widespread, and knowing so would better inform my decisions.\n\nThe thing I’ve noticed is that there’s a lot more secrecy among expats than what I experience back home in my community. Sometimes it’s my friends, or their friends, but sometimes it’s an expat from completely outside their circle.\n\nI think I understand. Expats trade a culture that they’re familiar with for one they’re not familiar with but in a country where their money goes further and they can live a better life.\n\nYou’ve made sacrifices to be here, and you’ve had to work to acquire specialized information, whether it be cheap rents, great jobs, places for the best bargains, or social circles or clubs or parties where you can deepen your relationships with the locals. If this information was given out freely, then more people would come and ruin the arbitrage you committed to earlier than they did.\n\nSo people don’t share information freely. Instead they trade and parcel it out like favors, or guard it so they can feel better about themselves in comparison to you.\n\nHas anyone else ever gotten this sense too? People don’t give as freely as they do at home. It might be my friends and the communities they’re part of, but I think it goes beyond that. \n\nCertainly things are different if you’re sent to Dubai as a banker versus if you move to Mexico City because it’s a cool place with cheaper rents than the Bay Area. I could be wrong. Tell me what you’ve experienced!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.31,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": null
    },
    {
        "id": "1bsk64a",
        "title": "The benefits of Mexican citizenship and a second passport",
        "score": 0,
        "num_comments": 9,
        "author": "develop99",
        "created_utc": 1711917260.0,
        "created_readable_utc": "2024-03-31 20:34:20 UTC",
        "url": "https://www.reddit.com/r/expats/comments/1bsk64a/the_benefits_of_mexican_citizenship_and_a_second/",
        "permalink": "https://reddit.com/r/expats/comments/1bsk64a/the_benefits_of_mexican_citizenship_and_a_second/",
        "selftext": "I've read a bit on the process of getting Mexican citizenship but I'd love to hear experiences and thoughts on this second passport (Canada is my primary).\n\nFor me: I don't have immediate plans to live in Mexico (I live in Canada 8 months of the year and Colombia for 4 months) but that could change as I get older. My father was born in Mexico in a Mennonite colony and moved to Canada as a kid. I believe I can claim citizenship through my Toronto consulate, even though my father has never claimed citizenship himself (from what I've read it's automatic but please correct me if I'm wrong). He does have a birth certificate that I can use.\n\n\r  \nIs there any purpose in me doing this if I don't plan to live there? I like the idea of having a second passport as I'm not confident in the livability of Canada in the coming years (especially with taxation and health care). I'd like other options and Mexico seems like the easiest.\n\n\r  \nAny thoughts would be appreciated!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.45,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Visa / Citizenship",
        "us_president": "Joe Biden",
        "location": {
            "country": "Canada",
            "state": "Toronto (consulate location)"
        },
        "sex": null,
        "document": "Mexican Citizenship / Passport (by descent)"
    },
    {
        "id": "16myfvg",
        "title": "Validity of Apostilled Birth Certificate",
        "score": 1,
        "num_comments": 3,
        "author": "unafulana13",
        "created_utc": 1695147954.0,
        "created_readable_utc": "2023-09-19 18:25:54 UTC",
        "url": "https://www.reddit.com/r/expats/comments/16myfvg/validity_of_apostilled_birth_certificate/",
        "permalink": "https://reddit.com/r/expats/comments/16myfvg/validity_of_apostilled_birth_certificate/",
        "selftext": "I live in the state of Texas (USA) and got an apostille for my birth certificate. I was born in the state of New Mexico. Is my apostilled birth certificate valid to use for procedures, such as to get my driver's license for the first time? Or do I need to order another birth certificate so that it isn't apostilled?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.99,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": "Texas"
        },
        "sex": "Mujer",
        "document": "Apostilled Birth Certificate"
    },
    {
        "id": "16dzz8t",
        "title": "Best country to live-Need some advice",
        "score": 0,
        "num_comments": 5,
        "author": "SFire_SIce",
        "created_utc": 1694246447.0,
        "created_readable_utc": "2023-09-09 08:00:47 UTC",
        "url": "https://www.reddit.com/r/expats/comments/16dzz8t/best_country_to_liveneed_some_advice/",
        "permalink": "https://reddit.com/r/expats/comments/16dzz8t/best_country_to_liveneed_some_advice/",
        "selftext": "Good night , hope you are doing great.\n\nWell let's get to the point ,I Speak English and Spanish, Male 25yo , Engineer doing a masters degree focusing to have a supply chain engineer profile, single , I live in Mexico been in different areas around here and I have seen my fair share of bad things and really bad things, I already know how to live here by myself and do not get killed in the process  ,but  as I get older , I get worried about having a family here , I know this may be to early but I like to prepare in advance.\n\nso given my profile what country do you think that would be the best to have a family and also provide ease of nationality or/and residence , I aim for a 9-5 and perhaps 2-3 children , just an average middle class man with a family , work enough to provide but not to much because I would like to spend time with my love ones. Just a simple life where I do not have to be dead worried about violence , carteles (criminal organizations) , corruption , misogyny , and many other things that sadly are really common here. \n\nI am doing my own research but I would like to hear from you guys what do you think about this and also would like to hear your stories and advices\n\n \n\n​",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": null
    },
    {
        "id": "z4aa6c",
        "title": "More Consular Report of Birth Abroad (CRBA) stuff: What constitutes a \"true copy\" of the hospital birth certificate?",
        "score": 4,
        "num_comments": 6,
        "author": "JJVMT",
        "created_utc": 1669372697.0,
        "created_readable_utc": "2022-11-25 10:38:17 UTC",
        "url": "https://www.reddit.com/r/expats/comments/z4aa6c/more_consular_report_of_birth_abroad_crba_stuff/",
        "permalink": "https://reddit.com/r/expats/comments/z4aa6c/more_consular_report_of_birth_abroad_crba_stuff/",
        "selftext": "Hey everyone! The U.S. Embassy and Consulates in Mexico website provides the following as one of the requirements for requesting a CRBA, in both English in Spanish:\n\n>**Mexican Secretary of Health Birth Certificate:** Copy of the certificate given to the mother in the hospital after the child’s birth. If you submitted this document to the Civil Registry and do not have a copy, request a true copy from the Civil Registry. This document is also called a hospital birth certificate, certificado de alumbramiento, or nacido vivo.  \n\\[...\\]  \n**Certificado de Nacimiento expedido por la Secretaría de Salud:** Copia del certificado otorgado a la madre en el hospital después de nacimiento del menor. Si entregó este documento en el Registro Civil y no tiene una copia, puede solicitar una copia fiel al Registro Civil. Este documento también es conocido como certificado de nacimiento del hospital, certificado de alumbramiento, o nacido vivo.\n\nBy the time I had read the above, I had already handed over the hospital birth certificate (*certificado de nacimiento*) to the Mexico City Civil Registry to prepare my son's birth certificate (*acta de nacimiento*). However, I did make a black and white photocopy of the hospital birth certificate on both sides just before I handed it over.\n\nWill my photocopy count as a true copy, or do I need special certifications from the Civil Registry that received the original?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.84,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City"
        },
        "sex": null,
        "document": "CRBA / Hospital Birth Certificate (true copy requirement)"
    },
    {
        "id": "z40rfc",
        "title": "Preparing paperwork to apply for son's CRBA; how is physical presence calculated based on high school and college transcripts?",
        "score": 3,
        "num_comments": 4,
        "author": "JJVMT",
        "created_utc": 1669341230.0,
        "created_readable_utc": "2022-11-25 01:53:50 UTC",
        "url": "https://www.reddit.com/r/expats/comments/z40rfc/preparing_paperwork_to_apply_for_sons_crba_how_is/",
        "permalink": "https://reddit.com/r/expats/comments/z40rfc/preparing_paperwork_to_apply_for_sons_crba_how_is/",
        "selftext": "Hi there! I will probably be asking several questions about this process over the coming days.\n\nFor background, I am an American living in Mexico with my Mexican wife and our two-month-old baby son. Even though I've been in Mexico since I graduated from the university 11 years ago, I do meet the criteria to pass my citizenship on to him.\n\nSpecifically, since I am a US citizen who was married to a non-citizen during the birth of my son, I need to prove five years' presence in the US before his birth, at least two of which were after I was 14.\n\nTo do this, I have ordered my high school and college transcripts. The former covers the period from September 2002 to June 2006, and the latter from September 2006 to June 2011.\n\nNow, as far as I can tell, even the strictest reading of these transcripts alone should put me within the five years I need. However, I am curious, will they accept these transcripts as covering 3 years and 9 months for high school and 4 years and 9 months for college, or will they hair-splittingly attempt to deduct winter and summer breaks that those records technically don't account for? Or will they be as generous as to accept them as covering a full 8 years and 9 months?\n\nI should note that I lived in the US for the first 24 years of my life, so I definitely meet the requirement. I just want to know how many records I need to purchase and how much I need to bother my dad and brother back home before they visit me, my wife, and their new grandson/nephew for Christmas.\n\nAny insight is appreciated. Thanks a lot!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.8,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "CRBA / Proof of physical presence (transcripts)"
    },
    {
        "id": "w0h3gn",
        "title": "Renewing passport via Mexico City Consulate. I need to correct my last name from “De Jesus” to “DeJesus” to reflect name as it appear on my NY certified certificate of birth for the new passport and am using DS82. Is that a name change or just a data correction change? Thanks for any help.",
        "score": 5,
        "num_comments": 6,
        "author": "Tough_Gadfly",
        "created_utc": 1657979287.0,
        "created_readable_utc": "2022-07-16 13:48:07 UTC",
        "url": "https://www.reddit.com/r/expats/comments/w0h3gn/renewing_passport_via_mexico_city_consulate_i/",
        "permalink": "https://reddit.com/r/expats/comments/w0h3gn/renewing_passport_via_mexico_city_consulate_i/",
        "selftext": "I am thinking of sending in two forms with a letter and my certified birth certificate to support the request for correction. I can’t provide a court order name change because my name was never changed from how it appears on the aforementioned certificate of birth from NY. The passport expired in May of this year so form DS5504 does not apply not DS11 apply since I was not a minor when my last passport was issued. Doing extensive research I came to the conclusion that DS82 is the correct form but I am left doubting if I should declare the correction as a name change (which technically is not the case given that my passport simply never reflected my last name as typed on the birth certificate) or merely correct and state the surname in the first field where it says the name must match what was on the prior passport issued or on a name change document.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City (consulate location)"
        },
        "sex": null,
        "document": "Passport renewal (DS-82) / Birth Certificate (name correction)"
    },
    {
        "id": "vtw3it",
        "title": "Child born out of the US",
        "score": 2,
        "num_comments": 7,
        "author": "Yuup_I_eat_crayons",
        "created_utc": 1657236332.0,
        "created_readable_utc": "2022-07-07 23:25:32 UTC",
        "url": "https://www.reddit.com/r/expats/comments/vtw3it/child_born_out_of_the_us/",
        "permalink": "https://reddit.com/r/expats/comments/vtw3it/child_born_out_of_the_us/",
        "selftext": "Not sure if this is where I should be posting but last year my son was born in Tijuanna Mexico (both my girlfriend and I are US citizens). At the time the consulate was closed due to covid and we had no way of getting his US documents. Fast forward a year and we have him back in the US with us and we are trying to get his Social Security. We have his Mexican birth certificate with our names on it. How do we go about getting all his US papers now? Do we just go to the SS office or do we have to go through immigration? We are a bit of a loss. It seems like everyone tells us to go somewhere else. Thanks for the help in advance",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": "Hombre",
        "document": "US documents for child born abroad (SSN, CRBA/Passport implied) / Mexican Birth Certificate"
    },
    {
        "id": "vlitw1",
        "title": "Time for me to fly",
        "score": 11,
        "num_comments": 5,
        "author": "butrfly626",
        "created_utc": 1656290757.0,
        "created_readable_utc": "2022-06-27 00:45:57 UTC",
        "url": "https://www.reddit.com/r/expats/comments/vlitw1/time_for_me_to_fly/",
        "permalink": "https://reddit.com/r/expats/comments/vlitw1/time_for_me_to_fly/",
        "selftext": "I became an empty nester during the lockdown. It's given me time to think about what I want to do with the rest of my life. Punching a time clock wasn't in the top five. The kids don't want the house, and frankly, neither do I. So I've decided to spread my wings and live abroad. Mexico comes to mind. I'm working on getting my TEFL so that I can work both in person and online no matter where I go. But I really think I would like to start in Mexico.  \n\nI would love to hear from Americans who have moved to Mexico. I'm in Florida now (don't hold it against me), and hoping to be lounging in my new tropical paradise soon!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.92,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "General Advice",
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": "Florida"
        },
        "sex": null,
        "document": null
    },
    {
        "id": "u5fgzb",
        "title": "Work Relocation Dilema",
        "score": 12,
        "num_comments": 23,
        "author": "JanosNeumann",
        "created_utc": 1650170229.0,
        "created_readable_utc": "2022-04-17 04:37:09 UTC",
        "url": "https://www.reddit.com/r/expats/comments/u5fgzb/work_relocation_dilema/",
        "permalink": "https://reddit.com/r/expats/comments/u5fgzb/work_relocation_dilema/",
        "selftext": "Hi! \n\nI'm a professional with five years of experience, working as an ex-pat for an international FMCG for the last three years. This year I took a local role in Mexico. I moved with my wife and my one-year-old son.\n\nFor us, safety is a must. If all our basics are covered, we do not care about luxuries, status, and even money.\n\nWhen they offered me the role, of course, we discussed the safety situation in Mexico. They told me that it is mainly a stereotypical view of the world/movies and that the area where I will live (one of the nicest in Mexico) is safe and okay.\n\nThe first months we lived here were all relative okay, despite being extra cautious as pedestrians because they have no pedestrian culture compared to other countries. \n\nLast month, walking in our neighbourhood, we experienced the execution of a person; luckily, a few minutes after it happened, but we saw the body meters from us. My wife is very unhappy here.\n\nWith the experience of living on different continents, we never experienced or been close to something like this. Of course, we were shocked, and when we googled it, we noticed that this situation is more regular than rare. It was another major reason for us to want to leave the country as soon as possible. \n\nThe dilemma. Should we try to stay here for at least a year and then ask my company to find me a role in another country (given the reasons we are not mentally okay here)? Or should I don't make my life and my wife's life miserable any extra month and ask my company to relocate? I would love to leave in the coming months if you asked me, but I'm afraid that this can backfire and crush my career and relationship with my employer.\n\nWhat would you do in our case?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.88,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Social / Personal",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": null
    },
    {
        "id": "tz2dxa",
        "title": "Digital nomad working in Mexico on temporary resident visa",
        "score": 3,
        "num_comments": 2,
        "author": "KalissDostie",
        "created_utc": 1649420781.0,
        "created_readable_utc": "2022-04-08 12:26:21 UTC",
        "url": "https://www.reddit.com/r/expats/comments/tz2dxa/digital_nomad_working_in_mexico_on_temporary/",
        "permalink": "https://reddit.com/r/expats/comments/tz2dxa/digital_nomad_working_in_mexico_on_temporary/",
        "selftext": "I plan to do just that in near future; and play by the rules. \n\nWhile I do not plan to work for Mexican employer or have Mexican clients, I believe I still need a work permit. Given this scenario, I think I have to apply for work permit \\*once\\* I am in Mexico on Temporary Resident visa.\n\nWhat is the success rate of getting such permit? Is it a simple formality with some quality time waiting in line? Or not? Any idea how to optimize said rate?\n\nCheers",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.8,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Visa",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "Mexican Temporary Resident Visa / Work Permit"
    },
    {
        "id": "tkev1d",
        "title": "US resident interested in moving to a more tropical place... an affordable tropical place lol. looking for suggestions",
        "score": 48,
        "num_comments": 62,
        "author": "Jet_Jirohai",
        "created_utc": 1647987827.0,
        "created_readable_utc": "2022-03-22 22:23:47 UTC",
        "url": "https://www.reddit.com/r/expats/comments/tkev1d/us_resident_interested_in_moving_to_a_more/",
        "permalink": "https://reddit.com/r/expats/comments/tkev1d/us_resident_interested_in_moving_to_a_more/",
        "selftext": "I'll keep it as short as I can, but I live in Florida. I'm a bartender currently and former merchant sailor. I like the beach and want to spend as much time there as possible with weather that's situated for full or near full time beach enjoyment. \n\nGiven that I'll likely go back to being a merchant sailor, a work permit may not be necessary for wherever I end up moving to, but full residency will be, obviously. The main points are tropical beach and cheaper cost of living- Florida isn't cutting it for that on either front lol\n\nBased on my light research, Mexico sounds like it could be good spot, depending on the area. I'm open to your suggestions- thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.83,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "r/IWantOut",
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": "Florida"
        },
        "sex": null,
        "document": null
    },
    {
        "id": "tj105i",
        "title": "Can't decide between staying in expat country vs going home for good",
        "score": 2,
        "num_comments": 11,
        "author": "heretohelp999",
        "created_utc": 1647828654.0,
        "created_readable_utc": "2022-03-21 02:10:54 UTC",
        "url": "https://www.reddit.com/r/expats/comments/tj105i/cant_decide_between_staying_in_expat_country_vs/",
        "permalink": "https://reddit.com/r/expats/comments/tj105i/cant_decide_between_staying_in_expat_country_vs/",
        "selftext": "Some background - i arrived in my expat country about 2.5 years ago (China - im not concerned about geopolitical issues so thats a non factor for me) and covid meant that I couldn't go back home for a long time and probably for foreseeable 2/3 years. I left China for a 1 month break at the start of 2021 to catch up with family and friends and before that, I kinda felt that I would be able to stay another 2 years before heading back home but since arriving in China - 3 weeks quarantine + 1.5 weeks semi lockdown in Shanghai, I am very homesick and seriously contemplating going home.\n\nI had a serious conversation with my GF (almost a year together), we talked about settling down and to her, she wants to stay in China (she's chinese) for another 3 to 4 years to grow her career and give birth before heading to Singapore. When I think about this 3/4 years - it really scares me because I'm not sure if I can survive that much longer given how I'm feeling.\n\nSomehow being here feels like I'm stuck outside of real life and am able to be part of my family/friends lives especially with my nephews/nieces growing up. At the same time, I likely my lifestyle here in that I have my own place and can do whatever I want, I live an expat lifestyle in downtown Shanghai with easy access to many lifestyle amenities, advanced food delivery, ecommerce delivery, etc.. The downside of going home is that I probably have to live with my parents for another 6/9 months while I buy my own apartment somewhere in the outskirts of the island (tbh minor inconvenience) but just going back to a local lifestyle.\n\nThere are several factors that I am looking at to weigh this\n\nCAREER - I have similar offers in China and Singapore (home) in terms of money, career progression is settled but I am still hesitating and feel inclined to reject the China offer because I'm not sure if I can survive longer here.. 2 years is possible but 3/4 years seems tough and my GF bottomline is 3/4 years.\n\nPERSONAL - I feel bad that I am unable to be there for my parents - for example, my mum has to go for operation herself because there's no one else who can bring her and it made me want to just pack up and go home\n\nRELATIONSHIP - The fact that I don't know if I can survive another 3/4 years makes me feel like things will fall apart after 1/2 years and rather than let that happen then, I should let it happen now and quickly move on with life\n\nI'm not sure what or how I should evaluate this and i've been bothered by this for a long time and hope to get some advice on how to see this or change my thinking. I guess, if I were single - the decision would be much easier because I wouldn't have any baggage - except for sacrificing the lifestyle but at the same time maybe I'm also looking at life back home through rose-tinted glasses?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.63,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "General Advice",
        "us_president": "Joe Biden",
        "location": {
            "country": "China",
            "state": "Shanghai"
        },
        "sex": "Hombre",
        "document": null
    },
    {
        "id": "q59l8g",
        "title": "Totally Broke Expat",
        "score": 15,
        "num_comments": 71,
        "author": "RegretSlow7464",
        "created_utc": 1633877781.0,
        "created_readable_utc": "2021-10-10 14:56:21 UTC",
        "url": "https://www.reddit.com/r/expats/comments/q59l8g/totally_broke_expat/",
        "permalink": "https://reddit.com/r/expats/comments/q59l8g/totally_broke_expat/",
        "selftext": "I mean I have enough to fly to the US. Where I've been has been in lockdowns for about 2 years. I kept thinking they would end, but they haven't. So now I have basically no money, I've been away so long no credit, all close family has passed on. I have literally nothing in the nation of my birth. I guess I could get into a homeless shelter? Is there any help for destitute expats? I'm an English teacher by profession although I have a history degree. Maybe I should see if Mexico is hiring, then tear up my passport if that doesn't work and join the migration? Okay the last part was kidding, kindof.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.62,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "General Advice",
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": null
    },
    {
        "id": "jlplu3",
        "title": "Struggling with the ethics of a \"nomadic\" expat lifestyle. Would love your thoughts.",
        "score": 0,
        "num_comments": 11,
        "author": "Previous_Criticism93",
        "created_utc": 1604176486.0,
        "created_readable_utc": "2020-10-31 20:34:46 UTC",
        "url": "https://www.reddit.com/r/expats/comments/jlplu3/struggling_with_the_ethics_of_a_nomadic_expat/",
        "permalink": "https://reddit.com/r/expats/comments/jlplu3/struggling_with_the_ethics_of_a_nomadic_expat/",
        "selftext": "Come March I will have to move out of my home in NYC (this is happening regardless of what I do). My plan prior to the pandemic was always to try a nomadic lifestyle. Obviously the pandemic has complicated that.\n\nMy plan tentatively is to join a close friend in Hawaii come March and stay for 2 months (maybe 1). After that, I'd like to join a friend in Mexico City and live there for 6 months. From there, I'll figure out what's next. I am staying in these places for those durations as it aligns with when I'll have a friend/place to stay with. \n\nI am immensely conflicted. I have been extremely vigilant about the coronavirus. I have not eaten out once. I have only met 1 or 2 friends outside socially distanced with masks at any given time. I have definitely not gone to any parties. Not out of concern for personal safety but because I feel it's a duty we all bear to sacrifice for the greater good. \n\nThis is my inherent conflict. Is it ethically right or justifiable to embark on this more nomadic lifestyle where I expect to stay at a place 3-6 months and move on? \n\nOn one hand, I justify it to myself by saying I will only *move* to a location. I won't engage in reckless or selfish behavior. I will be the best visitor I can be until a vaccine. Many people have moved since the pandemic and I would be one of them. I don't fault them for making a move and find it rather reasonable. Moreover, we may have a vaccine by the time my 6 month stint in Mexico is over. Which would mitigate any concerns on my end of my next few moves.\n\nOn the other, nomadic lifestyles are inherently different. While I will practice all precaution while I am settled/living in a place, I aim to be moving around every 3-6 months with the exception of the initial 1-2 month stint in Hawaii. There's no guarantee that there will be a vaccine and that sort of frequent movement is not helpful. And if I ever do get sick, I could be a disproportionate burden to a country like Mexico that is less equipped financially to deal with a pandemic.\n\nWould love your thoughts on the situation. Excuse me if I post this on a few other subreddits. Would like to consider the widest variety of viewpoints I can. Thank you for reading.\n\nTl;dr: Want to become a \"nomad\" come March. Struggling with the ethical ramifications of it.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.38,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": "NYC"
        },
        "sex": null,
        "document": null
    },
    {
        "id": "ik2c5g",
        "title": "American Voting from Abroad: voting in another state?",
        "score": 0,
        "num_comments": 10,
        "author": "RayOfBabas",
        "created_utc": 1598894729.0,
        "created_readable_utc": "2020-08-31 17:25:29 UTC",
        "url": "https://www.reddit.com/r/expats/comments/ik2c5g/american_voting_from_abroad_voting_in_another/",
        "permalink": "https://reddit.com/r/expats/comments/ik2c5g/american_voting_from_abroad_voting_in_another/",
        "selftext": "I am a Mexican living in the US, but my mother is an American citizen living in Mexico and I want to help her vote from abroad. She was born and lived in New York until she and her family moved to Mexico when she was 16, nearly 50 years ago. In 2016, I helped her vote for the first time in her life. She was so incredibly excited that she cried! So I refrained from telling her what I knew: that because of the electoral college and given that she is from a solid blue state, her vote didn't matter one bit. This year I want to help not only vote, but making her vote count. I would like her to vote in a battleground state. From what I remember four years ago, she didn't have to submit any proof that she resided in New York, she just provided the address where she lived 50 years ago. Is it possible for her to just Google an address in a battleground state and request a ballot there? Can she get in any trouble for this?\n\nI know that this is bending the rules and I am not set on doing it because I am usually a by the book person. I'm also open to hearing what you think about the ethics of this.\n\nEDIT: Removed political commentary.\n\nEDIT2: And it's done! She registered and requested her ballot from the NY county where she last lived before leaving the US. No voter fraud committed :)  If any American expat here hasn't yet requested their ballot I highly recommend votefromabroad.org",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "Absentee Ballot / Voter Registration"
    },
    {
        "id": "btro8e",
        "title": "Dumb question: how do you pay for rent in another country?",
        "score": 4,
        "num_comments": 7,
        "author": "LexaIsNotDead",
        "created_utc": 1558992739.0,
        "created_readable_utc": "2019-05-27 21:32:19 UTC",
        "url": "https://www.reddit.com/r/expats/comments/btro8e/dumb_question_how_do_you_pay_for_rent_in_another/",
        "permalink": "https://reddit.com/r/expats/comments/btro8e/dumb_question_how_do_you_pay_for_rent_in_another/",
        "selftext": "I will soon be working a 100% remote job based out of the US and my paychecks will be deposited to a US bank account. Currently, I'm using a credit union but I'm trying to open one either Charles Schwab or Capital One 360 since those seem to be the most friendly bank accounts for expats. I will be moving to Mexico City (likely a permanent move since my partner lives there) by mid-June with the plan of renting an Airbnb for the first two or three months while I learn more about the neighborhoods and complete my temporary resident visa process.\n\nHowever, I want to eventually get my own apartment, and I'm stumped on how I would even pay rent given that my money \"lives\" in the US. Do I take it out in chunks via an ATM? Can I wire money from my US bank to a Mexican bank?\n\nIt seems like a simple question yet I can't figure it out. Any feedback?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": "Mexico City"
        },
        "sex": null,
        "document": "Mexican Temporary Resident Visa"
    }
]