[
    {
        "id": "z4aa6c",
        "title": "More Consular Report of Birth Abroad (CRBA) stuff: What constitutes a \"true copy\" of the hospital birth certificate?",
        "score": 5,
        "num_comments": 6,
        "author": "JJVMT",
        "created_utc": 1669372697.0,
        "created_readable_utc": "2022-11-25 10:38:17 UTC",
        "url": "https://www.reddit.com/r/expats/comments/z4aa6c/more_consular_report_of_birth_abroad_crba_stuff/",
        "permalink": "https://reddit.com/r/expats/comments/z4aa6c/more_consular_report_of_birth_abroad_crba_stuff/",
        "selftext": "Hey everyone! The U.S. Embassy and Consulates in Mexico website provides the following as one of the requirements for requesting a CRBA, in both English in Spanish:\n\n>**Mexican Secretary of Health Birth Certificate:** Copy of the certificate given to the mother in the hospital after the child’s birth. If you submitted this document to the Civil Registry and do not have a copy, request a true copy from the Civil Registry. This document is also called a hospital birth certificate, certificado de alumbramiento, or nacido vivo.  \n\\[...\\]  \n**Certificado de Nacimiento expedido por la Secretaría de Salud:** Copia del certificado otorgado a la madre en el hospital después de nacimiento del menor. Si entregó este documento en el Registro Civil y no tiene una copia, puede solicitar una copia fiel al Registro Civil. Este documento también es conocido como certificado de nacimiento del hospital, certificado de alumbramiento, o nacido vivo.\n\nBy the time I had read the above, I had already handed over the hospital birth certificate (*certificado de nacimiento*) to the Mexico City Civil Registry to prepare my son's birth certificate (*acta de nacimiento*). However, I did make a black and white photocopy of the hospital birth certificate on both sides just before I handed it over.\n\nWill my photocopy count as a true copy, or do I need special certifications from the Civil Registry that received the original?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City"
        },
        "sex": "Hombre",
        "document": "Mexican Secretary of Health Birth Certificate / hospital birth certificate"
    },
    {
        "id": "z40rfc",
        "title": "Preparing paperwork to apply for son's CRBA; how is physical presence calculated based on high school and college transcripts?",
        "score": 4,
        "num_comments": 4,
        "author": "JJVMT",
        "created_utc": 1669341230.0,
        "created_readable_utc": "2022-11-25 01:53:50 UTC",
        "url": "https://www.reddit.com/r/expats/comments/z40rfc/preparing_paperwork_to_apply_for_sons_crba_how_is/",
        "permalink": "https://reddit.com/r/expats/comments/z40rfc/preparing_paperwork_to_apply_for_sons_crba_how_is/",
        "selftext": "Hi there! I will probably be asking several questions about this process over the coming days.\n\nFor background, I am an American living in Mexico with my Mexican wife and our two-month-old baby son. Even though I've been in Mexico since I graduated from the university 11 years ago, I do meet the criteria to pass my citizenship on to him.\n\nSpecifically, since I am a US citizen who was married to a non-citizen during the birth of my son, I need to prove five years' presence in the US before his birth, at least two of which were after I was 14.\n\nTo do this, I have ordered my high school and college transcripts. The former covers the period from September 2002 to June 2006, and the latter from September 2006 to June 2011.\n\nNow, as far as I can tell, even the strictest reading of these transcripts alone should put me within the five years I need. However, I am curious, will they accept these transcripts as covering 3 years and 9 months for high school and 4 years and 9 months for college, or will they hair-splittingly attempt to deduct winter and summer breaks that those records technically don't account for? Or will they be as generous as to accept them as covering a full 8 years and 9 months?\n\nI should note that I lived in the US for the first 24 years of my life, so I definitely meet the requirement. I just want to know how many records I need to purchase and how much I need to bother my dad and brother back home before they visit me, my wife, and their new grandson/nephew for Christmas.\n\nAny insight is appreciated. Thanks a lot!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.83,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "high school and college transcripts"
    },
    {
        "id": "wmlxti",
        "title": "Self-translation vs certified translation of documents",
        "score": 1,
        "num_comments": 1,
        "author": "taigatransplant",
        "created_utc": 1660312673.0,
        "created_readable_utc": "2022-08-12 13:57:53 UTC",
        "url": "https://www.reddit.com/r/expats/comments/wmlxti/selftranslation_vs_certified_translation_of/",
        "permalink": "https://reddit.com/r/expats/comments/wmlxti/selftranslation_vs_certified_translation_of/",
        "selftext": "We’re getting ready to apply for a CRBA for our child. The embassy website calls for the original birth certificate, a certified copy, and an English translation. My husband and I are both fluent in both languages, and translating the birth certificate would be easy. Of course, if by “English translation” they mean “certified English translation,” we can work on that… we’ve just had so-so experiences with translators in the past. \nAnyone tried this route?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "General Advice",
        "us_president": "Joe Biden",
        "location": null,
        "sex": "Mujer",
        "document": "birth certificate translation"
    },
    {
        "id": "tp6oqz",
        "title": "CRBA and American parent is deceased",
        "score": 3,
        "num_comments": 1,
        "author": "Business_Possible_90",
        "created_utc": 1648335048.0,
        "created_readable_utc": "2022-03-26 22:50:48 UTC",
        "url": "https://www.reddit.com/r/expats/comments/tp6oqz/crba_and_american_parent_is_deceased/",
        "permalink": "https://reddit.com/r/expats/comments/tp6oqz/crba_and_american_parent_is_deceased/",
        "selftext": "Recently, my American wife passed away (not in America).  I am in the process of settling her affairs.  However, because of circumstances we never got to file my son's CRBA.  I am in the process of obtaining additional records for proof of physical presence, but to be honest I am quite nervous.  Anyone here been through something like this or know someone who did?  Any comments?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": null,
        "sex": "Hombre",
        "document": "CRBA / records for proof of physical presence"
    },
    {
        "id": "t6ni7p",
        "title": "CRBA (birth abroad certificate) replacement + apostille fees",
        "score": 0,
        "num_comments": 1,
        "author": "I_hate_abbrev",
        "created_utc": 1646413207.0,
        "created_readable_utc": "2022-03-04 17:00:07 UTC",
        "url": "https://www.reddit.com/r/expats/comments/t6ni7p/crba_birth_abroad_certificate_replacement/",
        "permalink": "https://reddit.com/r/expats/comments/t6ni7p/crba_birth_abroad_certificate_replacement/",
        "selftext": "Does anyone know how much is the fee to get a CRBA replacement from US State department and have it apostilled at the same time ? Is it $50 or $100 ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Red Tape",
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": "CRBA replacement / apostille"
    }

]