[

 
    {
        "id": "1jhga2r",
        "title": "CBRA Interview",
        "score": 0,
        "num_comments": 0,
        "author": "Downtown_Truth_1483",
        "created_utc": 1742671136.0,
        "created_readable_utc": "2025-03-22 19:18:56 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1jhga2r/cbra_interview/",
        "permalink": "https://reddit.com/r/immigration/comments/1jhga2r/cbra_interview/",
        "selftext": "I applied for a CRBA for my newborn son, but my girlfriend and I are not married yet. We recently got an interview appointment for my son, but I don't have a marriage certificate to present at the embassy. I have given my girlfriend authorization to take our son to the interview on my behalf.\n\nDoes anyone have an idea of what kind of questions they might ask her during the interview? Any insights would be greatly appreciated.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1jbj0dn",
        "title": "Visit visa if infant while immigration underway",
        "score": 1,
        "num_comments": 0,
        "author": "That_Emotion_1674",
        "created_utc": 1741999160.0,
        "created_readable_utc": "2025-03-15 00:39:20 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1jbj0dn/visit_visa_if_infant_while_immigration_underway/",
        "permalink": "https://reddit.com/r/immigration/comments/1jbj0dn/visit_visa_if_infant_while_immigration_underway/",
        "selftext": "Are their any couples who took their infant to US on visit visa when infant immigration was underway.  Duaghter is 3 months old. Mom has just been granted immigration status (have to travel by 30 june 2025),dad us national. Crba rejected due to 5 year physical presence rule. \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1j7wq0i",
        "title": "Having a mistake with ds-5507",
        "score": 1,
        "num_comments": 0,
        "author": "Jadomari7",
        "created_utc": 1741607193.0,
        "created_readable_utc": "2025-03-10 11:46:33 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1j7wq0i/having_a_mistake_with_ds5507/",
        "permalink": "https://reddit.com/r/immigration/comments/1j7wq0i/having_a_mistake_with_ds5507/",
        "selftext": "Hey guys \nSo we filed form ds-5507 for the crba application because my dad will not be attending the interview \nSo he notarized it and send it to us and when I open I saw two mistakes \n1. First one was the section that confirms the date the he has been abroad \nThe supposed date was meant to be 12/17/1994 but by mistake he filled it 12/17/2025 \n\n2. The second one is one the same page where is Part II for the births out of wedlock \nSo he signed the both Part II and Part III \nbut he wasn’t supposed to sign part II \n\nSo what should I do can I just print the correct page without the Part II notarization because we don’t need it \nAnd told the embassy that I made a mistake and here is the correct one along with the first one ?\n\nThanks. \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1j5ajxo",
        "title": "N600k- Grandparent physical presence",
        "score": 4,
        "num_comments": 6,
        "author": "SillyNewt929",
        "created_utc": 1741306960.0,
        "created_readable_utc": "2025-03-07 00:22:40 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1j5ajxo/n600k_grandparent_physical_presence/",
        "permalink": "https://reddit.com/r/immigration/comments/1j5ajxo/n600k_grandparent_physical_presence/",
        "selftext": "Hello, hope anybody can help me. Thanks in advance. \n\nI am an american citizen by birth, but have physical presence till the age of 11... I have a daughter which was rejected for CRBA since no physical presence after 14 years old... Am i doing the correct thing by filling out N600k with my dads physical presence? he was naturalized in 2000, he work for over 25 years all the physical presence is after 14 none before will that work?? \n\nHoping on getting tourist visa approved.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.83,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
  

    {
        "id": "1iu8a64",
        "title": "Transmit US citizenship through father",
        "score": 0,
        "num_comments": 6,
        "author": "Kitchen-Spite-3521",
        "created_utc": 1740082827.0,
        "created_readable_utc": "2025-02-20 20:20:27 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iu8a64/transmit_us_citizenship_through_father/",
        "permalink": "https://reddit.com/r/immigration/comments/1iu8a64/transmit_us_citizenship_through_father/",
        "selftext": "Hello Everyone! I am an illegitimate child of a US citizen, im 27 already, my father was already a US citizen before i was born, however my father did not file for my CRBA, is there still a way to acquire his citizenship? It might be hard to prove physical presence, is it possible le to request to IRS tax documents since 30 years ago? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1isvaua",
        "title": "Options for Child of USC living abroad",
        "score": 0,
        "num_comments": 10,
        "author": "CrazyMojo16",
        "created_utc": 1739934147.0,
        "created_readable_utc": "2025-02-19 03:02:27 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1isvaua/options_for_child_of_usc_living_abroad/",
        "permalink": "https://reddit.com/r/immigration/comments/1isvaua/options_for_child_of_usc_living_abroad/",
        "selftext": "Hello, I’m a US citizen as is most of my family. After my parents got married in the 1980s, they moved abroad. Because of this, my youngest sister has spent most of her life living outside of the US. She only lived in the US for about a year as a child. She is a US Citizen. \n\nNow we are adults and my sister married a non-USC. They live abroad and have no immediate plans of going back to the US. However, she has a small child and was looking into USC eligibility for her child. We think she does not qualify for transferring citizenship and getting a CRBA because she does not meet the 5 year physical presence requirement. However, we’ve read there could be other options such as the Child Citizenip Act of 2000. How do we start looking into this? How can she start the process from outside the US?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1ijd6x2",
        "title": "Am I a US citizen?? Pls help",
        "score": 0,
        "num_comments": 5,
        "author": "Zestyclose_Bed9678",
        "created_utc": 1738875390.0,
        "created_readable_utc": "2025-02-06 20:56:30 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ijd6x2/am_i_a_us_citizen_pls_help/",
        "permalink": "https://reddit.com/r/immigration/comments/1ijd6x2/am_i_a_us_citizen_pls_help/",
        "selftext": "My dad was born in the US in the 1980 as a US citizen and his parents were also American, I was born in the early 2000s abroad so my dad is a citizen my mum is not and they are not married. I never applied for a crba so I was not registered or claimed us citizen to my dad. I am now 20 so I can’t get a crba anymore. I have my dads birth certificate and  passport as proof of his citizenship and he recently (after I was 18) got a dds507 notarized recently saying that he lived in the USA 20 years before I was born and would agree to financial support me which he did. Do I have a claim to citizenship??? If anyone has advice or knows someone in that situation I’d really appreciate any information. Also I’m irish and his name is on my Irish birth certificate ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1ibheev",
        "title": "Advice on entering the US with my family if my wife has a visa.",
        "score": 0,
        "num_comments": 8,
        "author": "Blazzer2147",
        "created_utc": 1738005389.0,
        "created_readable_utc": "2025-01-27 19:16:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ibheev/advice_on_entering_the_us_with_my_family_if_my/",
        "permalink": "https://reddit.com/r/immigration/comments/1ibheev/advice_on_entering_the_us_with_my_family_if_my/",
        "selftext": "Background info \n\nI am a US citizen but got married in Mexico. My wife is a teacher in Mexico and plans on visiting in the summer. We do have a daughter and I have naturalized her through the CRBA process.  We eventually plan on going through the consular process to adjust her status but we have not applied since we don’t plan on her living in the US for about another 4 years. I thankfully am able to visit them quite often. How ever I wanted her to come during her summer vacation with our daughter.  \n\nQuestion/s\n\nIs there any issue with crossing the boarder together as a family?\n\nIs it better to cross separately? \n\nCan customs or boarder agents deny her entry? \n\nIf any one has any insight or recommendations it would greatly be appreciated. \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1i7peug",
        "title": "Filing for a us passport no crba",
        "score": 1,
        "num_comments": 7,
        "author": "Yourwinterbaby",
        "created_utc": 1737588782.0,
        "created_readable_utc": "2025-01-22 23:33:02 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i7peug/filing_for_a_us_passport_no_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1i7peug/filing_for_a_us_passport_no_crba/",
        "selftext": "My husband was born abroad, his mother is born in the US making her a US citizen. Does this make him a US citizen? if so she never filed a CRBA for him or anything that states he’s a US citizen. He came into the US as a baby crossing the mexican border with no questions asked, would this affect his chances of getting a US passport and what would he need to obtain a US passport through his mother? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
  
    {
        "id": "1i5x3rq",
        "title": "Need help with (CRBA) physical presence ",
        "score": 0,
        "num_comments": 10,
        "author": "Jadomari7",
        "created_utc": 1737397648.0,
        "created_readable_utc": "2025-01-20 18:27:28 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i5x3rq/need_help_with_crba_physical_presence/",
        "permalink": "https://reddit.com/r/immigration/comments/1i5x3rq/need_help_with_crba_physical_presence/",
        "selftext": "Hey everyone \nI having a trouble with applying for CRBA \nI was born outside and my dad claim his citizenship through naturalization \nAnd I’m qualified for citizenship through CRBA and all the terms apply to me but here’s the thing. \n The physical presence \nSo my dad have been in America since 1990 but he was a frequent traveler to his country to see his family. \nAnd he has a physical presence for more than 5 years but the issue is how to prove it \nI have some w-2s for him and know most of the times that he was entering and exiting the usa (due to his other foreign passport and the stamps was from his country because USA don’t stamp exit stamps ) but how they gonna believe that he was in the country those times without evidence related to us documents \nI applied for Foia request for CBP records (entry and exit dates) in last December but I was told they take forever to respond. \nI’m turning 18 this march and if anyone has a solution I would be very grateful. \n\n\nThanks. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1i2uanm",
        "title": "I-130 or N600k?",
        "score": 0,
        "num_comments": 7,
        "author": "Sarah_2499",
        "created_utc": 1737048684.0,
        "created_readable_utc": "2025-01-16 17:31:24 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i2uanm/i130_or_n600k/",
        "permalink": "https://reddit.com/r/immigration/comments/1i2uanm/i130_or_n600k/",
        "selftext": "I’m a US citizen born in the US but moved abroad at the age of 13, after which I’ve gone to visit twice for a total of 6 months. My daughter was recently born outside of the US and though I’ve applied for her CRBA I’m not sure it’ll be approved since I don’t meet the physical presence requirement completely.\n\nIn case CRBA is rejected, which path would be easier/less expensive/less time consuming for obtaining citizenship for my daughter? My parents are US citizens meeting the requirement for N600k, so that’s an option,  as well as the standard immigration visa I-130. \n\nIf anyone has any advice or personal experiences with either path, please let me know! Would be super grateful",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1i0d6so",
        "title": "Marriage on a tourist Visa",
        "score": 7,
        "num_comments": 40,
        "author": "Shaun_Of_The_Dead24",
        "created_utc": 1736772531.0,
        "created_readable_utc": "2025-01-13 12:48:51 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i0d6so/marriage_on_a_tourist_visa/",
        "permalink": "https://reddit.com/r/immigration/comments/1i0d6so/marriage_on_a_tourist_visa/",
        "selftext": "I’m hoping to receive some expertise on this matter since my girlfriend and I have been together for 3 years now and have a child together. To give you some context: she lives in Mexico, myself in America, my son was born in Mexico but I’ve already completed a CRBA, and now I want to marry my girlfriend. She already possesses a tourist visa that she received two years ago, and now my question is that if she traveled to the US so we can get legally married would there be any issues or foreseeable problems when I apply for her immigrant visa through the petition I-130 form? Any info would be greatly appreciated! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.64,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
 
 
    {
        "id": "1hspyx0",
        "title": "Citizenship of out of wedlock child",
        "score": 0,
        "num_comments": 7,
        "author": "Cultural_Wolf_3668",
        "created_utc": 1735920721.0,
        "created_readable_utc": "2025-01-03 16:12:01 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1hspyx0/citizenship_of_out_of_wedlock_child/",
        "permalink": "https://reddit.com/r/immigration/comments/1hspyx0/citizenship_of_out_of_wedlock_child/",
        "selftext": "So a long time friend and I hooked up. It was meant to be a one time thing, except it wasn't. She's now pregnant and we have a relationship. We've gotten a lot of judgement from both families regarding our decision not to get married. We don't need any more opinions. Before anyone asks, yes I'm a 1000% confident that the baby is mine. She had the entire last 2 months off from work and we've been doing nothing but fucking and spending time with one another. We've been each other's presence 24/7. \n\nWill the CRBA folks judge us, especially if it is a conservative country? \n\nAlso, once we are ready for marriage, does out of wedlock child affect our chances for approval? \n\nAlso, we've been told that to add my name to the birth certificate will mean a bribe. Just getting a birth certificate copy will mean a bribe; this is true whether or not parents are married. Are these bribes ok as far as the CRBA is concerned?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.36,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1hjezxq",
        "title": "CBP has racist brain dead employees",
        "score": 0,
        "num_comments": 18,
        "author": "OwnSky2771",
        "created_utc": 1734803226.0,
        "created_readable_utc": "2024-12-21 17:47:06 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1hjezxq/cbp_has_racist_brain_dead_employees/",
        "permalink": "https://reddit.com/r/immigration/comments/1hjezxq/cbp_has_racist_brain_dead_employees/",
        "selftext": "I went in for a crba. Presented all the documents and got CRBA and passport.\n\nFlew to America with my son and partner who is on B visa.\n\nWe're here until early January to visit my family and then flying back. \n\nThe CBP \"officer\" seemed really suspicious of my son's passport. He was suspicious about how my son got the passport because he thought my son wasn't my son. It appears that he was suspicious because of his next remark.  More than once he remarked about how he had never seen a out of wedlock child of a woman from my partner's country. She's from a very conservative country. He was fixated on why we hadn't gotten married yet. He was borderline racist to my partner claiming that foreign women \"trap\" American men. \n\nThen he started asking us questions about how we met (at a night club) and how we got together (we started as fuck buddies and upgraded to partners). Then he asked me why didn't I choose a \"classy\" American \"blonde\" woman. I didn't know what to say, so I just nervously smiled. I mean how the fuck am I supposed to answer a question like that.\n\nHe asked my partner her occupation and where she was going in the US (my mother's house), how many days she'll stay in the US (early January), her immigration status (work visa) in country where we live (not her home country), my immigration status (her dependent), and her salary (roughly €120,000).\n\nThen he pivoted back to marriage and asked us if we understood that she can't have immigrant intent at this time. So basically he warned us that any application for adjustment on this trip would be heavily scrutinized. All of this I get.\n\nThen he totally flipped his attitude on the marriage thing and congratulated me for not falling for the \"trap\" of marriage.  WTF?\n\nFinally he seemed satisfied and let us go.\n\nI get why he asked us about marriage. He wanted to make sure we're not going to bypass the rules and file for adjustment here. But some of his other comments reveal the racism of CBP and idiocracy. It seemed as if his tiny brain couldn't comprehend how a white man would want to be with a South Asian woman and how the South Asian woman would not only have a kid out of wedlock with said man, but also CHOOSE not to get married (oh imagine the horrors! \\s). \n\nPerhaps someone should inform CBP that children being raised by unmarried, cohabitating couples in a stable home is actually a thing now. That this can involve people who come from conservative cultures as well.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1hissrf",
        "title": "If the US embassy doesn't give me the crba certificate in time can we travel on esta?",
        "score": 0,
        "num_comments": 8,
        "author": "GroundSure7961",
        "created_utc": 1734726099.0,
        "created_readable_utc": "2024-12-20 20:21:39 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1hissrf/if_the_us_embassy_doesnt_give_me_the_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1hissrf/if_the_us_embassy_doesnt_give_me_the_crba/",
        "selftext": "I applied for a crba for my kid. The consular officer reviewed the evidence and said everything was alright. \n\nI asked him if they can give us an emergency passport and he said no because traveling home for Christmas isn't an emergency. \n\nThen can we fly on esta?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.44,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1heh0ck",
        "title": "How can the State Department change the law?",
        "score": 0,
        "num_comments": 8,
        "author": "Individual-Loss8969",
        "created_utc": 1734223539.0,
        "created_readable_utc": "2024-12-15 00:45:39 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1heh0ck/how_can_the_state_department_change_the_law/",
        "permalink": "https://reddit.com/r/immigration/comments/1heh0ck/how_can_the_state_department_change_the_law/",
        "selftext": "So basically, my brother has become and asshole. My brother married this girl and then cheated on her while she was pregnant. The birth happened right before the divorce finalized. He's never seen my niece's face and has never paid a dime in child support. Mother has full custody and I chip in when I can. \n\nI was looking at the requirements for CRBA and it seems they have changed.\n\nSee this: https://web.archive.org/web/20240705212148/https://travel.state.gov/content/travel/en/legal/travel-legal-considerations/us-citizenship/Acquisition-US-Citizenship-Child-Born-Abroad.html\n\n> A person born abroad in wedlock to a U.S. citizen and an alien acquires U.S. citizenship at birth if the U.S. citizen parent has been physically present in the United States or one of its outlying possessions prior to the person’s birth for the period required by the statute in effect when the person was born (INA 301(g), formerly INA 301(a)(7)). \n\n> For birth on or after November 14, 1986, the U.S. citizen parent must have been physically present in the United States or one of its outlying possessions for five years prior to the person’s birth, at least two of which were after the age of 14.\n\nAnd now see this \n\n> A child born on or after November 14, 1986 will obtain citizenship if:\n\n> The U.S. citizen parent was physically present in the United States or its territories for five years before the child’s birth. At least two of these years must be after age 14.  \n\n> A child must also meet other requirements including:\n\n> * At least one parent has a genetic or gestational connection to the child\n> * **Both parents in the marriage show a parental relationship with the child**\n> * **Examples of this relationship include: medical, tax, educational, or other documents that show the individual has acted in a parental role**\n>     If this requirement is not met, the child may be able to obtain citizenship as a child born out of wedlock\n\nThis seems to be a new requirement. I'm not a lawyer, but from my days back in elementary school, Congress makes laws, not the executive branch.  To my knowledge, the basic law governing this situation hasn't changed since 1952 (unless you count the 1986 amendments reducing physical presence requirements).  Theoretically anyone with a deadbeat dad born in wedlock would have gotten citizenship up until as recent as July, if they can provide evidence of the physical presence, marriage, and parent's American citizenship. But now because of one change by the **executive** branch, not the **legislative** branch, my niece may be ineligible for citizenship, which is insane because, again, Congress makes laws, not the State Department.\n\nINA 301(g) doesn't say anything about someone \"acting\" as a parent. It just says that someone \"born... of parents.\" There's no doubt my brother is the biological and the legal father of my niece by virtue of his marriage to my ex-SIL. This means he is a parent. And since he was married to my ex-SIL at the time of birth, this birth is in-wedlock. \n\nAt the end of the day, if my asshole brother refuses to be involved in the process, will my niece be eligible for US citizenship? We don't need him to prove physical presence because we can provide affidavits from AT LEAST 10 people that he was present physically in the US. He was only 2 years ahead of me in high school. We went to the same college and our first jobs after college was at the same place. I don't mind collecting affidavits beyond my family. My high school teachers and college professors would be more than happy to write one. We have enough evidence on our own for the physical presence. Even for a passport my ex-SIL has full custody.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.11,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1h8hznp",
        "title": "Birth Aboard Question (CRBA) Question",
        "score": 1,
        "num_comments": 5,
        "author": "Agreeable-Purpose132",
        "created_utc": 1733537042.0,
        "created_readable_utc": "2024-12-07 02:04:02 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1h8hznp/birth_aboard_question_crba_question/",
        "permalink": "https://reddit.com/r/immigration/comments/1h8hznp/birth_aboard_question_crba_question/",
        "selftext": "I am a United Stated citizen and my newborn was born in Mexico where I currently reside with my wife who is a Colombian citizen. I am filling out the application for the CRBA and it's asking me to show all of my proof of residency in the US. I'm just curious how many years of proof do I need to go back? I've had 4 different addresses in the US over the past 8 years, do I need to prove proof of address for all of those addresses? How many years do I need to go back? Do I need to prove my proof of address for each year even if the address is the same? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.57,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   
    {
        "id": "1h5b6jm",
        "title": "N600",
        "score": 0,
        "num_comments": 2,
        "author": "Objective-Local7312",
        "created_utc": 1733187664.0,
        "created_readable_utc": "2024-12-03 01:01:04 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1h5b6jm/n600/",
        "permalink": "https://reddit.com/r/immigration/comments/1h5b6jm/n600/",
        "selftext": "Do both parents need to sign? My daughter has citizen rights through me and was born overseas. We couldn’t get her CRBA (despite qualifying) due to COVID restrictions. I’ve since moved back to the U.S. with her and brought her on ESTA to gain entry. Her father won’t sign for anything like that and we are battling it out in divorce court as well as Hague convention (I won but he’s appealing with no chance of winning). I need her citizenship verified to get her an ssn to continue receiving Medicare because she is disabled and goes to a “school” that runs on insurance. Medicare has flagged her account now after two years because of no ssn so it’s very urgent. I’ve read that she doesn’t need to proof lawful permanent residence because she has automatic citizenship through me, but the uscis website makes the lpr sound mandatory which makes no sense since she’s already a citizen?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1h4p59x",
        "title": "Birth Aboard Question (CRBA)",
        "score": 1,
        "num_comments": 3,
        "author": "Agreeable-Purpose132",
        "created_utc": 1733122486.0,
        "created_readable_utc": "2024-12-02 06:54:46 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1h4p59x/birth_aboard_question_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1h4p59x/birth_aboard_question_crba/",
        "selftext": "I am a United States citizen currently living in Mexico with my wife. We recently had a child, and I would like to begin the process of obtaining her CRBA. I understand that the interview requires the baby to be present. However, our daughter was born prematurely and at a low weight. The nearest U.S. consulate is either an 8-hour drive or a 2-hour flight from where we live, which I’m not comfortable with due to her fragility and the risk of exposure to germs. Has anyone heard of an exemption for bringing the child to the interview or the possibility of conducting it via video chat?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1h3k3cu",
        "title": "Husband rejected for US IR1 visa :(",
        "score": 29,
        "num_comments": 20,
        "author": "Ok-Carpet-8296",
        "created_utc": 1732994488.0,
        "created_readable_utc": "2024-11-30 19:21:28 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1h3k3cu/husband_rejected_for_us_ir1_visa/",
        "permalink": "https://reddit.com/r/immigration/comments/1h3k3cu/husband_rejected_for_us_ir1_visa/",
        "selftext": "Following are brief details on my husband.\n\nFather was a US citizen born in the USA, mother wasn't. Born out of wedlock after 1986. Total time in US was approximately 15 years before birth, with at least 2 after age 14. Original birth certificate didn't have FIL name, but was amended when my husband was 6 months old by means of a formal acknowledgement of paternity. My FIL only found out about my husband's existence when he was 6 months old. FIL didn't take care of CRBA when my husband was younger.\n\nWe had originally explored getting US citizenship for my husband, but our lawyer advised us that since my FIL never made an explicit promise to support my husband at a US embassy, he isn't a citizen. FIL was a single father because my MIL was addicted to drugs.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.79,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1h00s07",
        "title": "Returning to the US with a fiance and foreign child",
        "score": 0,
        "num_comments": 5,
        "author": "Ok-Carpenter692",
        "created_utc": 1732586960.0,
        "created_readable_utc": "2024-11-26 02:09:20 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1h00s07/returning_to_the_us_with_a_fiance_and_foreign/",
        "permalink": "https://reddit.com/r/immigration/comments/1h00s07/returning_to_the_us_with_a_fiance_and_foreign/",
        "selftext": "Hello everyone,\n\nMy child with my fiance was born 6 months ago. Shortly after, I filed a I-129F.\n\nIt seems plans have changed. She's been offered a postdoc position and they are willing to sponsor an H1B (cap-exempt) as long as we get married.\n\nWe will get married next week.\n\nMy questions are:\n\n1. Should I withdraw the I-129F formally?\n\n2. Should I file the I-130 just in case?\n\n3. The marriage certificate will take probably 6 weeks to come. But, our appointment with the US embassy for CRBA is in 4 weeks. So we will be married before the appointment, but will not have the marriage certificate until after the appointment. Considering that our child is born when we weren't married to each other, my child would get citizenship under INA 309(a). Thus, assuming I fulfill all the requirements in this statute, my child would be a citizen regardless of our marital status. Therefore, do we really need the marriage certificate? What value could it add?\n\nEDIT: title should have foreign-born",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1gzetng",
        "title": "CRBA, Mistake found after the sworn interview",
        "score": 1,
        "num_comments": 2,
        "author": "FlakyAd6050",
        "created_utc": 1732525863.0,
        "created_readable_utc": "2024-11-25 09:11:03 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1gzetng/crba_mistake_found_after_the_sworn_interview/",
        "permalink": "https://reddit.com/r/immigration/comments/1gzetng/crba_mistake_found_after_the_sworn_interview/",
        "selftext": "Please help.\nI submitted CRBA application for my daughter. After the interview the officer requested more documents as proof of residence.\nWhen trying to work on those, I realized that I made a mistake on the dates and missed to declare a period of 5 months when I was outside of USA. Please let me know how can I correct my mistake if already had the sworn interview ? I’m so confused.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1gyheqv",
        "title": "Getting my son an L2 visa",
        "score": 0,
        "num_comments": 4,
        "author": "Open_Programmer4283",
        "created_utc": 1732418002.0,
        "created_readable_utc": "2024-11-24 03:13:22 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1gyheqv/getting_my_son_an_l2_visa/",
        "permalink": "https://reddit.com/r/immigration/comments/1gyheqv/getting_my_son_an_l2_visa/",
        "selftext": "I have a CRBA and a US passport and have probably spent 5 years physically in the US with 2 of them after 14. But I don't have very good proof of the 2 years after age 14. If someone is interested, they can see what I have at the end, but I don't think it is enough.\n\nMy partner and I want to move to the US. She'll be on L1 visa.\n\nMy son was born out of wedlock and he is 3, so I doubt he'll be getting married anytime soon.\n\nIf I don't make any explicit promise of financial support can we avoid wasting $100 to apply for a CRBA and just get the L2 visa? \n\n**Extra Details**\n\n6 months were school holidays between ages 14-18 for which I don't have good travel records. I can only get photos/souvenirs, passport stamps of my siblings and my parents, and affidavits from my extended family in my American side. The other 6 months I worked, so W2 I have. Finally, the remaining year, I have email records showing travel reservations, I could combine that with affidavits.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.29,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   
    
    {
        "id": "1gp3hlv",
        "title": "CRBA physical presence 2 years after 14",
        "score": 0,
        "num_comments": 38,
        "author": "Defiant_End151",
        "created_utc": 1731359890.0,
        "created_readable_utc": "2024-11-11 21:18:10 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1gp3hlv/crba_physical_presence_2_years_after_14/",
        "permalink": "https://reddit.com/r/immigration/comments/1gp3hlv/crba_physical_presence_2_years_after_14/",
        "selftext": "Hello, im the american citizen woman born and raised till i was 11 years old. \nThen my parents brought me to Mexico, ever since ive been living in Mexico, im married and have 2 kids (14 and 12 years old). I wanted to apply for CRBA for them but dont meet up with 2 years after 14. Does my 11 years before work or need to do another type of process (i-130 or n600k). Thanks on behalf.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1gopah6",
        "title": "No CRBA as a minor, possible to apply for passport?",
        "score": 10,
        "num_comments": 30,
        "author": "thejuiciestvow",
        "created_utc": 1731321287.0,
        "created_readable_utc": "2024-11-11 10:34:47 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1gopah6/no_crba_as_a_minor_possible_to_apply_for_passport/",
        "permalink": "https://reddit.com/r/immigration/comments/1gopah6/no_crba_as_a_minor_possible_to_apply_for_passport/",
        "selftext": "Basically as the title says. My mom is a US citizen who had me abroad and never went to file for CRBA. I wasn’t aware until a couple of years ago when I went to ask her for my documents for higher education related reasons. I went to school and was able to do everything my friends did growing up so I never suspected anything. Apparently she spoke to lawyers about filing my citizenship over the years but they all tried to convince her to go back abroad and file crba from there, but we’ve never been in the best place financially and she didn’t want to do it. Now I’m an adult (22) and I have no proof of citizenship. I went with her to speak with a few lawyers as well after finding out but they all were charging a ridiculous amount of money. Between the pandemic and several medical and family emergencies it just seemed like we never could find the time or money to do it. But I recently had someone tell me I could just file for a passport as long as I can prove she’s my mother, which I obviously can. Is this true? This would make things a lot simpler. I’ve honestly been extremely fearful with the current hostile climate towards undocumented citizens. Especially with what seems to be coming. So if I can do this quickly I would do it in a heartbeat. Thank you for taking the time to read this. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.77,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1gbg5qa",
        "title": "Is CRBA denial proof a person isn't a citizen?",
        "score": 0,
        "num_comments": 4,
        "author": "RevenueOk4093",
        "created_utc": 1729811549.0,
        "created_readable_utc": "2024-10-24 23:12:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1gbg5qa/is_crba_denial_proof_a_person_isnt_a_citizen/",
        "permalink": "https://reddit.com/r/immigration/comments/1gbg5qa/is_crba_denial_proof_a_person_isnt_a_citizen/",
        "selftext": "Suppose a child is born abroad. The child doesn't have a government birth certificate issued by the country of birth, but there is hospital documentation on the birth which the parents present to the consulate (for example, a statement by the doctor who attests to the identity of the mother). \n\nThe parents cannot obtain a government issued birth certificate for some reason. Normally, the Department requires a government issued birth certificate for a CRBA and the requirement cannot be waived for mere inconvenience. The State Department determines the hospital evidence isn't enough for proof of birth and the parents don't have a good enough reason to not present a birth certificate. The Department determines the parents can obtain the birth certificate. So it issues a letter for additional information. Now, the parents still believe they can't obtain the birth certificate. So they don't give it to the consulate. \n\nNow, here are some additional facts:\n\n1. DNA tests done by the consulate are positive and show parent child relationship.\n\n2. The father is a US citizen by birth and has a US birth certificate\n\n3. the father lived in the US his entire life and the child is still visibly an infant who at the most was born 3 years ago, which is well after the father satisfied the physical presence requirements. Father shows physical presence with strong evidence\n\n4. Doubts about exact date of birth mean the consulate may doubt about whether the child was born in or out of wedlock. Thus, the father acknowledges paternity under oath and agrees to support the child till age 18. \n\nFrom the perspective of 1-4, the child is a citizen whether born in or out of wedlock.\n\nHowever, the CRBA is denied because the Department determines adequate proof of birth was not provided. Now, under 22 CFR 50.2 the State Department is obligated to make a determination of citizenship/nationality of the applicant.\n\n> The Department **shall** determine claims to United States nationality when made by persons abroad on the basis of an application... for a Consular Report of Birth Abroad of a Citizen of the United States of America.\n\nIn this case, would a CRBA denial mean the Department has determined the child isn't a citizen? Or would the Department deny the CRBA, but acknowledge that in light of facts 1-4 the child is a citizen?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1gavkmj",
        "title": "CRBA might be denied",
        "score": 0,
        "num_comments": 5,
        "author": "Acceptable_Fault3140",
        "created_utc": 1729748589.0,
        "created_readable_utc": "2024-10-24 05:43:09 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1gavkmj/crba_might_be_denied/",
        "permalink": "https://reddit.com/r/immigration/comments/1gavkmj/crba_might_be_denied/",
        "selftext": "I've been researching the CRBA process for our newborn baby. On the embassy website the process seems straightforward. However, I am still extremely concerned the CRBA may be denied. I've read this [post](https://www.visajourney.com/forums/topic/431566-our-story-crba-for-our-child-denied-entering-the-us-with-a-baby-transportation-letter-and-citizenship-through-the-cca/) on VisaJourney.\n\nOne key section I want to quote is \n\n> The CRBA process is also described in numerous forums, so I will keep it short: I had to prove my physical presence in the US. I did spend a lot of time as a child and teenager abroad through my parents work. I brought school records, doctors bills, pay stubs from my parents while employed in the US, business documents of my company, tax returns, my wives green card process which was done in the US(!) - but - all this and much more wasn't enough to satisfy the consular officer. We were dumbstruck by how we were treated and that the amount of evidence didn't accumulate to 5+ years (for them). Our application was denied! If you do this process, be sure to show them at least 10+ years of evidence, since they bump off a certain amount of months for each year.\n\nI know what people will say: this is the internet and you shouldn't listen to people on the Internet. But, this guy had a pretty lengthy post and he was describing his experience. I don't think it is false.\n\nThe post was made in 2013 and the laws haven't changed and neither has the level of evidence changed. You need to prove physical presence with a perponderance of evidence.\n\nSo he had both quantiity and quality in his evidence. School transcripts are considered the gold standard from many other internet posts I've read. Plus, he had other evidence to add to that, including his parents pay stubs which are an indirect evidence of his physical presence. Finally, the tax returns, if he filed as a resident taxpayer, would have meant he satisfied the substantial presence test of the IRS. This further accounts for his physical presence. Thus, I am wondering why they denied his child's CRBA.\n\nFor myself, I have some pretty similar evidence\n\n1. Middle, high school transcripts -- these demonstrate at least 180 days/year*6 years =1080 days of physical presence since I attended school for approx 180 days each school year. \n\n2. Paystubs and W-2 from 2018-2020 and 2022 (didn't work in 2021). \n\n3. Parents tax returns from 2000-2006 which include their W-2. \n\n4. Utility bills from 2018-2022\n\n5. Immunization records, which indicate I was in the US when I got the shots, including my earliest shots\n\nIs this enough?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.2,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1g9ufv6",
        "title": "Documents for N-600",
        "score": 1,
        "num_comments": 2,
        "author": "LawTraditional6996",
        "created_utc": 1729634629.0,
        "created_readable_utc": "2024-10-22 22:03:49 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1g9ufv6/documents_for_n600/",
        "permalink": "https://reddit.com/r/immigration/comments/1g9ufv6/documents_for_n600/",
        "selftext": "I am submitting a N-600 and I am confused on the supporting documents. If you want to skip the backstory I've written my questions at the end.\n\n**Backstory**\n\n* Born to a US citizen father and an at-the-time foreign mother who never married each other. Dad has been pretty much in the US his entire life.\n\n* Mom married my American stepfather and I got my green card through stepparent sponsorship because bio dad refused to sign the documents for a CRBA. Originally, dad wasn't on my birth certificate.\n\n* Mom naturalized when I was 7\n\n* When I turned 9, my bio dad came back in my life and took steps to develop a relationship with me which succeeded \n\n* Bio dad petitioned the family court for visitation and asked the court to impose a child support order on him. Mother retained sole physical and legal custody. This was in context of paternity lawsuit.\n\n* After the paternity was adjudicated by the court, my dad signed legal documents to amend my birth certificate and add his name.\n\n**Questions**\n\n1. If I have a claim to citizenship under two seperate parts of the law, should I separate my documents into different sections based on which document belongs for which type of claim? Or should I just attach documents in the order listed in the instructions?\n\n2. For some documents that are required but don't exist, it says to submit an affidavit. My father married and divorced a woman who is not my mother and my mother has only ever married my stepfather. I will submit these marriage certificate and dad's divorce certificate. But, a marriage certificate doesn't exist between my two parents. Does this mean that my mom and dad should write affidavits indicating their marital history? \n\n3. Can I travel in and out of the country using my green card while the N-600 is pending?\n\n4. The instructions say \"You should submit legible photocopies of requested documents unless the Instructions specifically instruct you to\nsubmit an original document.\" The line for the birth certificate says \"You must submit a birth certificate or record of your U.S. citizen parent issued and certified by a civil authority in the country of birth.\" Does this mean they want a certified copy of the birth certificate which is a photocopy of the \"original\" birth certificate stamped and signed by the local county or does it mean they want me to take the certified copy of the birth certificate and go to a copier?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1g7gqr8",
        "title": "VERY CONFUSED on CRBA and physical presence.",
        "score": 0,
        "num_comments": 17,
        "author": "Silent-Sentence-9563",
        "created_utc": 1729366404.0,
        "created_readable_utc": "2024-10-19 19:33:24 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1g7gqr8/very_confused_on_crba_and_physical_presence/",
        "permalink": "https://reddit.com/r/immigration/comments/1g7gqr8/very_confused_on_crba_and_physical_presence/",
        "selftext": "I've read the directions for the CRBA and I am quite confused. \n\nThe CRBA form says to list \"precise periods of time in the United States.\" How does the US government expect you to remember the exact day you returned to the US if you took multiple foreign trips as a kid and you don't have your old passports?\n\nDuring summer vacation in elementary and middle school, I would sometimes go overseas to visit family. I don't remember which specific years I went overseas and which I didn't. Neither do my parents. \n\nSince the form asks for \"precise periods of time in the United States\" as opposed to estimates, I am a bit uncomfortable with swearing that everything is correct, given the uncertainty around the exact dates I was in the USs. Instead, can I just write a statement on a separate sheet of paper saying something like\n\n> Declaration on physical presence\n\n> I, u/Silent-Sentence-9563, born on MM/DD/YYYY in _________, _______, USA with United States passport number XXXXXXXXX declare:\n\n> 1. I physically attended elementary, middle, and high school in _____, _______, USA for the academic years 20XX-20XX as evidenced by my attached school transcripts. As my state mandates that students have 180 days of instructions, I estimate I was physically present for a total of at least 1620 days in the United States between 20XX-20XX academic years and at least 540 days in my 10th, 11th, and 12th grade academic years.\n> 2. I attended University1 in _______, ______, USA for the academic years 20XX-20XX as evidence by my attacheed  transcripts from University1. This university has two semesters in one academic year and 18 weeks per semester. Thus, I estimate I was physically present in the United States for a total of at least 720 days during the academic years of 20XX-20XX.\n> 3. I attended University2 in _______, _______, USA for the academic years 20XX-20XX as evidenced by my attached transcripts from University2. This university has two semesters in one academic year and 18 weeks per semester. Thus, I estimate to have been physically present in the United States for a total of at least 180 days during the academic years of 20XX-20XX.\n> 4. Thus, I estimate I have been physically present for at least 3060 days in the United States before MM/DD/YYYY which is the date of birth of my child, ________. \n> 5. Of the aforementioned 3060 days, 1440 days were after MM/DD/YYYY which is my 14th birthday.\n> 6. My attached immunization records and tax transcripts for the calendar years 20XX-20XX provide further evidence of my physical presence in the United States before the birth of my child ________.\n\n> I declare under penalty of perjury under the laws of the United States of America that the foregoing is true and correct. Executed on MM/DD/YYYY.\n> Signature\n\nAlso what sort of questions will be asked at the interview?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1g6bkwt",
        "title": "CRBA request for more information",
        "score": 0,
        "num_comments": 4,
        "author": "Every-Remove4407",
        "created_utc": 1729232309.0,
        "created_readable_utc": "2024-10-18 06:18:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1g6bkwt/crba_request_for_more_information/",
        "permalink": "https://reddit.com/r/immigration/comments/1g6bkwt/crba_request_for_more_information/",
        "selftext": "The US embassy asked me to send in more proof we fucked each other and have suggested a DNA test.\n\nWe can do a DNA test, but out of curiosity what other documents would prove that we fucked? We have extremely raunchy text messages, which we didn't show for obvious reasons. Now I think I should have brought them.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.13,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1g5w7vz",
        "title": "Advice on birth certificate for immigration",
        "score": 1,
        "num_comments": 0,
        "author": "Background_Ring1805",
        "created_utc": 1729185690.0,
        "created_readable_utc": "2024-10-17 17:21:30 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1g5w7vz/advice_on_birth_certificate_for_immigration/",
        "permalink": "https://reddit.com/r/immigration/comments/1g5w7vz/advice_on_birth_certificate_for_immigration/",
        "selftext": "I'm from California. I'm going to fill out this (form)[https://parentage.dcss.ca.gov/wp-content/uploads/sites/339/2022/08/DCSS-0909_VDOP-Sample_08222022.pdf] once I get a good copy from them. This form is the voluntary declaration of parentage form for child born to unmarried parents from California. The form says \n\n> Each party declares under penalty of perjury under the laws of the State of California that they have been informed of and understand the Alternatives, Rights, Responsibilities, and Consequences, as written on the back of this form, and that the information they have provided is true and correct. Each party affirms that no other individual can legally claim parentage of the child and accepts the responsibilities to provide child support as determined by applicable law. Each party wishes to be named on the child's birth certificate and agrees that the other parent will be named on the birth certificate. Each party affirms that they are signing this form voluntarily, without being subject to force, threat or coercion.\n\nDoes this count as acknowledgment under oath for CRBA? The reason I'm even signing this form in the first place is the local civil registrar usually does the acknowledgement of paternity, but they are extremely backlogged. So it has been difficult to get my name added to the birth certificate which was already issued. But they will accept a declaration of paternity from my home state.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1g5apa8",
        "title": "Found SSN card.",
        "score": 1,
        "num_comments": 3,
        "author": "Striking_Success_673",
        "created_utc": 1729114304.0,
        "created_readable_utc": "2024-10-16 21:31:44 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1g5apa8/found_ssn_card/",
        "permalink": "https://reddit.com/r/immigration/comments/1g5apa8/found_ssn_card/",
        "selftext": "I'm a foreign born child of my US citizen father. My father passed away when I was 10 and my parents were never married. I currently don't have a US passport, but I do have a SSN and also my dad's SSN card. My mom and dad had a very contentious relationship and I think my mom never agreed for me to get a US passport. She doesn't know (or she knows but doesn't want to tell me) what my father did when he had his visitation with me when I was a toddler. But I do have a foreign passport now. \n\nMy questions are:\n\n1. What are the chances my father registered my birth with the US embassy based on the fact I have a SSN?\n\n2. How can I verify if this is a legitimate SSN card? I ask this because of the strange way I found this. The way I got this SSN card was because I am moving out from my mother's place and I went to the cabinet where she places all important documents. I grabbed the ones related to me and left. I didn't see a US passport, but I doubt one was issued. I didn't see a CRBA. I didn't normally see these documents and I remember only seeing my birth certificate and death certificate of my father for the first time when the foreign passport was issued about 8 years ago when my first foreign passport was issued. My grandmother gave me my dad's SSN card.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1g3nmv7",
        "title": "ID of the foreign parent when applying for CRBA",
        "score": 1,
        "num_comments": 0,
        "author": "Independent-Ride1307",
        "created_utc": 1728932195.0,
        "created_readable_utc": "2024-10-14 18:56:35 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1g3nmv7/id_of_the_foreign_parent_when_applying_for_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1g3nmv7/id_of_the_foreign_parent_when_applying_for_crba/",
        "selftext": "I've had a child with my partner who has been granted a residence permit as a refugee. When she first sought asylum, her passport was confiscated. Since then, she hasn't left this country. She doesn't have a refugee travel document that can serve as a passport. Her main forms of ID are her residence permit and driver's license. We see the US embassy requires a passport. Should we apply for a refugee travel document or can we use the driver's license, her residence permit, and a copy of her old passport?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1fz4x18",
        "title": "CRBA visa interview",
        "score": 1,
        "num_comments": 2,
        "author": "Known-Drawer-1001",
        "created_utc": 1728407189.0,
        "created_readable_utc": "2024-10-08 17:06:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fz4x18/crba_visa_interview/",
        "permalink": "https://reddit.com/r/immigration/comments/1fz4x18/crba_visa_interview/",
        "selftext": "I am submitting the eCRBA but there are no appointments until November. Can we present the documents in my partner's work visa interview if the baby is there?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },


    {
        "id": "1fuodc8",
        "title": "Pretty embarrasing situation",
        "score": 1,
        "num_comments": 6,
        "author": "Chance_Frosting2594",
        "created_utc": 1727896269.0,
        "created_readable_utc": "2024-10-02 19:11:09 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fuodc8/pretty_embarrasing_situation/",
        "permalink": "https://reddit.com/r/immigration/comments/1fuodc8/pretty_embarrasing_situation/",
        "selftext": "I am kind of embarrased. I hooked up with a foreign woman in a bar. We didn't use protection. She got pregnant. The decision was made to have the baby. I found out some good places to do a DNA test in that country and now I know I'm the father. I got my name added to the birth certificate in her home country. \n\nThese are yes/no questions.\n\n1. Reading websites of US embassies for CRBA procedure, I think they will ask how we met and how the child was conceived. Is \"we met at ______ bar and hooked up there\" an acceptable answer? \n\n2. This is a high fraud, conservative country. So I am not sure if they will believe our story. We deleted all of our text messages because we were embarrased. Other than DNA testing we already did and my passport stamp showing entry into the country, we don't much other evidence. If the embassy recommends a DNA test and it turns positive, I acknowledge I am the father in writing under oath, I agree to support the child, and provide sufficient proof I have lived in the US for at least 5 years, 2 after 14, before birth, can citizenship still be denied?\n\n2. For the transcripts, my high school sends official transcripts by stamping them and sealing them in an envelope. The seal means provides assurance the transcripts haven't been tampered with and the directions say that when using transcripts for official purposes like college admissions, the envelope shouldn't be opened. But the eCRBA requires me to scan the documents before the interview. Should I open the envolope?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.53,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1fsks68",
        "title": "My brother is a us citizen at birth and is trying to make his 5/o daughter a citizen but she is in Mexico and has a Mexican mother….",
        "score": 5,
        "num_comments": 17,
        "author": "kargra",
        "created_utc": 1727661818.0,
        "created_readable_utc": "2024-09-30 02:03:38 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fsks68/my_brother_is_a_us_citizen_at_birth_and_is_trying/",
        "permalink": "https://reddit.com/r/immigration/comments/1fsks68/my_brother_is_a_us_citizen_at_birth_and_is_trying/",
        "selftext": "Help! we are trying to figure out if my brother qualifies for a CRBA for his daughter. He is turning 25 soon and his kid is 5 in which the mother is Mexican and they never got married. We looked into this form but it says something about him needing to qualify for certain residency time as a requirement. Now we moved to Mexico when he was 3 and he crossed by land back to the USA around 2018 when the mother of his child was pregnant. He’s  been in the USA since, and he has only been out to visit a short period of time and comes back to the US. We contacted a lawyer but she said they don’t work on those cases so she is not entirely sure. The lawyer said we must read the law and do research on our own, but it is so confusing and now we do not know if he qualifies or if he sends over the  DS-5507 to the consulate and doesn’t qualify will his child or him be penalized? Can that jeopardize the kids chance of citizenship? Or if anyone is familiar with the requirements Do they qualify for the  CRBA? \nPlease and thank you anyone ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.65,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1frxvqa",
        "title": "Can't find marriage certificate. Please help",
        "score": 0,
        "num_comments": 0,
        "author": "Elegant-Spinach1287",
        "created_utc": 1727590282.0,
        "created_readable_utc": "2024-09-29 06:11:22 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1frxvqa/cant_find_marriage_certificate_please_help/",
        "permalink": "https://reddit.com/r/immigration/comments/1frxvqa/cant_find_marriage_certificate_please_help/",
        "selftext": "I'm married to my wife of 2 years and I live outside the US. We had a baby 3 days ago and we want to get the ball rolling on the CRBA.\n\nI have most of the papers, but for the life of us, we can't find our original marriage certificate. We could order a new one, but the appointment is like in 2 weeks and I doubt we could get it by then. We got married in her country, and her country's is undergoing violence. Hell, even the US embassy has issued a level 4 do not travel warning. We don't live in the country where there is violence and where we got married.\n\nWe've got two things we are looking to do to mitigate this:\n\n1. My wife's a dual citizen. So when we got married she informed her other country and her other country transcribed the marriage certificate in their civil registers.  We could get a copy of that transcribed certificate. It is not the original marriage certificate but is better than nothing. We can provide shit like pictures and stuff to verify our marriage.\n\n2. I acknowledge we are married in the eCRBA form and everything. However, I  make a separate statement on a plain piece of paper acknowledging paternity and agree to support him financially until 18.  In this statement I make no mention of my marital status. I sign this statement under penalty of perjury, which I've learned has same effect as under oath if I follow the procedure in 28 U.S. Code § 1746. This way, my kid is a citizen regardless of whether or not I'm married.\n\nWill the lack of a marriage certificate hinder CRBA?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1frmo77",
        "title": "How quickly can my child move to the US?",
        "score": 0,
        "num_comments": 9,
        "author": "Famous_Cartoonist728",
        "created_utc": 1727553326.0,
        "created_readable_utc": "2024-09-28 19:55:26 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1frmo77/how_quickly_can_my_child_move_to_the_us/",
        "permalink": "https://reddit.com/r/immigration/comments/1frmo77/how_quickly_can_my_child_move_to_the_us/",
        "selftext": "Hi,\n\nThank you for answering our questions.\n\nSo my girlfriend was born in the USA and she left when she was 3. She goes every few years to meet relatives.\n\nI am a US citizen born abroad to a US citizen parent but haven't ever really lived there. I make a trip every year for a few weeks to meet cousins.\n\nWe want to move to the US and we have a child. But we aren't sure whether the child needs a green card or we can apply for citizenship through CRBA or N-600K. Our kid was born 3 years ago. \n\nThe easiest route would be the CRBA, but we're not sure what \"resided\" means. \n\nFor the N-600K, we can rely on our parents' physical presence so using grandparent's physical presence. We don't immediately plan to move to the US when the N-600K is approved so we can enter with our kid with non-immigrant intent if our kid is not already a US citizen. We see from online that the N-600K can take 6 months. Our move is probably over 1.5 years.\n\nFinally, for the green card, we're not sure if we can meet the public charge requirements. Do we need a joint sponsor? \n\nIf my girlfriend's 3 years of residence counts, what evidence could we present? Every post I've seen assumes the other parent is a foreign national which means the US parent needs 5/2 years. But here, both of us are US citizens and the main state department website just says either parent needs to have  \"resided.\"",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1fpnea3",
        "title": "CRBA for a child of naturalized citizen?",
        "score": 2,
        "num_comments": 9,
        "author": "desertgem_7887",
        "created_utc": 1727322606.0,
        "created_readable_utc": "2024-09-26 03:50:06 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fpnea3/crba_for_a_child_of_naturalized_citizen/",
        "permalink": "https://reddit.com/r/immigration/comments/1fpnea3/crba_for_a_child_of_naturalized_citizen/",
        "selftext": "I was born in Mexico and moved to the U.S. when I was 8 years old and my family and I got a green card. In 2015, when I was 21 I became a U.S. citizen through naturalization. I lived in the U.S. until 2021-2022 when I moved to a border town in Mexico and continue working remotely for a U.S.-based company. My fiancée is pregnant and we are considering our options of either having the baby in the U.S. or here in Mexico. Can I request a CRBA for him through the Consulate if I'm naturalized? Are there any risks if we go this route? What kind of documentation should I submit? My fiancee only has a tourist visa and we are trying to avoid any hassle of her giving birth in the U.S. if possible.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1fm2tc1",
        "title": "US birth abroad; painful",
        "score": 3,
        "num_comments": 21,
        "author": "danjonwig",
        "created_utc": 1726924674.0,
        "created_readable_utc": "2024-09-21 13:17:54 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fm2tc1/us_birth_abroad_painful/",
        "permalink": "https://reddit.com/r/immigration/comments/1fm2tc1/us_birth_abroad_painful/",
        "selftext": "Am not looking for advice, so much as commiseration.\n\nMy wife is American, and I'm not. We live outside the US. We have 3 kids. I registered the first 2 kids' births at the consulate (CRBA), and subsequently got their passports. Kid 3 was born during Covid, so I did it in the opposite order; we got his passport without the CRBA. Now, I am finally getting the paperwork together to apply for his report of birth abroad. I know, this is not technically needed given that he already has his US passport, but there are certain bureaucratic contexts in which I have found it useful to have the CRBA in addition to the passports for the other kids.\n\nThe [state.gov](http://state.gov) website, the passport application process, and the consular staff have frequently disagreed with each other about the requirement re US presence. They frequently use \"presence\" and \"residence\" interchangeably. Given this, when I applied for kiddo #1, I prepared two versions of the form in advance of our visit. The first listed the periods my wife lived in the US (easy: a single period right up to the time I whisked her away in her 20's). The second listed the periods my wife was physically present in the US. This second form was painful to assemble, because she was on a team that represented the US at international competitions from the time she was an early teen. She travelled internationally ALL THE TIME. Plus, we travel to the US frequently for business. That form had more than 30 \"periods of presence\" in the US. I used her passport stamps and the results of a freedom of information request to DHS to get her travel history as best I could.\n\nI showed both forms to the consular staff, and asked them which one they wanted. The fellow laughed at me, and took the shorter form.\n\nFor kid #2, I brought only the shorter form.\n\nWhen applying for passport for kind #3, I sent only the shorter form. They sent a follow-up requesting more information, which again conflated residence and presence, and we pointed this out via a letter, and they eventually issued the passport. No problem.\n\nNow I'm finally getting around to applying for CRBA for kid #3. Now, they have a fancy web interface. Now, THAT form does NOT conflate presence and residence. In fact, they explicitly give an example of a person taking a brief trip ending one period of presence, and beginning another.\n\nKid #1 is 7 years older than kid #3, so I now have to assemble another 7 years worth of travel history. I'd bet there will be another 20 or 30 trips to the US, some as short as a couple of hours, e.g. to apply for kid #3's passport (had to do this at a post office). One trip literally lasted only 30 minutes to do a Nexus interview. Obviously we don't count the times spent in the water over the border without landing, or in US airspace with origin and destination airports outside the US. But this is all so dumb.\n\nThis web form is PAINFUL. You can't type the dates, you have to click around in a horrible UI. You can't type the name of a state like a normal drop-down box.\n\nI'm told there's now a web portal where I can get her travel history from DHS, so at least I may not have to file another FOA request.\n\nI yell to the universe: the US law requires only a certain minimal amount of time in the US at particular life periods in order for kid #3 to qualify for US citizenship. Her period of physical presence #1 covers that requirement. Every piece of data entry, which will likely take a whole day, is not actually needed to satisfy this law. But, the form (but not the law) requires every period of presence up to the birth of the kiddo. So none of this data entry is actually necessary.\n\nNo doubt others on this forum have far more painful experiences. and this may land poorly. But on the off chance this can be a source of commiseration, thank you in advance for your warm wishes :)",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.56,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
    {
        "id": "1fkks7n",
        "title": "How long to receive copy of CRBA?",
        "score": 1,
        "num_comments": 0,
        "author": "Much_Discipline_7303",
        "created_utc": 1726752316.0,
        "created_readable_utc": "2024-09-19 13:25:16 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fkks7n/how_long_to_receive_copy_of_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1fkks7n/how_long_to_receive_copy_of_crba/",
        "selftext": "I was born to U.S. Citizens. My dad was in the army and was sent to Germany. I was born on base. I am in need of my birth certificate so I requested a copy of my CRBA. About a month ago they cashed my $50 check. Does this mean that they are in process of sending the copy? Any idea how long it will take to receive it?  Thank you for any help :)",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1fjyoy8",
        "title": "W/ the CRBA certificate can my son get his SS #??",
        "score": 2,
        "num_comments": 5,
        "author": "Elnino_300",
        "created_utc": 1726680981.0,
        "created_readable_utc": "2024-09-18 17:36:21 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fjyoy8/w_the_crba_certificate_can_my_son_get_his_ss/",
        "permalink": "https://reddit.com/r/immigration/comments/1fjyoy8/w_the_crba_certificate_can_my_son_get_his_ss/",
        "selftext": "So about two months ago I got my sons CRBA certification and passport can I get his SS number without him in the states still and is the passport and certificate enough for his SS number ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1f6k9tr",
        "title": "DS-2029 notorial certificate",
        "score": 1,
        "num_comments": 1,
        "author": "Relative-Ice3430",
        "created_utc": 1725212482.0,
        "created_readable_utc": "2024-09-01 17:41:22 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1f6k9tr/ds2029_notorial_certificate/",
        "permalink": "https://reddit.com/r/immigration/comments/1f6k9tr/ds2029_notorial_certificate/",
        "selftext": "I've run into some complications completing the paperwork because I'm in the US.\n\nFirst, many notaries didn't accept the DS-5057 because it didn't say a notary public could notarize it.\n\nFinally, I looked at the DS-2029 and the directions explicitly say you can notarized it at a notary public. So I got a notarized DS-2029.\n\nThis leads to my second problem. I live in California and California requires very specific wording for a jurat. If the wording isn't there, then it isn't a valid jurat according to California law. \n\nSo the notary attached two notarial certificates that was basically a template from the Secretary of State's website. He did not put his stamp on the DS-2029, but rather on the two notarial certificates and he labeled them Section B and Section C. Section B is for acknowledging the child and Section C is a general statement swearing everything is true. He attached these to the back of the third page.\n\nIs this going to be okay? My girlfriend will do the eCRBA at her end.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1f4guz1",
        "title": " Consular Report of Birth Abroad (CRBA)and  US passport for child born in Mexico ",
        "score": 0,
        "num_comments": 1,
        "author": "Blazzer2147",
        "created_utc": 1724974316.0,
        "created_readable_utc": "2024-08-29 23:31:56 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1f4guz1/consular_report_of_birth_abroad_crbaand_us/",
        "permalink": "https://reddit.com/r/immigration/comments/1f4guz1/consular_report_of_birth_abroad_crbaand_us/",
        "selftext": "I was looking for some guidance for the CRBA application and US passport for my daughter born in Mexico. \n\nThe main question I have is how do you apply for both at the same time or do you have to do them separately. Iv seen a video of someone who did both at the same time how ever they were not clear about it. \n\nSecond, on the CRBA application on the section \"Physical Presence\", how specific do you need to be the subsections \"Time in the US\" and \"Time Abroad\"? I have traveled to and from Mexico to many times to remember. As a child on Summer vacations and holidays we would travel to Mexico to visit family and as a young adult until now I have continued to visit.\n\nIf any one is familiar with the process if you could please share your experiance or any tips.\n\n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1f4g2m5",
        "title": "DNA test",
        "score": 0,
        "num_comments": 15,
        "author": "DueFall1318",
        "created_utc": 1724972173.0,
        "created_readable_utc": "2024-08-29 22:56:13 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1f4g2m5/dna_test/",
        "permalink": "https://reddit.com/r/immigration/comments/1f4g2m5/dna_test/",
        "selftext": "Suppose a child is born out of wedlock to a foreign mother and the alleged biological father is a US citizen, but there isn't enough indirect evidence to support that fact. Only mother's name is on the birth certificate, and due to some weird issues the father's name cannot be added.\n\nThe US citizen father meets ALL the other requirements to pass on citizenship. \n\nThe US embassy rejects the CRBA on the sole grounds that the there isn't enough evidence that the bio dad is the bio dad.\n\nThe alleged father and mother request DNA testing, but the US embassy also refuses because in this country paternity test is only allowed if a judge orders one. \n\nI understand it is the applicant's burden to prove the case. But here, the applicant is not even being given an opportunity to present all the evidence because the Embassy won't do a DNA test and the will not accept a DNA test done at home. \n\nThe US citizen father isn't being afforded the same right that would be afforded if the child was born in another foreign country.\n\nIt would seem highly unfair and unconstitutional to prevent the child from being recognized as a US citizen solely on the grounds of a quirk in the foreign country's laws.\n\nThe parents shouldn't be forced to resort to the foreign country's judicial system, when there are easier ways to prove paternity.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.38,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
    {
        "id": "1eyq0n9",
        "title": "Can you apply for a social security card at the same time as a CRBA?",
        "score": 0,
        "num_comments": 0,
        "author": "liberty340",
        "created_utc": 1724349486.0,
        "created_readable_utc": "2024-08-22 17:58:06 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1eyq0n9/can_you_apply_for_a_social_security_card_at_the/",
        "permalink": "https://reddit.com/r/immigration/comments/1eyq0n9/can_you_apply_for_a_social_security_card_at_the/",
        "selftext": "My daughter is going to be born soon in Mexico and I'm going to get her CRBA and passport, but can I also get a SSN at the consulate?  Or is there another way to get it before my family comes to the US?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1ey7uhy",
        "title": "Will I need the hospital birth certificate for the CRBA Appointment?",
        "score": 1,
        "num_comments": 2,
        "author": "Silly_Professional75",
        "created_utc": 1724292645.0,
        "created_readable_utc": "2024-08-22 02:10:45 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ey7uhy/will_i_need_the_hospital_birth_certificate_for/",
        "permalink": "https://reddit.com/r/immigration/comments/1ey7uhy/will_i_need_the_hospital_birth_certificate_for/",
        "selftext": "hey all, I am in a bit of a pickle... I processed the CRBA application online for my son (1.5 years old). I provided his birth certificate, my proof of citizenship, my wife's Mexican passport, our marriage certificate, and tax return documents to prove that I lived in the USA for almost 20 years. I submitted the form and proceeded to book my appointment. \n\nFast forward to now, a day and a half before the appointment.  I am going over all of my documents to make sure I have everything ready to go and I realized that one of the documents I'm supposed to bring is the hospital certificate of birth, which is separate to the official Mexican birth certificate.  I went to the public registry to try to get a copy since they kept the original once they gave me a formal birth certificate. \n\nMY question is, can I attend the interview with my wife and son, along with all the required documentation other than the hospital certificate? or will that be a \"deal breaker\"?\n\n  \nThanks in advance! any help is greatly appreciated...",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1exx6fd",
        "title": "US passport question",
        "score": 0,
        "num_comments": 7,
        "author": "Best_Acanthaceae9090",
        "created_utc": 1724265058.0,
        "created_readable_utc": "2024-08-21 18:30:58 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1exx6fd/us_passport_question/",
        "permalink": "https://reddit.com/r/immigration/comments/1exx6fd/us_passport_question/",
        "selftext": "I am a US citizen man by birth. I am filing a CRBA for my kid. On the DS-5507 and DS-2029 form it asks me to list my marriages. If I am married to one woman, but I had a kid with another woman, who I am not married to, will the Department of State tell my current wife about the kid? Or is that information protected by privacy laws?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
   

    {
        "id": "1eguwtq",
        "title": "L2 visa for possible US citizens",
        "score": 0,
        "num_comments": 7,
        "author": "Adventurous-Fix-9419",
        "created_utc": 1722451421.0,
        "created_readable_utc": "2024-07-31 18:43:41 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1eguwtq/l2_visa_for_possible_us_citizens/",
        "permalink": "https://reddit.com/r/immigration/comments/1eguwtq/l2_visa_for_possible_us_citizens/",
        "selftext": "My friend is a foreign national named \"Susan\" who was in a long-term relationship with a US citizen named \"Andy.\" They were not married.\n\nAndy did live for at least 5 years, 2 after 14 in the US.\n\nThey had two sons, twins. \n\nUnfortunately, Andy died of COVID 3 months after they were born back in 2020.\n\nAfter the death, Susan pushed herself into work and advanced a lot in her career. Now, because of her success, her company wants to transfer her to the US on an L1 visa. The I-129 looks set to be approved in the coming weeks.\n\nNow, to get the twins to the US they face a few issues.\n\n1. Proving biological relationship: Birth certificate has Andy's name. But the closest blood relatives of Andy who are living are Andy's mother (grandmother) and Andy's full brother (uncle). I am not sure if DNA can prove the biological relationship to 99.99 the US consulate may require.\n\n2. Legitimation/acknowledgment of paternity/court adjudication of paternity: The twins would only be legitimated if the parents married. Andy did not acknowledge paternity. He \"declared\" it. Thus, he is on the birth certificate. He did it in the government office where people usually do this. However, we are not sure whether it was \"under oath.\" There is no \"subscribed and sworn to\" in the acknowledgment, but it is signed and stamped by the foreign governmental authority. I should note that the US embassy in the country actually requests this statement when doing CRBA. The other twist is, he did this before the twins were born. As far as court adjudication of paternity, there were no court proceedings for the sole purposes of establishing paternity. Rather, it was in probate, that the foreign court just assumed Andy is the father of the twins because his name was on the birth certificate.\n\nGiven the fact that it is not clear-cut if the children were legitimated and whether the acknowledgment was done properly to get citizenship by US law, is it better if they just straight apply for L2 visa and not waste $100 for the CRBA?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.29,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   
    {
        "id": "1eg382x",
        "title": "CRBA",
        "score": 0,
        "num_comments": 5,
        "author": "Fantastic_Outcome_74",
        "created_utc": 1722369938.0,
        "created_readable_utc": "2024-07-30 20:05:38 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1eg382x/crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1eg382x/crba/",
        "selftext": "Does anyone know how long it takes for the CRBA + passport application to be approved? \nI already had the interview, and they have all the forms needed.\nThanks ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1edvpvd",
        "title": "CRBA System Error?",
        "score": 1,
        "num_comments": 1,
        "author": "jefflin74",
        "created_utc": 1722129089.0,
        "created_readable_utc": "2024-07-28 01:11:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1edvpvd/crba_system_error/",
        "permalink": "https://reddit.com/r/immigration/comments/1edvpvd/crba_system_error/",
        "selftext": "Hi, I am trying to apply the first passport of my new born. Although when I am directed to file through MyTravelGov, the system doesn’t allow me to select country from the down section, and the page will go blank if I try to type there, then I will need to redo again from the application and stuck here again. Tried different browsers, VPN, different laptops, and cleaned cookies but still not working. Anyone also faced this issue before? Thanks! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1edtm3y",
        "title": "Need practical advice for CRBA",
        "score": 0,
        "num_comments": 2,
        "author": "Ok-Size1032",
        "created_utc": 1722122643.0,
        "created_readable_utc": "2024-07-27 23:24:03 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1edtm3y/need_practical_advice_for_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1edtm3y/need_practical_advice_for_crba/",
        "selftext": "Sorry for long post.\n\nI am a US citizen living outside the US in country A and my partner/girlfriend is a citizen of country B.\n\nAt the end of June, we had a baby who was born in country B.\n\nNow we have started to look into the appointment process for CRBA and here the US embassy doesn't have appointments till late August. They tell us if we have urgent travel back to the US, we need to send them an email.  There are few problems with this:\n\n1. We don't have urgent travel back to the US, but back to country A because of job reasons. We **both** need to be back in country A by end of August. Her job starts at end of August and my paternity leave ends.\n\n2. For the urgent travel request, they expect us to send them a booked travel itinerary. This is odd considering that when foreign nationals apply for visas, the DoS says not to buy any tickets till you have the visa. I would expect similar logic to apply to passports. A passport is even more fundamental to travel than a visa because you can fly many places without a visa depending on which country's citizenship you hold. Why would you buy tickets without a passport?\n\n3. Problem 2 isn't so much of a problem right now because our baby can use country B's passport to travel to country A and get a residence permit in country A. However, we both have work trips to New York to meet clients beginning of September. She has a B1/B2 visa which is fine to use because she is just meeting clients. But we are not sure if we can get a US passport in time for our baby to enter the US by September.\n\nNow, applying for a CRBA from country A will take even more processing time because kid was born in country B so I am not sure CRBA and passport will be finished by September.\n\nIn this situation, looking at our options it seems they are:\n\n1. Get a B1/B2 visa in country A for the baby using visa interview waiver program since the applicant is a minor and a parent holds a B1/B2 visa (aka my gf). Those seem to be faster than CRBA and passport because appointments are within like 14 calendar days. \n\n2. I fly to Mexico with our baby (passport from country B allows visa free travel there). GF flies and enters on B1/B2. My gf, me, and baby show up at the land border to make sure CBP doesn't think I am abducting baby and so they can do a DNA test if they don't believe the birth certificate and we figure it out there.\n\nSo how can I get our baby a US passport before September?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1e9zvec",
        "title": "US passport for newborn. Can we just do DNA?",
        "score": 0,
        "num_comments": 22,
        "author": "Beautiful-Exit-9910",
        "created_utc": 1721712397.0,
        "created_readable_utc": "2024-07-23 05:26:37 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1e9zvec/us_passport_for_newborn_can_we_just_do_dna/",
        "permalink": "https://reddit.com/r/immigration/comments/1e9zvec/us_passport_for_newborn_can_we_just_do_dna/",
        "selftext": "I had a one night stand with a foreign woman. We did a DNA test before (a NIPP test so as to not harm the baby) and after birth and the child is mine, so we added my name to the birth certificate as the father. \n\nThe US embassy website is asking for proof of relationship and proof we were in the same place when conception happened. \n\nI don't want to give this evidence because some of it is highly personal. The most I am prepared to give is my passport with entry and exit stamps to show when I traveled into and out of the country, but anything else would feel highly invasive. I will pay for another DNA test initiated by the Embassy.\n\nMy questions are: \n\n1. Does doctrine of consular non-reviewability apply to adjudication of CRBA?\n\n2. Assuming that we present genuine documents, can the consular officer still deny the CRBA even if we present the following documents AND the DNA test is positive:\n\n* DNA test request letter\n\n* my certified copy of US birth certificate\n\n* My passport\n\n* Mother's passport\n\n* certified copy of birth certificate of child\n\n* Signed DS-5507, notarized by US notary. I will also print another copy if officer wants me to sign in front of him \n\n* K-12 transcripts and report cards and tax records showing I had physical presence in US for at least 5 years, 2 after 14\n\n* Fee",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.45,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1e9xqaq",
        "title": "CRBA for my son, my name is not on his birth certificate...",
        "score": 1,
        "num_comments": 6,
        "author": "Temporary_Traffic622",
        "created_utc": 1721704964.0,
        "created_readable_utc": "2024-07-23 03:22:44 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1e9xqaq/crba_for_my_son_my_name_is_not_on_his_birth/",
        "permalink": "https://reddit.com/r/immigration/comments/1e9xqaq/crba_for_my_son_my_name_is_not_on_his_birth/",
        "selftext": "Simply put I let my GF keep my name out of the birth certificate so she could freely travel with the baby. She is not a US citizen, my kid was born abroad. I didn't think about future paperwork... so I want to get him his passport through CRBA and her a K1 visa. Considering that my name is not on the Birth certificate... is the procedure as usual or how should I proceed with CRBA?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1e7qpfw",
        "title": "Ecrba",
        "score": 0,
        "num_comments": 9,
        "author": "warlockett46",
        "created_utc": 1721463162.0,
        "created_readable_utc": "2024-07-20 08:12:42 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1e7qpfw/ecrba/",
        "permalink": "https://reddit.com/r/immigration/comments/1e7qpfw/ecrba/",
        "selftext": "Father non US mother US citizen\n\nWe are currently living in another country full time where I am from (father) we tried getting our daughter a visa but were told we need to do the crba. They are telling us that she is able to get a citizenship and a passport but I am not interested because we’re I’m from that’s not allowed. Is it possible to just pass the crba and prove that the mother is a US citizen and have that on stand by and obtain our daughter a visiting visa? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1e3jwd4",
        "title": "My son's birth certificate has the wrong DOB",
        "score": 2,
        "num_comments": 14,
        "author": "FluidGarage7801",
        "created_utc": 1721010794.0,
        "created_readable_utc": "2024-07-15 02:33:14 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1e3jwd4/my_sons_birth_certificate_has_the_wrong_dob/",
        "permalink": "https://reddit.com/r/immigration/comments/1e3jwd4/my_sons_birth_certificate_has_the_wrong_dob/",
        "selftext": "I am a US citizen. My son was born in a country where the birth certificates do not indicate the time of day of birth. \n\nSuppose he was born on 7/14/2024 on 11:52 pm. The fucking hospital staff made it so that the date of birth was reported as 7/15/2024.\n\nWe tried approaching the civil register and they said they can't change it unless the hospital goes along. \n\nThe hospital isn't going to admit they made a mistake.\n\nCan we ask the US embassy to print his birth date as 7/14/2024 on CRBA and passport?\n\nI have proof of communication with the civil register that they won't change it unless the hospital agrees.\n\nI also communicated with hospital, but they say they won't change it.\n\nI also have a notarized statement from the doctor who did the delivery that the birth was at 11:52 pm on 7/14/2024.\n\nThe doctor was also kind enough to provide me with a screenshot from the portal where they report hours showing he that he actually wasn't even in the hospital the following day except for a few hours in the wee hours of the early morning.\n\nOn my wife's discharge it quite clearly says this doctor delivered the baby, but if he was absent on 7/15/2024, he couldn't have delivered the baby.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.54,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
    {
        "id": "1e1v9ec",
        "title": "Clothing to wear at us embassy",
        "score": 99,
        "num_comments": 128,
        "author": "GasFirm5218",
        "created_utc": 1720825286.0,
        "created_readable_utc": "2024-07-12 23:01:26 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1e1v9ec/clothing_to_wear_at_us_embassy/",
        "permalink": "https://reddit.com/r/immigration/comments/1e1v9ec/clothing_to_wear_at_us_embassy/",
        "selftext": "I need some advice. My partner is an American citizen and she has given birth. We are going to the embassy for the CRBA appointment.\n\nShe wants to wear a T-shirt that talks and shows people performing sex acts. It uses explicit language. She says that it is her \"God-given First Amendment right\" to wear the T-shirt. She claims that not even \"God himself can stop my son from being a citizen\"\n\nIf she wears this T-shirt will it affect our future immigration if we get married?\n\nWill they still give the CRBA? What can I do to make the consular officer understand that this is her idea, not mine so we don't have trouble in future? I love her but sometimes she is a bit different.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.79,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1e1lkra",
        "title": "CRBA help",
        "score": 4,
        "num_comments": 4,
        "author": "Educational-Image873",
        "created_utc": 1720800823.0,
        "created_readable_utc": "2024-07-12 16:13:43 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1e1lkra/crba_help/",
        "permalink": "https://reddit.com/r/immigration/comments/1e1lkra/crba_help/",
        "selftext": "I looked up the CRBA and I am very confused. I can get those documents within a day. \n\nFor the online system, it says, amongst other things, I need\n\n> e. Financials Support and/or Legal Relationship (for children born out-of-wedlock or\ncourt ordered support)\n\n> f. A scanned and notarized Form DS-5507 (for children born out-of-wedlock)\n\nThese are listed as two separate things. But the DS-5507 contains a promise to support my son and acknowledge him. So do I need one or do I need the other? \n\nAlso, on the website of the embassy and main State Department there is a difference. \n\nOn the embassy website it says \n\n> The father provides a written statement acknowledging paternity; **and** either\n\n> * The child is legitimated under local law; or\n\n> * Paternity is established by a competent court before the child attains the age of 18 years. \n\nEmphasis is mine.\n\nI don't know what legitimated means, but on the main State Department website is different. It says\n\n> While the person is under the age of 18 years:\n\n> * the person is legitimated under the law of his/her residence or domicile, **or**\n\n> * the father acknowledges paternity of the person in writing under oath, **or**\n\n> * the paternity of the person is established by adjudication of a competent court.\n\nThe use of the word \"**or**\" means I can choose from one of 3 options. So is the embassy website wrong when they use the word \"**and**\"",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.83,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   

    {
        "id": "1dxgq9e",
        "title": "Adoption of biological child",
        "score": 0,
        "num_comments": 2,
        "author": "InterestingNet8040",
        "created_utc": 1720359506.0,
        "created_readable_utc": "2024-07-07 13:38:26 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dxgq9e/adoption_of_biological_child/",
        "permalink": "https://reddit.com/r/immigration/comments/1dxgq9e/adoption_of_biological_child/",
        "selftext": "So basically, my name is not on my child's birth certificate. \n\nIn the country I live in, a child's legal parents are the parents on the birth certificate. A unmarried father can have his name added to the birth certificate if he and the unmarried mother request it. But because of some bureaucratic issues (i.e. being demanded bribes) my name wasn't added. Even if the father is added, he doesn't have full custody rights unless the mother is a criminal, has been committed to an institution, or is abusive. \n\nAlso, an illegitimate child (God I hate that word), can't inherit properly. This country's inheritance laws are weird. Adoption fixes this by making him legitimate.\n\nNow that we are married, I want to fix these things and adoption is the best way to do so. It cleans things up legally in country of origin. Adoption will go through the courts, which are less corrupt than then people who make decisions on birth certificates, so my name can be added as the legal father. \n\nMy question is, how does this affect US citizenship? Do we need to apply through USCIS adoption process forms I-600/I-800? Or can we apply for the CRBA?\n\nI have always been a US citizen. I satisfy the 5/2 physical presence requirements. Just to be on the safe side, I've signed a statement under a notary acknowledging he's my biological kid and that I agree to support him till the age of 18.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1dxanop",
        "title": "CRBA",
        "score": 1,
        "num_comments": 6,
        "author": "Final_Leg_6030",
        "created_utc": 1720336387.0,
        "created_readable_utc": "2024-07-07 07:13:07 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dxanop/crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1dxanop/crba/",
        "selftext": "Does the 5yrs physical presence to obtain CRBA begins from when you’re legally allowed to work in the States or does it start from when you’re permanent resident in the US ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1dws6zs",
        "title": "CRBA question -- one parent US citizen, one parent possible US citizen",
        "score": 4,
        "num_comments": 32,
        "author": "Current_Bobcat_6495",
        "created_utc": 1720279749.0,
        "created_readable_utc": "2024-07-06 15:29:09 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dws6zs/crba_question_one_parent_us_citizen_one_parent/",
        "permalink": "https://reddit.com/r/immigration/comments/1dws6zs/crba_question_one_parent_us_citizen_one_parent/",
        "selftext": "My FIL is a US citizen. He never married my non-US MIL.\n\nHe appeared to \"declare\" the birth of my husband, but he never explicitly promised to pay financial support. But he did send money and is involved in my husband's life. The country of my husband's birth has a provision in the law making it obligatory that parents support their children financially.\n\nMy husband was born after 1986. \n\nMy FIL lived in the USA for more than 5 years, 2 years after 14 before husband was born.\n\nNow, my child has been born here in a foreign country. \n\nI'm a US citizen born in the USA. For the online forms, it is making it a mandatory question whether my husband is a US citizen or not. \n\nWe don't wish to answer this question right now because we don't want to be wrong about husband's citizenship claim. A false claim to US citizenship is a bar to any immigration benefit. So, that could mean my husband can never live in the US. \n\nWe are a bit tight on money so we are saving up to get legal advice because although USCIS does allow INA 309 claims if the father signed the written acknowledgment of paternity in a jurisdiction where it is mandatory to support the child, this argument is very tricky legally. It requires probably a consultation with a family lawyer in hubby's country of birth and an immigration lawyer to write a legal brief as to whether my husband is a citizen or not. We are not trained ourselves to write legal briefs\n\nIs there a way to do the paper forms and not answer this question? \n\nWill the CRBA case still go through if we don't answer this question? Frankly whether my husband is a US citizen or not, is irrelevant to my child's citizenship. \n\nIf my husband isn't a US citizen, then I have enough physical presence to satisfy the 5/2 requirements.\n\nIf my husband is a US citizen, then I have certainly had a residence in the USA before.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.63,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1dv0fh4",
        "title": "My husband couldn't give me what I needed",
        "score": 0,
        "num_comments": 12,
        "author": "Connect-Reserve-5911",
        "created_utc": 1720075672.0,
        "created_readable_utc": "2024-07-04 06:47:52 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dv0fh4/my_husband_couldnt_give_me_what_i_needed/",
        "permalink": "https://reddit.com/r/immigration/comments/1dv0fh4/my_husband_couldnt_give_me_what_i_needed/",
        "selftext": "I'm a US citizen. My husband isn't.\n\nFor 2 months we haven't had sex. I told him I needed sex. I begged him. He refused. \n\nSo I had sex with a coworker to have my needs satisfied. I got pregnant.\n\nCan the CRBA have my coworker's name on it if he's the father?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.05,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
    {
        "id": "1duhdpd",
        "title": "Entering US without infant passport",
        "score": 0,
        "num_comments": 7,
        "author": "Individual-Fun2868",
        "created_utc": 1720021017.0,
        "created_readable_utc": "2024-07-03 15:36:57 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1duhdpd/entering_us_without_infant_passport/",
        "permalink": "https://reddit.com/r/immigration/comments/1duhdpd/entering_us_without_infant_passport/",
        "selftext": "Hi all!\n\nHas anyone had experience with entering the US without a US passport? My baby was born abroad and she is 2 months old. I am a US citizen and I have completed the CRBA and US passport applications for her but I have not received them back yet. I have to travel to the US in a few weeks for work and I really need her to be able to travel with me as she is exclusively breast fed. Would we be allowed entry into the US if we fly with my passport and her birth certificate? She does have a Trinidad passport as well. \n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.13,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   
    {
        "id": "1dsim0h",
        "title": "Am I eligible for CRBA?",
        "score": 0,
        "num_comments": 7,
        "author": "unseenbae",
        "created_utc": 1719802406.0,
        "created_readable_utc": "2024-07-01 02:53:26 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dsim0h/am_i_eligible_for_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1dsim0h/am_i_eligible_for_crba/",
        "selftext": "I was born in 1996(28 now) and my dad came to the US in 2002 and, he got naturalization in 2006/2007. He is a citizen now but at the time I was born, he wasn’t. Now I am trying to apply for the CRBA through my dad. Do you think it will be possible for me to get citizenship through my dad? Please share you’re experience, if you have same case. Thank you in advance.  ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
    {
        "id": "1dodhys",
        "title": "CRBA denied but K2 visa issued",
        "score": 1,
        "num_comments": 16,
        "author": "PlaneBase7316",
        "created_utc": 1719341237.0,
        "created_readable_utc": "2024-06-25 18:47:17 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dodhys/crba_denied_but_k2_visa_issued/",
        "permalink": "https://reddit.com/r/immigration/comments/1dodhys/crba_denied_but_k2_visa_issued/",
        "selftext": "This is the weirdest shit I've seen. My wife was issued a K1. But my son's CRBA was denied for the reason that I didn't live in the USA for 5 years.\n\nInstead, to make sure my son was not separated from my wife and that my wife could enter the US with him in time before K1 visa expiration, we were essentially forced to apply for the K2, unnecessarily spending more money. A CRBA is $100. A K2 visa is much more.\n\nThey even said they agreed my son was my biological son as required under INA 309 (paraphrasing from consular officer's words). But the K2 visa would be issued not because my son is my son but because he is my wife's son.\n\nList of evidence for physical presence\n\n1. K-12 school records/transcripts \n\n2. Undergraduate college transcript\n\n3. Medical school records\n\n4. Wage and income transcripts which has the same information as the W2. The years for which I ordered transcripts show me making the appropriate amounts of money for my profession (I'm a doctor). The consular officer started saying I might have been \"remotely working\" during COVID and that while my legal address on the W2 would be my US house address, I was secretly staying in a foreign country. I'M A DOCTOR. I WAS TAKING CARE OF SICK COVID PATIENTS. I WAS AT THE FUCKING HOSPITAL.\n\nMy wife doesn't come from a high fraud country.\n\nWhat are my next steps?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.56,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1dmgbqg",
        "title": "State Department denied passport",
        "score": 0,
        "num_comments": 17,
        "author": "Ill-Firefighter5913",
        "created_utc": 1719125989.0,
        "created_readable_utc": "2024-06-23 06:59:49 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dmgbqg/state_department_denied_passport/",
        "permalink": "https://reddit.com/r/immigration/comments/1dmgbqg/state_department_denied_passport/",
        "selftext": "The embassy denied my kid a passport despite approving the crba. They claim they need the permission of my girlfriend's ex-husband. They did a DNA test and found out I'm the father. That's how they approved the CRBA. The law states they need both parent's consent. 22 C.F.R. 51.28\n\n> Except as specifically provided in this section, both parents or each of the minor's legal guardians, if any, whether applying for a passport for the first time or for a renewal, must execute the application on behalf of a minor under age 16 and provide documentary evidence of parentage or legal guardianship showing the minor's name, date and place of birth, and the names of the parent or parents or legal guardian. \n\nMy girlfriend is parent number 1 and I'm parent number 2 because we had sex. The regulations don't say they need the permission of some third person. They say \"both parents.\" I'm already a parent as recognized by the fact that the CRBA contains my name. You can't have one meaning of parent and father for the CRBA and another for the passport consent.\n\nWhat sort of bullshit is this? Given that people can only have two parents, why do they need the ex-husband's permission? He's not related to the kid.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.2,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1dgqj6w",
        "title": "Strongly suspect child is American but pending 485",
        "score": 5,
        "num_comments": 30,
        "author": "unverified-email1",
        "created_utc": 1718482439.0,
        "created_readable_utc": "2024-06-15 20:13:59 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dgqj6w/strongly_suspect_child_is_american_but_pending_485/",
        "permalink": "https://reddit.com/r/immigration/comments/1dgqj6w/strongly_suspect_child_is_american_but_pending_485/",
        "selftext": "We are currently in the US. One foreign and one US parent. US parent was born in America, got married in Canada, had a kid who was born in Canada and then moved back to America. We didn’t know about CRBA until after we filed the I-485. Now that I’ve studied the law a bit better and just reading a lot of posts in immigration and USCIS, I suspect my kid is American.\n\nThe US parent cannot pass the physical presence test as they did not live in the US for 2 years after the age of 14 but both the child’s grandparents can pass this easily. I’m wondering if I should just apply for the kids passport while the 485 is pending or wait out for the decision on the 485.\n\nMaybe someone with a similar situation could answer this. \n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.73,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1dco545",
        "title": "B1/B2 visa denied because my parent is a US citizen",
        "score": 47,
        "num_comments": 48,
        "author": "Master_Ad_5776",
        "created_utc": 1718032957.0,
        "created_readable_utc": "2024-06-10 15:22:37 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dco545/b1b2_visa_denied_because_my_parent_is_a_us_citizen/",
        "permalink": "https://reddit.com/r/immigration/comments/1dco545/b1b2_visa_denied_because_my_parent_is_a_us_citizen/",
        "selftext": "So I tried to apply for a B1/B2 visa because I had visited one of the countries the US doesn't like even though I was like 7 when I went. The consulate refused because they said i need to apply for a crba first. If that is rejected then they will give me a visa.\n\nProfile:\n\n* Country of passport: Western Europe country. \n\n* Age: 15\n\n* Mom has a B1/B2 visa\n\n* Occupation: student lol\n\nNow my father was a US citizen, born in the USA.\n\nBut at the time of my birth, my father hadn't signed the papers for the embassy. I was born when my parents weren't married, so my dad needed to sign some papers so I could get US citizenship. Then my mom and his mom tried to convince him. But he still refused. Then he died. My birth certificate does list my father because he signed the papers for that. But my father didn't agree to support me. So how can I be a US citizen?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.76,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1dcc9jt",
        "title": "Does this count as \"acknowledgment of paternity under oath\"",
        "score": 2,
        "num_comments": 1,
        "author": "This-Freedom9795",
        "created_utc": 1717990859.0,
        "created_readable_utc": "2024-06-10 03:40:59 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dcc9jt/does_this_count_as_acknowledgment_of_paternity/",
        "permalink": "https://reddit.com/r/immigration/comments/1dcc9jt/does_this_count_as_acknowledgment_of_paternity/",
        "selftext": "Hi,\n\nMy partner gave birth to our son abroad and I signed the birth registration form. So I am on the birth certificate. We are not married.\n\nBefore I left, I had signed a DS-3053 with a local notary. But I forgot to sign the acknowledgment of paternity form for CRBA in front of the local notary. \n\nI am wondering if my signature on the birth registration form is a acknowledgment of paternity under oath within the meaning of INA 309.\n\nThe language at the end of the birth registration form was\n\n> \"I declare that the information entered on this form is true and correct\"\n\nSo this meant I declared that I am the father because on the birth registration form, we have written my name as the father. \n\nI should also mention that the jurisdiction in which our baby was born obligates parents to support their children financially. Also since it was an official government form, the directions made it clear that falsification of information is a crime.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1dbh3vr",
        "title": "DNA testing in CRBA cases",
        "score": 0,
        "num_comments": 5,
        "author": "Present-Ad-2852",
        "created_utc": 1717893153.0,
        "created_readable_utc": "2024-06-09 00:32:33 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dbh3vr/dna_testing_in_crba_cases/",
        "permalink": "https://reddit.com/r/immigration/comments/1dbh3vr/dna_testing_in_crba_cases/",
        "selftext": "Is there a constitutional or statutory right or right created in the regulations to DNA testing for establishing paternity in CRBA cases? \n\nSuppose the local law of a foreign country forbids paternity testing outside of judicial proceedings (e.g. France). In France, it is not just that paternity testing done outside of courts has no legal effect in France. In France, ordering DNA tests through online vendors (e.g. ancestry, 23&me) is also forbidden outside of court proceedings. Testing done abroad as well is forbidden according to French law. I'm not sure how this would apply to US embassies. https://www.service-public.fr/particuliers/vosdroits/F14042?lang=en\n\nNow for various reasons the parents involved do not wish to pursue a court proceedings in France.\n\nCan the US embassy in Paris deny a request to establish DNA, according to their procedures, legally speaking? If the us embassy doesn't allow us a DNA test according to their procedures, isn't that a violation of APA?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.29,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1dbajok",
        "title": "US Citizen Wife/US Citizen Eldest/2 Canadian Child Pending CRBA/ Myself a Canadian with Work offer moving to USA",
        "score": 0,
        "num_comments": 11,
        "author": "r0key1337",
        "created_utc": 1717874430.0,
        "created_readable_utc": "2024-06-08 19:20:30 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1dbajok/us_citizen_wifeus_citizen_eldest2_canadian_child/",
        "permalink": "https://reddit.com/r/immigration/comments/1dbajok/us_citizen_wifeus_citizen_eldest2_canadian_child/",
        "selftext": "Hello Everyone, I would like to ask for Guidance in the process of our family moving back to Missouri.\n\nMy wife is a USC along with our Eldest Daughter, the other 2 of our children are Canadian Citizens pending CRBA, Myself as a Canadian Citizen with my work having close ties to USA. I have informed my employer already that we are planning to move... My employer has the ability to transfer me under their US company umbrella.\n\nShe should have a job lined up for her already when we get back. I can work remotely at the moment under the Canadian company I work for.\n\nShould I just apply for TN visa, with us planning to drive to the border along with my offer of employment/transfer to be able to work in the USA without any hitches along our journey once we receive the kid's CRBA?\n\nGreen card down the road is the plan, but the priority is for my wife and the kids to be settled down back in Missouri.\n\nAny Suggestions?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1danx60",
        "title": "Tired of waiting for the CRBA. Can we enter through Canada with foreign passport?",
        "score": 3,
        "num_comments": 15,
        "author": "Aggressive-Plum-6595",
        "created_utc": 1717799947.0,
        "created_readable_utc": "2024-06-07 22:39:07 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1danx60/tired_of_waiting_for_the_crba_can_we_enter/",
        "permalink": "https://reddit.com/r/immigration/comments/1danx60/tired_of_waiting_for_the_crba_can_we_enter/",
        "selftext": "I'm an American citizen and the father of a young 4 month old. \n\nWe went to the US embassy about 60 days ago to get the CRBA paperwork done. \n\nWe presented plenty of evidence to support the claim of citizenship.\n\n1. Child's local birth certificate\n\n2. My K-12 AND college records (transcripts)\n\n3. My birth certificate, showing I was born in NYC\n\n4. My passport\n\n5. My foreign partner's passport\n\n6. Proof of relationship because we aren't married\n\nWe realize we aren't married, so that might attract more scrutiny in terms of the puritanical American government and we needed to prove the biological relationship. So we took more evidence despite it not being written on the website.\n\nWe provided the following evidence for proof of relationship\n\n1. My residence card from the foreign government which shows that I am being sponsored by my partner for residence \n\n2. A copy of an application for #1 that outlined the history of our relationship (where we met, who introduced us, etc)\n\n3. Text messages talking about planning for a baby and the pregnancy test, lease (translated) for the past 3 years before birth, my will giving her a large portion of my assets, previous 3 years of joint bank statements before birth\n\n4. Flight tickets and bookings for the past 3 years showing where we were.\n\nI read that embassies and consulates automatically place overseas passport applications in the expedited category which right now takes 2-3 weeks stateside. Even assuming the time for shipping is 2 weeks, we are now way over the stated times because now here it is taking two months. I emailed the embassy twice and they're only saying that it is \"under processing.\" No further updates. Their own websites say that processing time for passports is 4-6 weeks.\n\nIf they have doubt about the biological relationship, why haven't they sent a letter or notification or anything? They have my email and phone number. I don't mind paying for a DNA test.\n\nHow long is it going to take? Can we enter through Canada?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.59,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
    {
        "id": "1d967gg",
        "title": "Do I need a certificate to prove my girlfriend is not married for a CRBA?",
        "score": 4,
        "num_comments": 1,
        "author": "MasterpieceFun8103",
        "created_utc": 1717636362.0,
        "created_readable_utc": "2024-06-06 01:12:42 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1d967gg/do_i_need_a_certificate_to_prove_my_girlfriend_is/",
        "permalink": "https://reddit.com/r/immigration/comments/1d967gg/do_i_need_a_certificate_to_prove_my_girlfriend_is/",
        "selftext": "I am a US citizen and I had a child with my girlfriend. \n\nFor the CRBA it is asking us about our prior marriages. \n\nBoth of us have never been married before.\n\nHowever, me and my girlfriend are planning to get married soon where we live (outside the US).\n\nThe local marriage officials are requiring a \"single status certificate.\" I am wondering if we need such a document to prove she is single for the CRBA.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1d7r0py",
        "title": "Why isn't a SSN assigned with a CRBA?",
        "score": 0,
        "num_comments": 8,
        "author": "ContributionLatter32",
        "created_utc": 1717484512.0,
        "created_readable_utc": "2024-06-04 07:01:52 UTC",
        "url": "https://bg.usembassy.gov/u-s-citizen-services/social-security/",
        "permalink": "https://reddit.com/r/immigration/comments/1d7r0py/why_isnt_a_ssn_assigned_with_a_crba/",
        "selftext": "So I just got my daughter's CRBA application in and approved, along with her passport.  I was informed by the embassy that there is a separate process for obtaining a ssn. I honestly don't understand this. Why wouldn't one just be assigned as part of the CRBA since that establishes citizenship anyways? Anyways it's confusing the hell out of me because the way they described it made it sound like getting one is optional and can be obtained \"at my leisure\" but not having a ssn kinda seems like a big deal. Anyone have any idea why it's done this way and just how big of a deal is it to just wait on obtaining it? For reference my daughter is 4 months and I'm bringing her into the states in one month to meet family on my side. I am so tired of all the paperwork I'm just planning on applying for her ssn over there but I'm also mildly infuriated that they separated the ssn into a different process...",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1d6iuu6",
        "title": "Racist Florida DMV doesn't accept my passport card",
        "score": 0,
        "num_comments": 13,
        "author": "Familiar_Award8011",
        "created_utc": 1717350404.0,
        "created_readable_utc": "2024-06-02 17:46:44 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1d6iuu6/racist_florida_dmv_doesnt_accept_my_passport_card/",
        "permalink": "https://reddit.com/r/immigration/comments/1d6iuu6/racist_florida_dmv_doesnt_accept_my_passport_card/",
        "selftext": "So Florida turned out to be well... Florida.\n\nBackstory: I am a dual American-Canadian citizen. I was born in Canada to and one of my parents is an American. I moved down from GTA to Miami for a new job. I crossed the border by land and then boarded a flight. \n\nI looked online for the requirements to get a driver's license for a US citizen in the state of Florida.\n\nThey are here: https://www.flhsmv.gov/driver-licenses-id-cards/what-to-bring/u-s-citizen/\n\nThey didn't accept my passport card, despite it being a valid document for me to get a driver's license, as seen in the link above.\n\nAlso, the DMV employee was quite rude and possibly racist. She said, \"We don't get people like you around here.\" Well, I am not white and looking at the number of Canadians who spend time in Florida, I'd venture to guess and say that the DMV employee didn't mean Canadians. I am Black and Asian. \n\nSo I was turned away until I have the \"proper\" documents. \n\nThing is that I don't have a passport book, and don't need to apply for one. I rarely travel outside Canada and America. Also, my CRBA is with my mom who I gave it to for safekeeping. I am not sure why my passport card can't work.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.3,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1d44res",
        "title": "CRBA taking too long",
        "score": 0,
        "num_comments": 7,
        "author": "NeatConference5645",
        "created_utc": 1717077685.0,
        "created_readable_utc": "2024-05-30 14:01:25 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1d44res/crba_taking_too_long/",
        "permalink": "https://reddit.com/r/immigration/comments/1d44res/crba_taking_too_long/",
        "selftext": "I applied for a CRBA and passport about two months ago for my kid. Still it hasn't come. We need the passport because we live in a country with no birthright citizenship and we need to apply for a residence permit for our kid, something we can't do without a passport. I've contacted the embassy to see if they can issue a passport, but they haven't responded to my emails. I should add that my wife comes from a country where women can't pass down citizenship, so my baby is only American and only eligible for an American passport. This is not the same country as my wife's country. I'm temporarily out of the US due to work and my wife is on a dependent visa. I should also add I'm a natural born US citizen born in the USA and lived there my entire life with good evidence.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1d3muu3",
        "title": "Question about CRBA",
        "score": 1,
        "num_comments": 8,
        "author": "ContributionLatter32",
        "created_utc": 1717017103.0,
        "created_readable_utc": "2024-05-29 21:11:43 UTC",
        "url": "https://mytravel.state.gov/s/",
        "permalink": "https://reddit.com/r/immigration/comments/1d3muu3/question_about_crba/",
        "selftext": "I'm unsure if this technically falls under \"immigration\" but I have a question that no amount of googling and FAQ has managed to answer. The section where the U.S. parent has to provide proof of physical presence in the U.S. is very unhelpful as to what exactly is expected. I know that the minimum requirements are 5 years spent in the U.S. with at least 2 of them being post 14 years old. I also know a list of non exaughstive acceptable documents for proof (bank statements, employment records, school transcripts, etc). The problem is it is never specified how much documentation is required. American Citizenship Services hasn't been of much help in this department. I'm choosing bank statements as they are easiest to get my hands on but it's difficult to tell if they want documentation proving all dates claimed to have been in the U.S., proving just 5 years, or if a handful of documents spaced out over time is enough. Bank statements are month by month, to show 5 years is around 100 pages of statements- a bit excessive. Can I just bring a single statement from each year? That wouldn't prove I was in the states for all of those years. What about all the time I claimed when I was a minor in the states? I don't really have documentation to show this. It's all very infuriating because the exact requirements for proof are pretty vague. Has anyone gone through the CRBA and if so any insights on what would be acceptable and what would he considered insufficient evidence in this case? As it stands I plan on dumping 100 pages or so of bank statements but I'd rather not if I don't have to. I meet the physical presence criteria by a mile and then some (31 years old and have spend maybe 4 years of that outside the states). ",
        "is_self": false,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1d22cnj",
        "title": "Possible to do a FOIA for my birth certificate for CRBA?",
        "score": 1,
        "num_comments": 1,
        "author": "Awkward_Fail4766",
        "created_utc": 1716844053.0,
        "created_readable_utc": "2024-05-27 21:07:33 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1d22cnj/possible_to_do_a_foia_for_my_birth_certificate/",
        "permalink": "https://reddit.com/r/immigration/comments/1d22cnj/possible_to_do_a_foia_for_my_birth_certificate/",
        "selftext": "I need a copy of my birth certificate. However, the country I was born in no longer keeps a copy. They discard the birth certificates after some years of records relating to foreigners. Since I was born to two US citizens, I of course have no other birth certificate. \n\nI was wondering if I can get a copy of the birth certificate that the State Department might keep on file?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1d18h13",
        "title": "I had a kid with a stateless person",
        "score": 0,
        "num_comments": 5,
        "author": "Far-Airline-2020",
        "created_utc": 1716750059.0,
        "created_readable_utc": "2024-05-26 19:00:59 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1d18h13/i_had_a_kid_with_a_stateless_person/",
        "permalink": "https://reddit.com/r/immigration/comments/1d18h13/i_had_a_kid_with_a_stateless_person/",
        "selftext": "I am a US citizen and I had a kid with a stateless person. This person has also been granted asylum in the country I live in and has a refugee passport. \n\nShould we use this passport or should we use a driver's license when getting the CRBA?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1cxoz2l",
        "title": "Cost for a CRBA visa ",
        "score": 0,
        "num_comments": 17,
        "author": "Elnino_300",
        "created_utc": 1716342917.0,
        "created_readable_utc": "2024-05-22 01:55:17 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cxoz2l/cost_for_a_crba_visa/",
        "permalink": "https://reddit.com/r/immigration/comments/1cxoz2l/cost_for_a_crba_visa/",
        "selftext": "I have a 9 month child going for the visa or citizenship I saw last time it was around 1,300 is that accurate just checking.! Cause now that I look it up and only find the fee to apply for the visa but not the cost of the actual visa.! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.17,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cs3gcc",
        "title": "How can I find out what my SSN is if I was born abroad to a US citizen?",
        "score": 0,
        "num_comments": 5,
        "author": "LivingPangolin6534",
        "created_utc": 1715721414.0,
        "created_readable_utc": "2024-05-14 21:16:54 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cs3gcc/how_can_i_find_out_what_my_ssn_is_if_i_was_born/",
        "permalink": "https://reddit.com/r/immigration/comments/1cs3gcc/how_can_i_find_out_what_my_ssn_is_if_i_was_born/",
        "selftext": "I'm a US citizen. My mom was a US citizen who lived in America for her entire life before moving to Canada to be with my dad. I was born in Canada. My mom died a few years ago.\n\nMy dad is 100% sure I got a SSN. \n\nBut the card got lost because we've moved around a few times. How do we find out what my number is?\n\nI also have a CRBA. \n\nI'm thinking a local field office near the border might be able to help better than a FBU. Problem is my US passport has long expired. Can I enter with my Canadian Driver's license and my expired US passport and CRBA.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cp88i4",
        "title": "Why are there different document requirements for CRBA in different countries?",
        "score": 0,
        "num_comments": 14,
        "author": "TraditionalYellow323",
        "created_utc": 1715398709.0,
        "created_readable_utc": "2024-05-11 03:38:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cp88i4/why_are_there_different_document_requirements_for/",
        "permalink": "https://reddit.com/r/immigration/comments/1cp88i4/why_are_there_different_document_requirements_for/",
        "selftext": "I am currently reading the website of the US Consulate. They are requesting the mother's prenatal records. But the mother is not the US citizen. \n\nMy friend did his CRBA in a different country and they never requested the prenatal records of the mother. My friend is a US citizen and his wife was  not a US citizen.\n\nIf anything I expect them to do a DNA test on the US citizen to determine if the child is actually biologically related to the US citizen.\n\nWhy the fuck does my wife need to reveal her personal medical information?\n\nThey can swab my cheek and the baby's cheek.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1cn61no",
        "title": "Meet the 5/2 requirement but not the 1 year continuous requirement",
        "score": 1,
        "num_comments": 7,
        "author": "Any-Silver-4766",
        "created_utc": 1715178841.0,
        "created_readable_utc": "2024-05-08 14:34:01 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cn61no/meet_the_52_requirement_but_not_the_1_year/",
        "permalink": "https://reddit.com/r/immigration/comments/1cn61no/meet_the_52_requirement_but_not_the_1_year/",
        "selftext": "Hi,\n\nI'm an American woman who lived in the USA until 25. At age 26, I moved abroad using my other citizenship. I never thought about getting US citizenship for my kid, but now that I'm considering everything it seems that not to do so would not be good. \n\nHowever there seems to be one obstacle. \n\nMy son was born in 2015 and I was not married to anyone.\n\nI don't meet the 1 year continuous physical presence requirement, but I do meet the 5/2 requirements. I was out of the country every summer while growing up and in college. \n\nI don't intend to live in the USA right now. \n\nWhat are the best options for me? Is my kid directly eligible for a crba in light of the Supreme Court ruling in 2017?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.57,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    
    {
        "id": "1ciwzrm",
        "title": "CRBA",
        "score": 3,
        "num_comments": 2,
        "author": "Elnino_300",
        "created_utc": 1714701069.0,
        "created_readable_utc": "2024-05-03 01:51:09 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ciwzrm/crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1ciwzrm/crba/",
        "selftext": "I’m a us citizen put a application in for my son that’s about 9 months now I’m seeing that the have the 5 year rule can some one explain that to me my son was born 2023 in July but I’m a natural borned us citizens I just went to Mexico about 2020 met my wife in Mexico couple months after so I been in n out the country 4 times since 2020 what are the chances I get rejected to.! My question is did I break the 5 year rule !? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1chdlqj",
        "title": "Misrepresenting citizenship theoretical question. ",
        "score": 1,
        "num_comments": 2,
        "author": "Lophius_Americanus",
        "created_utc": 1714538860.0,
        "created_readable_utc": "2024-05-01 04:47:40 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1chdlqj/misrepresenting_citizenship_theoretical_question/",
        "permalink": "https://reddit.com/r/immigration/comments/1chdlqj/misrepresenting_citizenship_theoretical_question/",
        "selftext": "I follow the sub as I’m generally interested in the subject and have lots of experience with the immigration process (CRBA myself, previous permanent resident of a few countries, family members with green cards, personal, friends and work sponsorships experience, etc. One thing I’ve learned is that misrepresenting being a citizen is one of the fastest ways to be denied naturalization. \n\nSo, theoretical question, if someone from American Samoa who was not a citizen moved to the US and marked the US citizen box on an official form  would they be at risk of being denied US citizenship despite the fact that the national/citizen distinction is not something most people understand and they were already a U.S. passport holder and there was likely no “US National” box to check? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cf6jpq",
        "title": "Proving citizenship for CRBA",
        "score": 4,
        "num_comments": 12,
        "author": "tranquil-sojourner",
        "created_utc": 1714311296.0,
        "created_readable_utc": "2024-04-28 13:34:56 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cf6jpq/proving_citizenship_for_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1cf6jpq/proving_citizenship_for_crba/",
        "selftext": "\n\nI have read CRBA application instructions carefully. Especially the section about providing proof of US residence prior to the child's birth. My questions are:\n\n1) How many years of income tax returns do you              require? \n\n2) How many years of bank statements do you need? \n\n3) How many years of Social Security Benefit            \n     statements do you require \n\n4) Is it possible to provide income tax transcripts in          lieu of the Forms 1040 and W-2's\n\n5) While not mentioned anywhere on the CRBA                   application. Will my wife need to provide any      \n      medical documentation of her pregnancy? \n\nYour kind reply to my questions will be greatly appreciated. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1ceqcdk",
        "title": "Why is my kid's passport taking so long?",
        "score": 0,
        "num_comments": 19,
        "author": "Technical_Basil824",
        "created_utc": 1714255596.0,
        "created_readable_utc": "2024-04-27 22:06:36 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ceqcdk/why_is_my_kids_passport_taking_so_long/",
        "permalink": "https://reddit.com/r/immigration/comments/1ceqcdk/why_is_my_kids_passport_taking_so_long/",
        "selftext": "So we want to make a quick trip to the US. \n\nWe applied for a passport and a CRBA. It has been 4 weeks.\n\nCan my daughter just come on her other passport with birth certificate and foreign parent's passport?\n\nI read this is allowed here: https://help.cbp.gov/s/article/Article1703?language=en_US\n\nEDIT: I should also add foreign parent is green card holder with reentry permit.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.23,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cdbojl",
        "title": "Birthright citizenship, or… (same-sex parents)",
        "score": 1,
        "num_comments": 4,
        "author": "irishtwinsons",
        "created_utc": 1714103444.0,
        "created_readable_utc": "2024-04-26 03:50:44 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cdbojl/birthright_citizenship_or_samesex_parents/",
        "permalink": "https://reddit.com/r/immigration/comments/1cdbojl/birthright_citizenship_or_samesex_parents/",
        "selftext": "This is a hypothetical question, but I’m curious if there have been people in this exact situation to see what the precedent has been:\n\nInternational couple, US citizen and (Country X) citizen. They are a same-sex couple that married in X in 2011. (X recognized their marriage and it was a legit marriage). Then they had a child (via bank donor), the baby was was born in X in 2012, and genetic parent is the X citizen.  They couldn’t file for a CRBA for the child because their marriage wasn’t recognized by the US at the time, so the child remained a citizen of X only. \n\nIn 2014, they moved from X to the US as a family.  X citizen parent and child obviously had to go through the legal process of getting visas, but they did everything legally, had a valid visa status. \n\n2015, the marriage is finally recognized by the US, so they get their marriage recognized officially; the parent from country X goes through green card process for self and child. \n\nQuestion: since the current law now recognizes the passing of US citizenship from a non-bio parent to child - as long as parents were married at time of birth - does the child automatically get birthright citizenship? \n\nThanks for any insight! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cd3pn9",
        "title": "Applying for green card after serving 5 year deportation",
        "score": 18,
        "num_comments": 37,
        "author": "PapaSato",
        "created_utc": 1714081381.0,
        "created_readable_utc": "2024-04-25 21:43:01 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cd3pn9/applying_for_green_card_after_serving_5_year/",
        "permalink": "https://reddit.com/r/immigration/comments/1cd3pn9/applying_for_green_card_after_serving_5_year/",
        "selftext": "I (27M US citizen) met my wife (27F Mexican Citizen) in Texas while she was there ilegally. She entered legally with a tourist visa and a 6 month permit and she had been there 3 years by the time we met in 2017. After dating and living together over a year, we got engaged. After meeting with an immigration lawyer and getting bad advice, we got on a plane and traveled out of the US to her home country of Mexico. We planned to travel together to the US/Mexico border crossing at Laredo Tx with a K1 visa in order to enter legally, get married and live the rest of our life together. However, due to a break in at our apartment back home, I had to fly back to Texas while my fiancé drove up with a family member. When she arrived at the border, my fiancé was asked about the flight she took out of the US two weeks prior and was of course given a 5 year ban from entering the US. \n\n5 years later, we've been married about 5 years, have a 3 year old son born in Mexico, and another child on the way. My only real question is, after serving her deportation and being married the whole time to an american citizen, can she apply for her Green Card without the help of a lawyer? Can I fill out the I-130 form and the 601 waiver and handle all of that on my own and save the almost $10k every lawyer wants to charge to to just file the paperwork. I have spoken to multiple lawyers and they all pretty much admit that they cannot do anything to expedite the process and wont be present to represent her in any interview. Why should we pay the lawyer instead of doing it all myself like when I filled out the eCRBA for my son?\n\n&#x200B;\n\nTL;DR: Can I apply for my wife's Green Card without the help of a lawyer after she has served a 5 year deportation? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.78,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cct74q",
        "title": "Steps to moving to the US",
        "score": 0,
        "num_comments": 8,
        "author": "Dry-Elevator7568",
        "created_utc": 1714054852.0,
        "created_readable_utc": "2024-04-25 14:20:52 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cct74q/steps_to_moving_to_the_us/",
        "permalink": "https://reddit.com/r/immigration/comments/1cct74q/steps_to_moving_to_the_us/",
        "selftext": "I am a US citizen through my mother with a CRBA and a passport and a SSN.\n\nMy partner is a US citizen through birth in the US. \n\nWe have a son born here abroad.\n\nWe are wondering what are the appropriate steps to take to get my son US citizenship.\n\nI have looked online and it seems that for a child born to two US citizens, as long as one has \"resided\" in the US, my son can obtain US citizenship. \n\nHowever, I am not sure what counts as \"resides\" in the US.\n\nMy partner lived there only for a year. \n\nOther than doing my Master's at a US university, I did not live in the US.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cbz6yd",
        "title": "Sponsoring someone born in India using a pre-1969 birth certificate",
        "score": 0,
        "num_comments": 3,
        "author": "Upbeat_Delay_4171",
        "created_utc": 1713967853.0,
        "created_readable_utc": "2024-04-24 14:10:53 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cbz6yd/sponsoring_someone_born_in_india_using_a_pre1969/",
        "permalink": "https://reddit.com/r/immigration/comments/1cbz6yd/sponsoring_someone_born_in_india_using_a_pre1969/",
        "selftext": "Hi,\n\nI'm a US citizen looking to sponsor my dad. We have most of the documents. However, I was reading and online it says that for Indians, birth certificates are generally considered unavailable for people born before 1970. But my dad has a birth certificate issued by a local authority in India from before 1970. It is one of India's larger cities. However, my dad has none of the other documentation for India because my father, though born in India, is only half Indian. He has one parent from one country and another parent from India. He grew up in his non-Indian parent's country. I'm trying to see if I should submit all of the following or just the birth certificate.\n\n1. Submit documentation from the hospital where he was born\n\n2. Submit this pre-1970 birth certificate.\n\n3. Submit a consular birth registration (similar to a CRBA) from my dad's other country\n\n4. Get a newly issued version of the same birth certificate \n\n5. Affidavit from my aunt who is about 4 years older than my dad on my dad's birth \n\nWhich one is the best idea? Or should I submit all of them?\n\nThank you",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.2,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1cakt3c",
        "title": "Is a us citizen born abroad to a us citizen father eligible for SSA survivor benefits if residing outside the USA?",
        "score": 3,
        "num_comments": 2,
        "author": "No_Match_6228",
        "created_utc": 1713816481.0,
        "created_readable_utc": "2024-04-22 20:08:01 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1cakt3c/is_a_us_citizen_born_abroad_to_a_us_citizen/",
        "permalink": "https://reddit.com/r/immigration/comments/1cakt3c/is_a_us_citizen_born_abroad_to_a_us_citizen/",
        "selftext": "I'm a foreign citizen. My deceased partner and I had a son. He was only ever a us citizen. And our son got US ctizenship and CRBA. Is my son eligible for SSA survivor benefits despite living abroad? My partner worked for 15 years in the US before he passed. My son is still a minor. I have both of their social security numbers.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1c7ydey",
        "title": "US citizenship based on father's acknowledgment but father being uncooperative",
        "score": 2,
        "num_comments": 4,
        "author": "Ok_Standard4364",
        "created_utc": 1713537170.0,
        "created_readable_utc": "2024-04-19 14:32:50 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1c7ydey/us_citizenship_based_on_fathers_acknowledgment/",
        "permalink": "https://reddit.com/r/immigration/comments/1c7ydey/us_citizenship_based_on_fathers_acknowledgment/",
        "selftext": "I am presently in the US on a work visa. I would like to bring my son over here. My son's father, my ex-partner, is an American citizen and my ex is being absolutely uncooperative with my son. \n\nMy ex-partner was a US citizen by birth. Our son was born when we weren't married. He was a US citizen when our son was born. \n\nWhen he was born, he signed some document when registering my son's birth. Then because of whatever he signed, there is a \"certificate of recognition\" on my son's foreign birth certificate. But it can also be translated as \"certificate of acknowledgment\" in my opinion (and the opinion of government websites that present information in English in my son's country of birth). In any event, it signifies that he recognized my son as his son and he did so by signing a document to that effect. This was documented in the certificate. But the problem is that the certificate doesn't carry his signature. It just states that he recognized my son as his son. But obviously he signed that document. I signed it as well. But I don't have a copy and my government doesn't retain a copy. But the certificate means that he did sign the recognition act. \n\nIt is worth mentioning that he was found to be the father based on this and he has been ordered to pay child support by a court in my country.\n\nMy ex has definitely lived in the US for 5 years, 2 after age of 14. Problem is I cannot gather evidence because my ex is being very uncooperative. He won't let me see his transcripts or employment records. He will almost certainly never agree to DNA testing, if needed. So far, I have his birth certificate copy (not official) because he had submitted to register himself with my government. He hasn't paid me any money to support our child.\n\nI have tried applying for a US visa (H4) for my son but they reject that saying the appropriate thing to do is to apply for a US passport. However, I do not have the evidence for my ex partner's physical presence. Further, he is unwilling to sign the voluntary acknowledgment on the CRBA form. \n\nIf I applied for a CRBA and got rejected, will they deny the H4 again if my son otherwise meets the conditions? \n\nI have tried contacting his family to see if they will help. The only person willing to help is his sister. She is willing to sign an affidavit saying that he attended high school at such and such time and that he attended college at such and such dates. But other than that, the only other proof I have are yearbooks.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1c6lwfn",
        "title": "CRBA - Consular Report of Birth Abroad",
        "score": 1,
        "num_comments": 0,
        "author": "pitrb",
        "created_utc": 1713389637.0,
        "created_readable_utc": "2024-04-17 21:33:57 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1c6lwfn/crba_consular_report_of_birth_abroad/",
        "permalink": "https://reddit.com/r/immigration/comments/1c6lwfn/crba_consular_report_of_birth_abroad/",
        "selftext": "Hi, I'm the US Citizen and my wife is Canadian and we just had our first child on the 12th. I'm in process of applying for CRBA for my son but apparently it takes 4-6 weeks for the birth certificate to come in Canada and we are trying to plan to take a trip across the land border from Vancouver to Seattle in a week or so so that my parents can help us with the baby for a few weeks (my parents are retired and hers in Canada are still working). So my question is, is it possible for us to be approved with just a doctor's note? I did receive a note from the doctor stating my name, baby name, wifes name, place and time of birth with his signature. Does this count as a doctors affidavit that can be accepted or are we stuck with just waiting for the birth certificate to come?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1c6bpip",
        "title": "CRBA QUESTION",
        "score": 0,
        "num_comments": 0,
        "author": "JohnykinSephie",
        "created_utc": 1713365103.0,
        "created_readable_utc": "2024-04-17 14:45:03 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1c6bpip/crba_question/",
        "permalink": "https://reddit.com/r/immigration/comments/1c6bpip/crba_question/",
        "selftext": "When are CRBA applications approved? Is it on the day after the interview? Or when you submit the application that they either deny you because of lack of qualification? Also is it true that when they give you get an interview date it means your child is already eligible and you just need to appear at the interview to submit further documentation etc? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1c50v1s",
        "title": "What visa do I need for my son?",
        "score": 0,
        "num_comments": 8,
        "author": "Puzzleheaded-Cook157",
        "created_utc": 1713223263.0,
        "created_readable_utc": "2024-04-15 23:21:03 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1c50v1s/what_visa_do_i_need_for_my_son/",
        "permalink": "https://reddit.com/r/immigration/comments/1c50v1s/what_visa_do_i_need_for_my_son/",
        "selftext": "Hi, I'd like to bring my son and girlfriend to live with me. What visa do I need? I'm a us citizen. I read about something called a crba visa but I'm very confused on what evidence I need. Different us embassies seem to have slightly different requirements.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1c4vxpg",
        "title": "Who is the mother? Who is the father?",
        "score": 39,
        "num_comments": 31,
        "author": "Opposite-Courage-694",
        "created_utc": 1713211283.0,
        "created_readable_utc": "2024-04-15 20:01:23 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1c4vxpg/who_is_the_mother_who_is_the_father/",
        "permalink": "https://reddit.com/r/immigration/comments/1c4vxpg/who_is_the_mother_who_is_the_father/",
        "selftext": "My husband is a us citizen who had sex with another woman who is a us citizen who who lives abroad. The woman he had sex with is also married to a us citizen. I'm a us citizen myself. Which are the names that will go on the crba? My name won't be on the birth certificate because I'm not the birth mother. But will my husband be recognized as the father or will it be the other woman's husband? This is more out of curiosity as you can imagine I will be divorcing my husband soon because of his inability to control his dick.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.85,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
 
    {
        "id": "1c22e1g",
        "title": "CRBA QUESTION",
        "score": 2,
        "num_comments": 1,
        "author": "JohnykinSephie",
        "created_utc": 1712904108.0,
        "created_readable_utc": "2024-04-12 06:41:48 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1c22e1g/crba_question/",
        "permalink": "https://reddit.com/r/immigration/comments/1c22e1g/crba_question/",
        "selftext": "Can anyone help me with a CRBA Inquiry, One of the CRBA requirement for a child to be eligible is for US Citizen Parent to have had spent 5 Years in the USA prior to the childs birth, is it 5 Years after becoming a US Citizen? Or can the Years spent in the USA as a Permanent Resident/Green Card holder count in that required 5 Years for CRBA Eligibility? Thank You all kindly for the answers.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1c1sq40",
        "title": "CRBA in Birth Country vs. Elsewhere",
        "score": 1,
        "num_comments": 6,
        "author": "Historical_Arugula",
        "created_utc": 1712875284.0,
        "created_readable_utc": "2024-04-11 22:41:24 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1c1sq40/crba_in_birth_country_vs_elsewhere/",
        "permalink": "https://reddit.com/r/immigration/comments/1c1sq40/crba_in_birth_country_vs_elsewhere/",
        "selftext": "Hey folks,\n\nTrying to find a clear answer for this and although I thought I had before, I'm struggling to find the source. Basically, wanting to know if it's possible (and if anyone has successfully) applied for their kiddo's CRBA in another country that is not the USA, but also not the country the child was born in? It's been such an absurd hassle trying to get the CRBA done where we are currently, and due to work we are leaving soon, so while she has her European passport, I want to try to get her American one done ASAP...is doing it in the next country possible? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1c06qno",
        "title": "Dumbass friend files an i-130 for his son",
        "score": 2,
        "num_comments": 8,
        "author": "That_Employment_4904",
        "created_utc": 1712705341.0,
        "created_readable_utc": "2024-04-09 23:29:01 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1c06qno/dumbass_friend_files_an_i130_for_his_son/",
        "permalink": "https://reddit.com/r/immigration/comments/1c06qno/dumbass_friend_files_an_i130_for_his_son/",
        "selftext": "So my friend had his Canadian son and girlfriend fly here and then he filed an i-130 for the son and then girlfriend now wife. They had wanted to live in Australia but girlfriend became pregnant a second time. I was able to save him before he filed the i-485.\n\nBut we're looking and the son can be a citizen right?\n\nFriend lived in USA for his entire life. The state department website says little Johnny boy here can be a citizen if my friend swears under oath he is the father and agrees to support Johnny boy. So if I'm seeing this correctly, all he has to do is type on a word document and print the following and then notarize it. When he goes to the rotary he swears under oath. Then little Johnny boy became an American citizen. Is there a special government form for this? A crba seems like the right thing but they're not in Canada anymore. Can't seem to find any other forms.\n\n\"Little Johnny is the name of my biological son. I agree to support financially  my biological son, little Johnny, till he is 18.\"",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1byykh4",
        "title": "How do I send legal documents overseas?",
        "score": 1,
        "num_comments": 1,
        "author": "Whole_Biscotti3870",
        "created_utc": 1712584737.0,
        "created_readable_utc": "2024-04-08 13:58:57 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1byykh4/how_do_i_send_legal_documents_overseas/",
        "permalink": "https://reddit.com/r/immigration/comments/1byykh4/how_do_i_send_legal_documents_overseas/",
        "selftext": "I need to send original documents for a crba overseas.\n\nHow do I do this? \n\nWhat do I put for the customs?\n\nAlso, I signed and got a notarized ds-2029. My partner overseas has filled out the ecrba. Which is better?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
  
    {
        "id": "1bv5oxu",
        "title": "How long does CRBA take to process ?",
        "score": 0,
        "num_comments": 2,
        "author": "Shot_Mathematician44",
        "created_utc": 1712181640.0,
        "created_readable_utc": "2024-04-03 22:00:40 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bv5oxu/how_long_does_crba_take_to_process/",
        "permalink": "https://reddit.com/r/immigration/comments/1bv5oxu/how_long_does_crba_take_to_process/",
        "selftext": " Hello my wife is due on June, we dont' have insurance so we are looking at Mexico as an option to give birth, can anyone tell me how long it take to process the Consular Report of Birth Abroad Consular Report of Birth Abroad (CRBA) .   \n\n\nWe only plan to be in Mexico for a few days. We are self employed so we dont't qualify for any assistance.   \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1buv6ct",
        "title": "Why is the crba taking so long?",
        "score": 1,
        "num_comments": 1,
        "author": "Strange-Bit-5989",
        "created_utc": 1712157380.0,
        "created_readable_utc": "2024-04-03 15:16:20 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1buv6ct/why_is_the_crba_taking_so_long/",
        "permalink": "https://reddit.com/r/immigration/comments/1buv6ct/why_is_the_crba_taking_so_long/",
        "selftext": "We gave our crba and passport interview 1 month ago. According to the state website, passport processing times are 2-3 weeks expedited and 6-8 weeks regular. Is there any way we can pay the $60 extra fee to expedite? I need to visit America and my wife wants to come. So little one will also have to as well. We're thinking of just going to Canada and crossing the border with my documents. We have our kid's other passport and it is eligible for Canadian eta. Why the fuck is it taking the us government so long when in my wife's country it took us 10 days to get a passport for our kid?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1btc736",
        "title": "Safest way to send crba application and documents",
        "score": 1,
        "num_comments": 0,
        "author": "Embarrassed-Syrup610",
        "created_utc": 1711997784.0,
        "created_readable_utc": "2024-04-01 18:56:24 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1btc736/safest_way_to_send_crba_application_and_documents/",
        "permalink": "https://reddit.com/r/immigration/comments/1btc736/safest_way_to_send_crba_application_and_documents/",
        "selftext": "I'm unable to attend the crba interview and I'm the American parent. What is the safest way to send the original documents? UPS, FedEx, or DHL. Also, what sort of questions will be asked? I'm the American citizen and my spouse also has an interview at the embassy for her green card. Is it possible to request same day for the appointment of the crba so she doesn't have to go twice to the consulate.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1bpoeay",
        "title": "What documents needed for CRBA in Thailand? ",
        "score": 0,
        "num_comments": 6,
        "author": "Physical-Victory-763",
        "created_utc": 1711605909.0,
        "created_readable_utc": "2024-03-28 06:05:09 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bpoeay/what_documents_needed_for_crba_in_thailand/",
        "permalink": "https://reddit.com/r/immigration/comments/1bpoeay/what_documents_needed_for_crba_in_thailand/",
        "selftext": "My fiance and I just had a baby 1 week ago.  I want to get him his US passport.  I know I have to apply for the CRBA online. \n\n1. What documents will I need? I see many sources saying different things.\n\n2. It says I need prenatal records. Are receipts sufficient and do they need to be translated to English? \n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1blxdaa",
        "title": "Problem with my last name/suffix",
        "score": 1,
        "num_comments": 0,
        "author": "IceColdAkiron",
        "created_utc": 1711214066.0,
        "created_readable_utc": "2024-03-23 17:14:26 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1blxdaa/problem_with_my_last_namesuffix/",
        "permalink": "https://reddit.com/r/immigration/comments/1blxdaa/problem_with_my_last_namesuffix/",
        "selftext": "I'm 18 years old, born abroad to a US father, parent never filed a CRBA for me. I'm applying for a DS-11 (first passport,) as I fit all the criteria, accompanied by my father. Yes, my parents were in wedlock when they got married and I do have all the required documents for it, original and translated. My first name, father's name, grandfather's name and last name (technically) is correct. My last name is Hagood even though it's sometimes recognized as Jumbor by local authorities. The only problem is that my father has a suffix (Jr.) of which, is misspelled for me, so it is Jumbor. It was misspelled by the Egyptian government, and due to strict laws and financial problems, my mother was unable to fix it, so I grew up with it. Hell, even my father's suffix is misspelled on my birth certificate (Jumbor,) but on the marriage certificate it is documented with 'Hagood' being the last name, without the suffix.\n\nI'm not sure if it's a big deal, if I should add a cover letter (if I can?) or a statement, or if I should just communicate it to the embassy when I apply.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1bj4t54",
        "title": "Dual Citizenship, baby entered US with foreign passport before CRBA was issued ",
        "score": 3,
        "num_comments": 5,
        "author": "irishtwinsons",
        "created_utc": 1710907835.0,
        "created_readable_utc": "2024-03-20 04:10:35 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bj4t54/dual_citizenship_baby_entered_us_with_foreign/",
        "permalink": "https://reddit.com/r/immigration/comments/1bj4t54/dual_citizenship_baby_entered_us_with_foreign/",
        "selftext": "Ok, so this is a bit of a unique situation, because my son was born in the foreign country where I live, via donor and isn’t genetically related to me, and the country where I live doesn’t recognize my marriage. However, turns out I was able to pass my US citizenship on to him in the end, so that leads me to this question:\n\nI entered the U.S. last year with my son (he was two months old) and he had a foreign passport and an ESTA. My partner (wife as recognized in US) who gave birth to him also accompanied me and she came in with the same situation, foreign passport and ETSA for herself. At the time I remember wondering if my son would actually qualify to be a U.S. Citizen, but hadn’t completely thought it through.  I guess I had doubts because the country I live in doesn’t recognize him as my son; they view my partner as a single parent. My partner is a nonresident alien to the US. \n\nAnyhow, since then, and after checking with the US embassy, etc. that it was OK even though I’m not a bio parent, I realized I could get a CRBA for my son and an American Passport. I have done so and he currently holds a US Passport now. \n\nI know that US Citizens by birth are required to use a US Passport when entering the US, and I plan to do it from here on out. We actually have plans to visit the US soon.  \n\nIs there going to be an issue that he entered with an ESTA last time? The ESTA is actually still valid currently. \n\nI also believe that the law that allows me to transfer citizenship to my son (in the case of not being the bio parent) - apparently this law is also fairly new and people weren’t able to do it in the past. It honestly wasn’t something I expected at first (sadly, I’m quite used to the lack of recognition in my current country of residence. I also have a son who I gave birth to myself and he was not given citizenship of the country where he was born…so I guess I was a little pessimistic about it at first). \n\nIf any immigration officer asks me about it going through, I plan to simply answer honestly. \n\nIf anyone has any insight on this I’d appreciate info or advice.  \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.71,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1bi1lys",
        "title": "Can my girlfriend get a CRBA on her own?",
        "score": 0,
        "num_comments": 4,
        "author": "Odd_Passenger7159",
        "created_utc": 1710795192.0,
        "created_readable_utc": "2024-03-18 20:53:12 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bi1lys/can_my_girlfriend_get_a_crba_on_her_own/",
        "permalink": "https://reddit.com/r/immigration/comments/1bi1lys/can_my_girlfriend_get_a_crba_on_her_own/",
        "selftext": "I can't attend the CRBA interview. And I don't want to spend the money to send over the notarized DS-5507. I am wondering if a local acknowledgment of paternity would suffice? Local laws provides that a parent has to support a child financially. All the other documents such as transcripts are digital. My birth certificate is with her. \n\nThen can my girlfriend fly to Canada with the other passport and enter the US with our kid using the CRBA?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1bexebn",
        "title": "Crba physical presence",
        "score": 0,
        "num_comments": 3,
        "author": "Friendly_Guitar_9089",
        "created_utc": 1710453719.0,
        "created_readable_utc": "2024-03-14 22:01:59 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bexebn/crba_physical_presence/",
        "permalink": "https://reddit.com/r/immigration/comments/1bexebn/crba_physical_presence/",
        "selftext": "As a kid my dad was obsessed with san Francisco. We lived in southern California. So we took trips pretty frequently when we could. But I'm don't remember which vacations we took trips there and which trips we took to other places. I remember some of them. But not all of them. How should I list my physical presence for those dates? Do I just list my hometown as where I was? We didn't travel internationally as much.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1bdgcqt",
        "title": "If the consular officer believes someone isn't biologically American father for CRBA...",
        "score": 0,
        "num_comments": 4,
        "author": "Unusual-Break-5522",
        "created_utc": 1710297379.0,
        "created_readable_utc": "2024-03-13 02:36:19 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bdgcqt/if_the_consular_officer_believes_someone_isnt/",
        "permalink": "https://reddit.com/r/immigration/comments/1bdgcqt/if_the_consular_officer_believes_someone_isnt/",
        "selftext": "can he or she outright reject the CRBA application even though the biological unmarried American father offers to do a DNA test and the father will pay for it himself? Or is the consular officer obligated to at least offer the option of a DNA test if the other documents don't show by \"clear and convincing\" evidence that the American man is the biological father?\n\nThere is another man's name listed on the birth certificate as the father. But the American man and the mother have done their own DNA test and have determined that the child is their's bologically. Mother is married to the man whose name is on the birth certificate as father.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1bcal8f",
        "title": "Does a 4ish year physical gap in a marriage matter if it was more than ten years ago and the couple now have kids?",
        "score": 2,
        "num_comments": 1,
        "author": "JustComputer9230",
        "created_utc": 1710182357.0,
        "created_readable_utc": "2024-03-11 18:39:17 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bcal8f/does_a_4ish_year_physical_gap_in_a_marriage/",
        "permalink": "https://reddit.com/r/immigration/comments/1bcal8f/does_a_4ish_year_physical_gap_in_a_marriage/",
        "selftext": "Short story online relationship, talked for years, video chat, talking all night on bluetooth earpieces over VOIP. USC then visited alien spouse's country for 6 months during which they married(three months in). USC returned to the US to start the CR1 process but alien spouse's mother became terminally ill and bed bound and they quit their job to care for them and there was no one else who was willing. By the time the mother died USC spouse had family issues and co-sponsor flake so they decided to just immigrate to alien spouse's country as the process was easier and due to frustration.\n\nIts now more than ten years since then, couple has kids together. I ask if this will matter with a potential IR1 visa application now because consular officer seemed to take issue with the gap during CRBA process and I have read long gaps are an issue.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1bc6kvz",
        "title": "CRBA to same sex couple",
        "score": 9,
        "num_comments": 11,
        "author": "thedenofwolves",
        "created_utc": 1710172759.0,
        "created_readable_utc": "2024-03-11 15:59:19 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bc6kvz/crba_to_same_sex_couple/",
        "permalink": "https://reddit.com/r/immigration/comments/1bc6kvz/crba_to_same_sex_couple/",
        "selftext": "Hi all. I have a son born to my foreign wife (we are a same sex couple). We have a birth certificate for him with both our details on it, as well as our marriage certificate etc. I am not biologically related to my son however. \n\nAs far as I’m aware, since 2021 USCIS changed its policy in this case, allowing the child of married same sex parents to acquire citizenship regardless of which parent is biologically related to the child. Am I misunderstanding this?\n\nWhen I try to submit my CRBA application online for my son, it asks if I’m the biological parent, which I’m not, and then won’t let me proceed. I’m not sure if I’m not understanding the policy correctly or if I need to apply differently or whether I need to seek out a lawyer to establish his citizenship. Has anyone been in this situation or know who I could speak to with regards to this?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.85,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1bbuimf",
        "title": "Phones Allowed at CRBA Interview? (Similar to Visa Interview)",
        "score": 1,
        "num_comments": 1,
        "author": "mapsyal",
        "created_utc": 1710130568.0,
        "created_readable_utc": "2024-03-11 04:16:08 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bbuimf/phones_allowed_at_crba_interview_similar_to_visa/",
        "permalink": "https://reddit.com/r/immigration/comments/1bbuimf/phones_allowed_at_crba_interview_similar_to_visa/",
        "selftext": "I know the consulate doesn't allow any technology or personal items to be taken in with you for the visa interview. Does the consulate's CRBA interview have that same rule?\n\nJust trying to plan if I need to leave stuff at the hotel or not.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1bb7bxj",
        "title": "PHYSICAL PRESENCE CONFUSION for CRBA (CONSULAR REPORT OF BIRTH ABROAD)",
        "score": 1,
        "num_comments": 3,
        "author": "Prestigious_Leek_124",
        "created_utc": 1710066724.0,
        "created_readable_utc": "2024-03-10 10:32:04 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1bb7bxj/physical_presence_confusion_for_crba_consular/",
        "permalink": "https://reddit.com/r/immigration/comments/1bb7bxj/physical_presence_confusion_for_crba_consular/",
        "selftext": "Regarding the physical presence I keep on getting different answers. Can physical presence be established if it was some years prior to the child's birth and the rest after or do all 5 years have to be prior to the birth of the child?\n\n&#x200B;",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1b8fasg",
        "title": "What would happen if a person presents alternative documentation at the border to prove citizenship",
        "score": 0,
        "num_comments": 11,
        "author": "Mission-Resolve-8576",
        "created_utc": 1709768862.0,
        "created_readable_utc": "2024-03-06 23:47:42 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1b8fasg/what_would_happen_if_a_person_presents/",
        "permalink": "https://reddit.com/r/immigration/comments/1b8fasg/what_would_happen_if_a_person_presents/",
        "selftext": "Suppose a foreign citizen has ESTA. the foreign citizen has a US citizen partner. They have a child born abroad. They wish to enter the USA by land.\n\n1. If they don't have a us passport or crba for the child, but they have proof of the child's citizenship, can cbp deny entry to the foreign parent on the basis that the child doesn't have proper documentation? Or is cbp only able to deny entry on inadmissibility issues such as immigrant intent of the foreigner, working without authorization, or criminal history matter?\n\n2. As a practical matter, if the baby has a foreign passport and couple submits proof of physical presence of the US citizen parent as well as a birth certificate, how much time delay are we looking at before the couple is let in?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.29,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1b8c950",
        "title": "CRBA CONFUSION REGARDING Physical Presence,",
        "score": 3,
        "num_comments": 7,
        "author": "Prestigious_Leek_124",
        "created_utc": 1709761603.0,
        "created_readable_utc": "2024-03-06 21:46:43 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1b8c950/crba_confusion_regarding_physical_presence/",
        "permalink": "https://reddit.com/r/immigration/comments/1b8c950/crba_confusion_regarding_physical_presence/",
        "selftext": "1. Regarding the physical presence in order to get the CRBA (CONSULAR REPORT OF BIRTH ABROAD) for a child does the US citizen father parent have to be in the US 5 years prior to the child being born or can he fulfill that requirement after the child’s birth? Also do those 5 years don’t have to be consecutive right?\n\n\n2.  The birth certificate document requirement for CRBA (CONSULAR REPORT OF BIRTH ABROAD) the child’s surname was randomly chosen by the mother would this have any affect on the CRBA application when the parents try to apply for CRBA for the child, since the surname is different than the real fathers name?\n\n3.  Marriage certificate for CRBA (CONSULAR REPORT OF BIRTH ABROAD)  isn’t applicable right if the parents country was in civil war and no institutions were open to document the marriage right?\n\n4. CAN I JUST APPLY FOR A PASSPORT INSTEAD OF CRBA AND DEAL WITH THE CRBA LATER IN NAIROBI KENYA?\n\nTHANK YOU GUYS FOR YOUR INPUT.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1b53igj",
        "title": "CRBA - How to apply for a passport?",
        "score": 1,
        "num_comments": 16,
        "author": "minzdrav0",
        "created_utc": 1709425794.0,
        "created_readable_utc": "2024-03-03 00:29:54 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1b53igj/crba_how_to_apply_for_a_passport/",
        "permalink": "https://reddit.com/r/immigration/comments/1b53igj/crba_how_to_apply_for_a_passport/",
        "selftext": "Hi! I've submitted a CRBA application online and scheduled an interview. I also want to apply for a passport for my child. Do I just bring a passport application, cash to pay fees and a child's photo with me at the CRBA interview? Or do I have to apply for it separately online? I'd like to do both the CRBA and the passport at the same time. Thanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1b46ycz",
        "title": "Traveling to Mexico from Arizona in 2 weeks - CRBA for 18 year old?",
        "score": 1,
        "num_comments": 2,
        "author": "ctainaz",
        "created_utc": 1709330512.0,
        "created_readable_utc": "2024-03-01 22:01:52 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1b46ycz/traveling_to_mexico_from_arizona_in_2_weeks_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1b46ycz/traveling_to_mexico_from_arizona_in_2_weeks_crba/",
        "selftext": "We are traveling to Baja Mexico in 2 weeks from Arizona. My step son's (18m) passport recently expired. He was born in Italy and has a CRBA, as well as Arizona Driver's License and the expired passport. Will this be enough to get to Mexico (from Arizona, US), and back from Mexico (to Arizona, US)? The stay will be 6 days. Thank you in advance. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1b3jt76",
        "title": "Conditions for emergency passport for newborn",
        "score": 1,
        "num_comments": 1,
        "author": "Loud_Travel_4662",
        "created_utc": 1709262471.0,
        "created_readable_utc": "2024-03-01 03:07:51 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1b3jt76/conditions_for_emergency_passport_for_newborn/",
        "permalink": "https://reddit.com/r/immigration/comments/1b3jt76/conditions_for_emergency_passport_for_newborn/",
        "selftext": "Me and my partner were looking to take the baby to the US to visit my parents. There's no real medical emergency or anything like that. No one is dying. What are the chances the US embassy issues a emergency passport during CRBA interview? I don't want to wait 6 weeks to get the passport. Can we just travel on through Canada and get to the border? My partner's a EU citizen, so baby has a EU passport. So we can enter on that. We have the documents proving my baby is a US citizen.\n\n1. Birth certificate\n\n2. High school transcripts\n\n3. College transcripts\n\n4. W2 before I moved abroad with my partner.\n\n5. EU passport my baby\n\nI am the mother so marriage cert doesn't make a difference. My partner who is listed on the birth cert is traveling with me so custody permission shouldn't be an issue.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1b2fr29",
        "title": "Us embassy denied my son a visa claiming he is a citizen",
        "score": 71,
        "num_comments": 27,
        "author": "Direct_Complaint_521",
        "created_utc": 1709150451.0,
        "created_readable_utc": "2024-02-28 20:00:51 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1b2fr29/us_embassy_denied_my_son_a_visa_claiming_he_is_a/",
        "permalink": "https://reddit.com/r/immigration/comments/1b2fr29/us_embassy_denied_my_son_a_visa_claiming_he_is_a/",
        "selftext": "My girlfriend has a b1 visa and she applied for a b1/b2 visa for our son. But someone named \"ACS\" from the consulate contacted us and denied it saying we need a passport and a crba. They said that since I was born in the us and acknowledged my kid by being at birth registration my kid is a citizen already. It didn't contain any other instructions.\n\n\nWhat is \"ACS\" and is my son a citizen?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.84,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1b1crqx",
        "title": "Does the US Consulate have incorrect information?",
        "score": 0,
        "num_comments": 9,
        "author": "Cheap_Block5743",
        "created_utc": 1709043085.0,
        "created_readable_utc": "2024-02-27 14:11:25 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1b1crqx/does_the_us_consulate_have_incorrect_information/",
        "permalink": "https://reddit.com/r/immigration/comments/1b1crqx/does_the_us_consulate_have_incorrect_information/",
        "selftext": "I am looking to see whether the US consulate in Amsterdam has incorrect information on its website.\n\nhttps://nl.usembassy.gov/u-s-citizen-services/child-family-matters/crba/\n\nUnder child born in wedlock to US citizens it says\n\n> A child born outside the United States or its outlying possessions to two U.S. citizen parents, in wedlock, is entitled to citizenship, provided one parent has, prior to the birth of the child, been resident in the United States or one of its outlying possessions.  No specific period of time is required.\n\n> NOTE:  A child born to two U.S. citizens, out of wedlock should refer to one of the categories below (whichever applies favorably).\n\n> For children not covered in the above categories, please contact this office or see section on Acquisition of U.S. Citizenship.\n\n> Please read the information about proof of residence in the U.S.\n\nThen the following categories are child born in wedlock to one US citizen parent, child born out of wedlock to US citizen mother, and child born out of wedlock to US citizen father.\n\nThe first is inapplicable because both the parents are US citizens. The second and third ones all have varying physical presence requirements (either one continuous year or 5 years). However, this requirement for physical presence seems to be different from the requirement from the general requirement for just residence in the US prior to birth of child. \n\n> If the child was born abroad out-of-wedlock on or after November 14, 1986 to two U.S. citizen parents, and the U.S. citizen father satisfies the criteria of the “new” INA 309(a), listed below, the child will acquire U.S. citizenship under INA 301(c) if at least one of the parents had a residence in the United States or one of its outlying possessions prior to the person’s birth. \n\nhttps://travel.state.gov/content/travel/en/legal/travel-legal-considerations/us-citizenship/Acquisition-US-Citizenship-Child-Born-Abroad.html\n\nCan someone clear up this confusion? Is it just residence or physical presence? We don't have the documents to prove 5 years of physical presence (although we have done high school in America).\n\nEDIT: \n\nTo be clear, I am expecting. My boyfriend is a US citizen. I am a dual EU-US citizen. I was born in the US and lived there till I was 10. My boyfriend has lived in the US his entire life, but doesn't have the documents to prove 5 years worth (he doesn't have his transcripts). He does have proof he was a resident in the US in the form of a lease agreement and expired driver's license.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1ayv5gi",
        "title": "School in Tennessee won't accept crba",
        "score": 2,
        "num_comments": 29,
        "author": "Due-Cartoonist8308",
        "created_utc": 1708783121.0,
        "created_readable_utc": "2024-02-24 13:58:41 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ayv5gi/school_in_tennessee_wont_accept_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1ayv5gi/school_in_tennessee_wont_accept_crba/",
        "selftext": "Earlier this month, I made the difficult decision to move my family here from my husband's home country. He's coming shortly, as soon as he gets his IV. In the meantime, my daughter and I are here in the USA finding a place to live. We've found an affordable place to live. However, now that we have found a place to rent, the local school won't accept the crba. They asked me if my daughter is a us citizen. She is because I spent my life here in the USA prior to moving to my husband's country. Then they said that because she was a US citizen, they need an original birth certificate issued by a state, county, or local government here in the USA. I told them I don't have a birth certificate issued by anyone in the USA BECAUSE MY DAUGHTER WAS BORN OVERSEAS. I gave them a translated version of my daughter's foreign birth certificate which they didn't even bother looking at. They said they only accept foreign birth certificates if the child is not a US citizen and is an \"illegal\" (wtf?). I guess in their tiny brains, there can be no foreign born child who is here legally. They've enrolled my kid regardless because it is illegal to stop a child from attending school. But they requested I get the birth certificate immediately. Should I just ignore them? Should I involve my scumbag congressman? Or maybe show them my daughter's passport?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.56,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1axhfug",
        "title": "I got married after 2 days of knowing my spouse...",
        "score": 116,
        "num_comments": 50,
        "author": "Specific-Structure25",
        "created_utc": 1708635280.0,
        "created_readable_utc": "2024-02-22 20:54:40 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1axhfug/i_got_married_after_2_days_of_knowing_my_spouse/",
        "permalink": "https://reddit.com/r/immigration/comments/1axhfug/i_got_married_after_2_days_of_knowing_my_spouse/",
        "selftext": "and we have been married for 10 years with 3 kids. It wasn't an arranged marriage. At the time  we just had (and still do have) an INTENSE connection. It's like we magically knew we were meant to be.\n\nSo now I want to sponsor him for a green card because my mom is getting older. Kids are all us citizens.\n\nSo for evidence of bona fide marriage we were thinking\n\n1. Last 12 months of bank statements\n\n2. Proof we own property together\n\n3. Our kids 3 birth certificates and crba\n\nIs this enough?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.87,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1auk5g0",
        "title": "eCRBA consular processing",
        "score": 3,
        "num_comments": 12,
        "author": "Windiver22",
        "created_utc": 1708338247.0,
        "created_readable_utc": "2024-02-19 10:24:07 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1auk5g0/ecrba_consular_processing/",
        "permalink": "https://reddit.com/r/immigration/comments/1auk5g0/ecrba_consular_processing/",
        "selftext": "Quick question please. During your eCRBA interview did they check your passport for travel history? I travelled 4 months 2019-2020, 1 month 2021, 2 months 2022, and 1 month 2023. Will this go against me. I had to visit my wife.. Total of 8 added together moths in the past 5 years…But I have been working, paying rent and utilities while I was on leave. But I have been living here since I was 23, now I am 38. I have GED and college transcripts from 2012 to 2018. I have medical records and health insurance records. But this 8 month gap is stressing me out… Thank you..",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1apy2si",
        "title": "CRBA or bypass to US Passport or go through Green Card?",
        "score": 2,
        "num_comments": 13,
        "author": "Sea_Rough6675",
        "created_utc": 1707842887.0,
        "created_readable_utc": "2024-02-13 16:48:07 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1apy2si/crba_or_bypass_to_us_passport_or_go_through_green/",
        "permalink": "https://reddit.com/r/immigration/comments/1apy2si/crba_or_bypass_to_us_passport_or_go_through_green/",
        "selftext": "Hello everyone, well I am a bit confused  and need your help. I am a naturalized US citizen, have been since 2007. I am married to my wife a foreigner and we had a baby girl back in 2020 abroad in Ukraine. I did not register CRBA at that time. In September of 2022 I was able to get them paroled here to the US under the Uniting for Ukraine program. As the war rages on we have to consider our options. I will likely go through the green card process for my wife and wanted to do the same for my daughter but then learned that I don’t have to as there is a possibility to go through CRBA, but that means they have to go abroad to Poland. I finished high school and college here, went on vacation in summer every year but I should be able to prove the 5 year rule. My question is what should I do with my daughter? Can I apply for a US passport directly here in the US without the CRBA or should we fly to Poland and file it at a consulate? Or should I go the long route and go through the green card process and include my daughter together with my wife? Please help me understand. Thank you.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1ak1noz",
        "title": "Is a US passport issued to someone under 18 sufficient evidence for a CRBA?",
        "score": 3,
        "num_comments": 7,
        "author": "JustComputer9230",
        "created_utc": 1707194930.0,
        "created_readable_utc": "2024-02-06 04:48:50 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ak1noz/is_a_us_passport_issued_to_someone_under_18/",
        "permalink": "https://reddit.com/r/immigration/comments/1ak1noz/is_a_us_passport_issued_to_someone_under_18/",
        "selftext": "I got annoyed with requests for more evidence when applying for a CRBA for my child, so I just went and applied for a US passport with my evidence and an affidavit and it was issued. The child is still under 18.\n\nCan I now make another appointment and use the US passport as proof of transmission?\n\nI realize now I might have made a mistake and should have pursued the CRBA as the N-600 cert in outrageously expensive. If I can still grab the CRBA I'd prefer that!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "1air1tx",
        "title": "emergency passport without crba",
        "score": 0,
        "num_comments": 4,
        "author": "Alternative-Fee-2703",
        "created_utc": 1707062269.0,
        "created_readable_utc": "2024-02-04 15:57:49 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1air1tx/emergency_passport_without_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/1air1tx/emergency_passport_without_crba/",
        "selftext": "Can we apply for an emergency passport without a crba? Both of the child's parents are us citizens who have lived in the US before.\n\nAlternative option is esta because the child has a non-US passport through mother.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
  
    {
        "id": "19c7u3n",
        "title": "Should we get my son's foreign passport first even though the CRBA checklist doesn't require it?",
        "score": 1,
        "num_comments": 2,
        "author": "Prior_Knee6677",
        "created_utc": 1705856286.0,
        "created_readable_utc": "2024-01-21 16:58:06 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/19c7u3n/should_we_get_my_sons_foreign_passport_first_even/",
        "permalink": "https://reddit.com/r/immigration/comments/19c7u3n/should_we_get_my_sons_foreign_passport_first_even/",
        "selftext": "So my girlfriend and I live in one country but she is a citizen of another. I am American. We registered my son's birth first with her consulate. We got my son his non-American passport. Should we show this to the Embassy? Also, is it worth showing a certified copy of the acknowledgment of paternity I made at the local government office?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "19br1ip",
        "title": "CRBA 5-year physical presence only as US Citizen?",
        "score": 3,
        "num_comments": 6,
        "author": "neomoha",
        "created_utc": 1705798731.0,
        "created_readable_utc": "2024-01-21 00:58:51 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/19br1ip/crba_5year_physical_presence_only_as_us_citizen/",
        "permalink": "https://reddit.com/r/immigration/comments/19br1ip/crba_5year_physical_presence_only_as_us_citizen/",
        "selftext": "Hi all,\n\nI've been trying to find an answer to this question in multiple CRBA threads, but couldn't find any:\n\nFor the 5-year physical presence, does it only include years lived in the US as a citizen? or does it also include years lived as a permanent resident?\n\nThank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "199c1di",
        "title": "Getting an emergency passport for 4 month old infant",
        "score": 3,
        "num_comments": 1,
        "author": "ChartGullible6242",
        "created_utc": 1705536295.0,
        "created_readable_utc": "2024-01-18 00:04:55 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/199c1di/getting_an_emergency_passport_for_4_month_old/",
        "permalink": "https://reddit.com/r/immigration/comments/199c1di/getting_an_emergency_passport_for_4_month_old/",
        "selftext": "My foreign partner and I have an emergency and need to travel to the US. Unfortunately, the local US Embassy doesn't have any appointments for the next month or so for CRBA. \n\nI know a US Consulate in a neighboring country can do CRBA appointment, they'll just transfer it over to the correct Embassy.\n\nMy question is will the other Consulate issue a same-day emergency passport.\n\nWe already have a CRBA for our older child.\n\nOur younger one has an ESTA eligible passport.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "198ng5r",
        "title": "CRBA rejected, any other way??",
        "score": 1,
        "num_comments": 5,
        "author": "Mammoth_Pen3933",
        "created_utc": 1705464329.0,
        "created_readable_utc": "2024-01-17 04:05:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/198ng5r/crba_rejected_any_other_way/",
        "permalink": "https://reddit.com/r/immigration/comments/198ng5r/crba_rejected_any_other_way/",
        "selftext": "Hi i’m a us citizen who is currently living abroad. During my time abroad i had a baby with my husband abroad. We filed for his CRBA, but it was rejected, because i didn’t complete the 5 year policy. I also filed for my Husbands i-130 in 2023, which is at nvc as of right now , and we both hadplanned to leave in around 6 months, so is there anyway to get my baby to the usa without having to file for i-130 for my baby as it takes around 1.5 years, and my husband won’t be here to support me. i’ve heard that the baby could be added to my husbands case, or that he could be given a waiver/temporary visa, to be transported to the usa .Pls let me know if there is any way and thank you for reading.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "197807h",
        "title": "Would RON work for CRBA and passport applications?",
        "score": 1,
        "num_comments": 1,
        "author": "Ok-Boysenberry-1512",
        "created_utc": 1705323089.0,
        "created_readable_utc": "2024-01-15 12:51:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/197807h/would_ron_work_for_crba_and_passport_applications/",
        "permalink": "https://reddit.com/r/immigration/comments/197807h/would_ron_work_for_crba_and_passport_applications/",
        "selftext": "For the US embassy of the country I live in, DoS says that you can use many online remote notaries located in the US for any \"notorial acts.\" Can you do the same for DoS forms such as the Ds-2029 and Ds-3053?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "195gyj7",
        "title": "CRBA application questions",
        "score": 1,
        "num_comments": 4,
        "author": "NoBackground6370",
        "created_utc": 1705125038.0,
        "created_readable_utc": "2024-01-13 05:50:38 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/195gyj7/crba_application_questions/",
        "permalink": "https://reddit.com/r/immigration/comments/195gyj7/crba_application_questions/",
        "selftext": "I am filing for a CRBA application. I have a few questions.\n\n1. The application asks for the \"current physical address\" and contact information. I am on a trip temporarily visiting my wife and kid. Do I put my wife's address in the foreign country or my US address?\n\n2. I grew up in California and took frequent road trips to neighboring states when I was a kid. I don't remember which years I went to what state and what months. We usually only went for like a week. How do I document those times? Or do I just say that I was in my home town?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "193n4u3",
        "title": "Help on how to package crba application",
        "score": 1,
        "num_comments": 0,
        "author": "AffectionateKing7227",
        "created_utc": 1704930588.0,
        "created_readable_utc": "2024-01-10 23:49:48 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/193n4u3/help_on_how_to_package_crba_application/",
        "permalink": "https://reddit.com/r/immigration/comments/193n4u3/help_on_how_to_package_crba_application/",
        "selftext": "For some reason I can't access my us debit card and bank account overseas. So I'll do a paper application.\n\nI've gotten all the documents and I've made copies. How do I prove that the transcripts are real? I got 3 copies. Two are signed, stamped, and in a sealed envelope. One I have out. \n\nShould I put my documents in a manila envelope? How should I segregate them so it is the least inconvenient for the co and me and can be done quickly? Do I just carry them as a stack with a paper clip? Anyone done this? The website doesn't give info.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "192tlzv",
        "title": "HELP! Can I apply for crba for our kid without foreign birth certificate?",
        "score": 3,
        "num_comments": 10,
        "author": "Odd-Assumption9757",
        "created_utc": 1704844001.0,
        "created_readable_utc": "2024-01-09 23:46:41 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/192tlzv/help_can_i_apply_for_crba_for_our_kid_without/",
        "permalink": "https://reddit.com/r/immigration/comments/192tlzv/help_can_i_apply_for_crba_for_our_kid_without/",
        "selftext": "My foreign partner gave birth and we are not married. We're both single. The local government won't give us my daughter's birth certificate unless we show them a marriage certificate. We don't want to get married because of personal reasons. This is completely against the regulations in the foreign country because the regulations say you have to give a birth certificate, even if the birth is outside of marriage. We have repeatedly ask the registrar to do so, but they refused. Honestly, they probably want a bribe.  Even if we got married, they will want a bribe. And we don't want to pay them a bribe. Getting married here takes 3 months and you have to pay bribes to get them to process the marriage paperwork. Even if you pay the bribes, it takes 3 months. And we don't want to pay bribes.\n\nWhat are our options *besides* getting married or paying a bribe? \n\nWe have all the other documentation the US consulate lists on their website.\n\nMy questions are:\n\n1. In lieu of the birth certificate, can they accept the hospital documentation of my partner's treatment (discharge papers, registration, payment receipts), pregnancy (ultrasounds, dr. appointment paperwork), and hospital papers relating to my baby? There are also photos we took of my partner when she was pregnant. Also, if it comes to it, there is a video of the birth.\n\n2. Would a signed letter from doctor on hospital letterhead who delivered the baby explaining the circumstances around the birth (who was there to witness, date of delivery, date of discharge, id that my partner used to identify herself, etc.) help? The hospital is pretty prominent in the city we live in and is located < 10 miles from us consulate. It is one of the best hospitals in the city (no joke!). \n\n3. Is there any other evidence we can use to overcome this problem?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "192lopn",
        "title": "Can I apply for a passport card at US Embassy and not the book",
        "score": 1,
        "num_comments": 1,
        "author": "VegetableOpposite789",
        "created_utc": 1704824978.0,
        "created_readable_utc": "2024-01-09 18:29:38 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/192lopn/can_i_apply_for_a_passport_card_at_us_embassy_and/",
        "permalink": "https://reddit.com/r/immigration/comments/192lopn/can_i_apply_for_a_passport_card_at_us_embassy_and/",
        "selftext": "I am preparing to file a CRBA application for my son. My son has dual citizenship because my husband is not American. Can we just get a passport card for him instead of the book because we don't intend to travel for a while or would it be unusual because we're not in Canada?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "18zau5c",
        "title": "Can my foreign partner apply for a CRBA and passport for our kid without me?",
        "score": 2,
        "num_comments": 5,
        "author": "Icy_Journalist4306",
        "created_utc": 1704471968.0,
        "created_readable_utc": "2024-01-05 16:26:08 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18zau5c/can_my_foreign_partner_apply_for_a_crba_and/",
        "permalink": "https://reddit.com/r/immigration/comments/18zau5c/can_my_foreign_partner_apply_for_a_crba_and/",
        "selftext": "I'm wondering if this is possible. I signed an acknowledgment of paternity and local law says that any man acknowledging paternity has a duty to support the child. For unmarried parents, the default custody is with the mother unless specifically requested to be joint custody. We haven't requested joint custody.\n\n1. How likely is it the US Consulate knows the default custody laws and requires only her permission?\n\n2. My university and college has issued me electronic transcripts. She has access to my IRS account so she can access the electronic tax transcripts which has my W2 info.\n\n3. She has proof my us citizenship because she has an expired US passport of mine",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "18uyuqc",
        "title": "I-130 or us citizenship?",
        "score": 3,
        "num_comments": 8,
        "author": "Infamous_Sky_1330",
        "created_utc": 1703995464.0,
        "created_readable_utc": "2023-12-31 04:04:24 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18uyuqc/i130_or_us_citizenship/",
        "permalink": "https://reddit.com/r/immigration/comments/18uyuqc/i130_or_us_citizenship/",
        "selftext": "This is about my stepson who is 6 years old. I am looking to bring him and my foreign wife to America. For my wife, the path is clear: file the i-130 and provide evidence of the relationship. My stepson is trickier. My wife's ex is an American citizen and my stepson was born out of wedlock outside the US.\n\nMy wife's ex was born in NYC and lived all his life in NYC and philly before living with my wife abroad. After birth, my wife's ex willingly signed an acknowledgment of paternity in the foreign country under the foreign country's laws. \n\nSubsequently, my wife and ex got married in the foreign country. Their marriage happened a year after the birth of my stepson. However, my wife caught him cheating. So they got divorced and my wife's ex now lives in America. My wife's ex is a complete piece of shit. He didn't do anything to make sure that my stepson would get a us passport or crba. He's a drug addict and hasn't seen my stepson in almost 3 years. He only sporadically pays child support.\n\nThe key question is: does the subsequent marriage of my wife's ex and her fulfill the requirement of voluntarily agreeing to financially support my stepson till he is 18 even though they have since divorced?\n\nIt is also worth mentioning that my wife's ex voluntarily acknowledged paternity under oath and under the foreign country's laws parents are obligated to support their kids. So in a sense he voluntarily agreed to support him when he signed that paternity acknowledgment.\n\nMy wife's ex definitely spent 5 years physically in the US prior to birth of my stepson and his name is on the birth certificate.\n\nSo is my stepson a us citizen by virtue of the marriage between my wife and her ex?\n\nEdit: I should mention that my wife's ex's family is fully involved in my stepson's life. My wife's former mil and sil are willing to provide dna, my wife's ex birth certificates, and other evidence they have to prove my wife's ex physical presence.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.8,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "18r7xjv",
        "title": "My wife is adopted. Is it possible for her to still get US citizenship?",
        "score": 27,
        "num_comments": 33,
        "author": "Next-Community4020",
        "created_utc": 1703596610.0,
        "created_readable_utc": "2023-12-26 13:16:50 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18r7xjv/my_wife_is_adopted_is_it_possible_for_her_to/",
        "permalink": "https://reddit.com/r/immigration/comments/18r7xjv/my_wife_is_adopted_is_it_possible_for_her_to/",
        "selftext": "I am a US citizen in the process of gathering evidence for my wife's I-130. My wife has given birth to our first son here in the country we live. So one of the pieces of evidence will be our son's birth certificate.\n\nLooking at the rules for citizenship, I was wondering if my wife is already a US citizen.\n\nMy wife's birth mother is an American citizen. She got pregnant with my wife at 18, gave birth at 19 in the foreign country and gave my wife for adoption. All this happened in a foreign country. My wife's bio dad is a foreigner. His name is on the original birth certificate as well. My wife's birth mother and bio dad weren't married.\n\nWe've finally gotten her original foreign birth certificate. It does mention my wife's birth mother. \n\nIn addition, my wife's birth mother is involved in our lives, and she would have no problem taking a DNA test.\n\nMy wife's birth mother was born in the US and lived in the US until she turned 12. She then moved with my wife's biological grandparents to another country where she got pregnant.\n\nI imagine if my wife's birth mother hadn't given my wife up for adoption, then my wife would be a US citizen today. Did the subsequent adoption terminate the US citizenship? \n\nMy wife was born in 1992. \n\nIf my wife is a US citizen, should we wait till my wife's US passport is issued to get a CRBA for my son?\n\nEDIT: My wife's adopted parents aren't US citizens.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.85,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "18m3l80",
        "title": "CRBA appointment with only one parent?",
        "score": 3,
        "num_comments": 7,
        "author": "Crazy-Seat-7381",
        "created_utc": 1702997267.0,
        "created_readable_utc": "2023-12-19 14:47:47 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18m3l80/crba_appointment_with_only_one_parent/",
        "permalink": "https://reddit.com/r/immigration/comments/18m3l80/crba_appointment_with_only_one_parent/",
        "selftext": "Is it possible to attend the crba appointment without the father? He is traveling for work, so won't be there the day of the appointment and is the a non-US citizen. I'm the US citizen and can attend it with the baby. Is there a form we could use instead and have notarize? Before anyone asks why not reschedule? It took us 4 months to get this appointment after he couldn't make the first one they offered, so I really want to make this one work if possible.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "18i5uyt",
        "title": "What questions do they ask you at the CRBA interview?",
        "score": 3,
        "num_comments": 2,
        "author": "Decent-Judgment7867",
        "created_utc": 1702550229.0,
        "created_readable_utc": "2023-12-14 10:37:09 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18i5uyt/what_questions_do_they_ask_you_at_the_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/18i5uyt/what_questions_do_they_ask_you_at_the_crba/",
        "selftext": "I'm the US citizen father and we had a kid but we're not married. Out of wedlock kids aren't common where we live. Mother is foreigner.\n\nSo what questions do they ask? If you can give examples I'd be grateful. Some things I am thinking about:\n\n* Our relationship (especially cause we live in a conservative country)\n\n* My physical presence in the US (where I lived, where I went to school, etc.)\n\nWill it be like a green card interview in that they ask us to prove our relationship with each other? Can we just outright ask for a DNA test at the beginning? I don't mind answering the questions about the relationship, but I want my son's citizenship to be as official and proper as possible. The best official proof is a DNA test. I don't mind spending $2k on that. I love my son and I just want him to have a good life. DNA test is pretty much conclusive that he is my biological kid, even though I know he is my biological kid, I want DNA test to be in government files so if there is a scenario in the future, he can have that.\n\nAnyone can think of anything else that might come up?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "18fsgym",
        "title": "Getting my younger brother a us passport",
        "score": 2,
        "num_comments": 17,
        "author": "Business_Addition_89",
        "created_utc": 1702294183.0,
        "created_readable_utc": "2023-12-11 11:29:43 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18fsgym/getting_my_younger_brother_a_us_passport/",
        "permalink": "https://reddit.com/r/immigration/comments/18fsgym/getting_my_younger_brother_a_us_passport/",
        "selftext": "I am a us citizen with a crba and us passport. My mom is a us citizen. My dad isn't .I have a younger half-brother and we have the same mom, but different dads.\n\nOur mom cheated on my dad with his dad and then my brother was born when  my mom was separated from my dad. We currently have no contact with our mother.\n\nNow my brother is 16 and wants to come to the USA on a school trip.\n\n1. Is my brother a us citizen? Is he considered in wedlock or out of wedlock \n\n2. Does my crba provide any evidentiary value that my mother was physically present in the USA for the requisite amount of time to pass on citizenship to my brother, who is younger than me? \n\n3. Are the dates of my mom's physical presence on a crba application form considered information that the state department might have to redact under privacy act if I do a FOIA for my own crba application?\n\n4. If dos doesn't accept my crba as proof of my mom's physical presence what other evidence can I access in the absence of my mom's lack of cooperation?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "18f5hqa",
        "title": "Getting my child US citizenship",
        "score": 1,
        "num_comments": 17,
        "author": "Due-Yogurtcloset-814",
        "created_utc": 1702220659.0,
        "created_readable_utc": "2023-12-10 15:04:19 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18f5hqa/getting_my_child_us_citizenship/",
        "permalink": "https://reddit.com/r/immigration/comments/18f5hqa/getting_my_child_us_citizenship/",
        "selftext": "I had a casual sex with a friend. We were not sure who the father is of the kid. So, we agreed that after the kid was born we'd both go to the foreign court where we live and establish paternity through DNA testing with the 2 possible fathers. We all took Dna tests through the court. Now, it has been established by court order that I am the father, based on DNA test. Also, the court ordered I pay child support, which I was planning to do anyways if the kid was mine.\n\n1. What are the chances the US embassy will require their own DNA test if the country where this court order was done is a western European country?\n\n2. Should we bring the court order with us to the CRBA interview even though it doesn't say to bring such a thing anywhere in the checklist?\n\n3. If the US embassy does require it's own DNA testing, does anyone know how long does it take and how much it might delay the issuance of the CRBA by?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.52,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "18dgwdq",
        "title": "Possible to get certified copy of DS-2029 form",
        "score": 1,
        "num_comments": 1,
        "author": "Dull_Aardvark8786",
        "created_utc": 1702017844.0,
        "created_readable_utc": "2023-12-08 06:44:04 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18dgwdq/possible_to_get_certified_copy_of_ds2029_form/",
        "permalink": "https://reddit.com/r/immigration/comments/18dgwdq/possible_to_get_certified_copy_of_ds2029_form/",
        "selftext": "My wife's country wants a certified copy of the DS-2029 form and the supporting documentation we gave when we filed for our son's CRBA. They don't want the FS-240 (post-2010). They want the details of my physical presence in the USA.\n\nIs it possible to get the documents that we get from Privacy Act request certified by the State Department as being a true copy of the ones they have on file?\n\nOr since I see that the DS-2029 form has space for a consular officer to sign as well, can we get an apostille for that consular officer's signature once we get the Privacy Act request reply?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "18c23oa",
        "title": "I applied for CRBA but I can't schedule any appointment...",
        "score": 1,
        "num_comments": 13,
        "author": "mirkojax",
        "created_utc": 1701862639.0,
        "created_readable_utc": "2023-12-06 11:37:19 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18c23oa/i_applied_for_crba_but_i_cant_schedule_any/",
        "permalink": "https://reddit.com/r/immigration/comments/18c23oa/i_applied_for_crba_but_i_cant_schedule_any/",
        "selftext": "I applied for CRBA but I can't schedule any appointment. The site doesn't show any date available up to December 2024. Is it correct the wait is so long?  \nOr do they open more day at the beginning of the month or something like that.?  \nAlso from the paperwork I was under the impression that they would schedule an appointment after the reviewed the document I submit, but online says I need to schedule an appointment.  \nI would appreciate any information you can provide since the embassy doesn't respond to any email or phone calls.  \n\\*\\*UPDATE: the calendar is indeed all grey meaning \"Date already passed or not yet open for appointments\" NOT fully booked as I thought at first.   \nHowever, anyone knows when do they open the available dates? At the beginning of the month?\n\nUPDATE:  they eventually sent me an email and the appointment was Feb 1. (7 days after the email). We went to Rome gave all paperwork. They reviewed the documenta but we will need to meet with an American officer who will basically do like an immigration interview (we weren’t not expecting this). \n\nHe seems all nice and friendly but be careful at what you says. He asked to our other daughter of 3 years the name of the baby. He asked where me and my wife met. He asked many other questions, because every time you go under immigration they want to make sure everything is fine on everything. \n\nAt the end we were approved.  Phewww",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "18b0jf2",
        "title": "Immigration issues with Baby (Mexico - US)",
        "score": 3,
        "num_comments": 51,
        "author": "Grouchy_Teacher433",
        "created_utc": 1701740702.0,
        "created_readable_utc": "2023-12-05 01:45:02 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/18b0jf2/immigration_issues_with_baby_mexico_us/",
        "permalink": "https://reddit.com/r/immigration/comments/18b0jf2/immigration_issues_with_baby_mexico_us/",
        "selftext": "Hello to everyone!\n\nI already wrote a post a few months ago and want to explain the situation again with current events and ask for advice. Thanks to everyone who already read and responded to my previous post.\r  \n\r  \nI am a German citizen with a US Green Card, and my husband is a German and US citizen. We traveled to Mexico at the end of November 2022, and I gave birth to a daughter there in mid-December. She has Mexican citizenship with a birth certificate and passport.\r  \n\r  \nOriginally, we only planned to stay in Mexico until April/May. In early 2023, we tried to obtain a CRBA. Unfortunately, my husband could only prove 4.5 years of physical presence instead of the required 5 years, so it was unsuccessful.\r  \n\r  \nThen we tried to at least get a visa for her. We only got an appointment at the consulate in December 2024, and expediting the appointment was not possible. I asked for help here on Reddit, and I was pointed to 'Child born abroad to LPR' and according to the CBP website we met all requirements.\r  \n\r  \nUnfortunately, we had some problems, and our return was delayed to mid-November – it was not planned, but I still thought we could enter with our baby since we still met all the requirements! Unfortunately, we were denied entry. We tried again the next day, and it still didn't work, despite presenting the information on paper and arguing that we meet all requirements!!\r  \n\r  \nThey argued that we had lived abroad for the last 11 months. We said it was not planned and it was still a temporary stay, and the website also states 'temporary stay abroad under 1 year'... I could also prove in writing that I am still employed in California. The officers were not interested at all. Both times we were treated very rudely and could only speak to someone through the fence.\r  \n\r  \nSince I had to enter due to my Green Card (funnily I had no issues at all entering the country by myself...) and job, my husband is now staying with our daughter in Mexico, and we are considering our options. Is there any way to appeal this decision? Do we even have a chance?\r  \n\r  \nOtherwise, we can now apply for the I-130. Does anyone know how long that currently takes? \n\nAlso, I can likely apply for US citizenship in April, and then theoretically, we could apply for CRBA again, this time without physical presence, right?\n\nAny other advice? I really miss my baby...\r  \n\r  \nThanks in advance for the help!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.71,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "17ybi57",
        "title": "PDF transcript vs paper transcript for CRBA.",
        "score": 1,
        "num_comments": 2,
        "author": "LivingAppropriate964",
        "created_utc": 1700328896.0,
        "created_readable_utc": "2023-11-18 17:34:56 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/17ybi57/pdf_transcript_vs_paper_transcript_for_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/17ybi57/pdf_transcript_vs_paper_transcript_for_crba/",
        "selftext": "I am an American who went to UCLA. I just had a kid abroad. Baby is US citizen. \n\nFor the transcripts, is electronic transcript okay or are the US Embassy folks pretty rigid and old-fashioned and want stamped transcripts?\n\nhttps://registrar.ucla.edu/student-records/academic-transcript/academic-transcript-format\n\nAlso, please tell me that this process will be easier than the pain in the ass it has been to register the birth with the German Consulate (baby is German too) where for some idiotic reason they needed my birth certificate. When we tried to get married they asked for \"certificate of no impediment.\" We stopped trying to get married.\n\nHow can I prepare the documents so I am helping the Embassy help me if that makes sense? Should I just follow the directions on the website and that'll be that, or will it be like German bureaucracy where they need some extra document in some really particular format. Like how do I make it so that I won't have to deal with stupid bureaucracy I see in German consulate. I just want shiney new baby American passport that my baby will inevitably slobber, despite my best efforts.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "17v8oww",
        "title": "DS-5507 and CRBA Question",
        "score": 1,
        "num_comments": 5,
        "author": "One2Olive",
        "created_utc": 1699986441.0,
        "created_readable_utc": "2023-11-14 18:27:21 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/17v8oww/ds5507_and_crba_question/",
        "permalink": "https://reddit.com/r/immigration/comments/17v8oww/ds5507_and_crba_question/",
        "selftext": "So I filled out my DS-5507 as well as my eCRBA application but I have yet to submit them yet.  The DS-5507 requires a signature before a consulate notary.  Can I submit the unsigned DS – 5507 with my electronic CRBA application and get the signature at my CRBA appointment?  Or does it need to be signed prior to my CRBA appointment?  \n\nI’m really hoping I do not have to make two trips to the consulate.  \n\nThanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "17trivf",
        "title": "Did US Embassy and Consulates always require appointments for passport renewals and ACS unit things?",
        "score": 3,
        "num_comments": 2,
        "author": "Objective-Chef7386",
        "created_utc": 1699817143.0,
        "created_readable_utc": "2023-11-12 19:25:43 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/17trivf/did_us_embassy_and_consulates_always_require/",
        "permalink": "https://reddit.com/r/immigration/comments/17trivf/did_us_embassy_and_consulates_always_require/",
        "selftext": "So this post is out of curiosity more than anything else. My dad is a bit of a storyteller. He loves to stretch the truth in stupid, inconsequential things. He's never lied outright. So recently I was complaining about how there were so few appointments to get a CRBA for my kid in the country where I live. My dad started talking about how when he was a \"young gun\" he didn't need any appointments to renew passports. My dad is 64. I myself was born overseas and my dad claimed that he walked into the Consulate alone without an appointment without my mom and applied for my CRB and apparently he got my passport the same day? Is there any shred of truth to this? I was born in 1989.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "17r8hpf",
        "title": "Common law marriage, CRBA, and green card",
        "score": 1,
        "num_comments": 2,
        "author": "Sufficient_Ant_2763",
        "created_utc": 1699518578.0,
        "created_readable_utc": "2023-11-09 08:29:38 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/17r8hpf/common_law_marriage_crba_and_green_card/",
        "permalink": "https://reddit.com/r/immigration/comments/17r8hpf/common_law_marriage_crba_and_green_card/",
        "selftext": "Hello everyone,\n\nI am a American citizen. I am married to a foreigner who was on an F1. While she was on an F1 visa, we got into a common law marriage because we lived in a common law state. The only official documentation for this common law marriage is the fact that I file taxes as a married couple plus I signed an affidavit filed with the county courthouse where we lived. I have a certified copy of this affidavit. After we finished our studies, we moved abroad, had the marriage recognized by my wife's home country, and had a kid born here.\n\n1. For the purposes of a CRBA, is our kid married in-wedlock or out-of-wedlock, even though we don't live in that state anymore?\n\n2. Can we file for a green card based on our common law marriage even though we are not residents of that state anymore?\n\nThank you",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "17i0qok",
        "title": "How do I email my receipt to my U.S embassy in Guadalajara",
        "score": 0,
        "num_comments": 4,
        "author": "AmorisLove",
        "created_utc": 1698449800.0,
        "created_readable_utc": "2023-10-27 23:36:40 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/17i0qok/how_do_i_email_my_receipt_to_my_us_embassy_in/",
        "permalink": "https://reddit.com/r/immigration/comments/17i0qok/how_do_i_email_my_receipt_to_my_us_embassy_in/",
        "selftext": "Hi I just paid for a crba for my son. How do I setup an appointment? Sorry I’m confused",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "17gme3e",
        "title": "Establishing niece's US citizenship through brother",
        "score": 2,
        "num_comments": 2,
        "author": "Street-Hand-1361",
        "created_utc": 1698287951.0,
        "created_readable_utc": "2023-10-26 02:39:11 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/17gme3e/establishing_nieces_us_citizenship_through_brother/",
        "permalink": "https://reddit.com/r/immigration/comments/17gme3e/establishing_nieces_us_citizenship_through_brother/",
        "selftext": "My brother, James, was a US citizen and never gave up citizenship. He lived his entire life here in the US, before he went to work in another country in 2019. He came back at the start of 2020 and he died due to COVID the same year.\n\nIn the foreign country, he met a woman I'll call Jane. Jane and James had my niece. My brother knew about my niece but chose not to tell me, my other brother, or my parents. We looked at his phone (which we had not unlocked since his death) and we found the evidence. He had sent money too. He didn't have a will.\n\nOne thing is, his name is not on the foreign birth certificate.\n\n6 months ago, Jane came to the US on a work visa with my niece. She contacted us. After some discussion, we decided it was worth it to get an at-home DNA test done and she was/is fully cooperative. There is no doubt that the father is James.\n\nWe have all decided to go to a US state court to get a formal declaration that James is the father. We know that we'll have to the DNA test again for the court.\n\nAssuming the court declares that James is the father, can we apply for a passport and CRBA for my niece?\n\nJane is fully cooperative.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "17g14fw",
        "title": "Coming to America",
        "score": 2,
        "num_comments": 7,
        "author": "762_39King",
        "created_utc": 1698227448.0,
        "created_readable_utc": "2023-10-25 09:50:48 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/17g14fw/coming_to_america/",
        "permalink": "https://reddit.com/r/immigration/comments/17g14fw/coming_to_america/",
        "selftext": "Hi, I United States citizen filing for my wife who is outside of the country.She has never been here as well, what is the process of coming into the country from the moment she gets off of the plane into America?\n\nIr1 spouse visa \n\nShe will also have our son, but he already has his American passport and crba from birth. When the time comes I will go to their country and get them.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "175sc1k",
        "title": "What does a consular interview actually look like? Please help a nervous person.",
        "score": 0,
        "num_comments": 4,
        "author": "Plenty_Noise2654",
        "created_utc": 1697067133.0,
        "created_readable_utc": "2023-10-11 23:32:13 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/175sc1k/what_does_a_consular_interview_actually_look_like/",
        "permalink": "https://reddit.com/r/immigration/comments/175sc1k/what_does_a_consular_interview_actually_look_like/",
        "selftext": "I am really nervous, so help me out. So my question pertains to interview in two different types of cases.\n\n1. A marriage based green card case.\n2. A CRBA interview.\n\nFor the first one, we'd of course need all the documents. But how does the actually interview go. Like do they make you stand? Do they make you sit? Do they actually read any of the papers and documents? Or do they just look at everything before hand when upload it? How long does it take?\n\nFor the second one, same questions: do they make you sit or stand? What if you have screaming, crying infant? What if breastfeeding is the only way to make the baby shut up? How long does it take? Or what if the baby is asleep and you can't open his eyes to see his eye color? Also, I am a bit embarrassed because my high school transcripts shows I got a B in Calculus in high school.  Do they look at the papers in detail? Do we hand them the papers only when they ask for it or do we just give them the entire package all at once?\n\nI am the US citizen and I've never been to an Embassy or Consulate in my life. The main reason I am writing this post is because I am very, very nervous. For some reason, consular people make me nervous. And when I am nervous I tend to crack really bad jokes. For example, why do people in Europe like to pee? Because they are Euro-pean.\n\nI don't why but my wife (the foreign citizen) isn't scared. She thinks I am too tired from taking care of the baby.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "1701syz",
        "title": "Proving my younger brother's citizenship",
        "score": 4,
        "num_comments": 6,
        "author": "Professional_Ebb7163",
        "created_utc": 1696460959.0,
        "created_readable_utc": "2023-10-04 23:09:19 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1701syz/proving_my_younger_brothers_citizenship/",
        "permalink": "https://reddit.com/r/immigration/comments/1701syz/proving_my_younger_brothers_citizenship/",
        "selftext": "Me and my younger brother are US citizens by birth. I am 21 and he is 16. After my mom's death when I was 17, we were sent to live with our dad. My dad kicked my brother out because he is gay. Thankfully, we live in a pretty liberal country and a court has found I am best positioned to take custody of my brother. I have been appointed foster guardian because I have a decent job. The problem I am running into is proving his citizenship. He certainly had a US passport, but I don't have it. To get my dad to surrender my brother's passport is a nightmare. It would require another court case and it is just to emotionally taxing to deal with my homophobic father.\n\nI am looking at this: https://travel.state.gov/content/travel/en/passports/have-passport/passport-records.html \n\nIt seems a promising avenue. \n\nSo a few questions are:\n\n1. Can I apply for my brother's passport records with a foreign court order appointing me guardian? \n2. What sort of documents are included in a request for passport records? Does it contain the original DS-11 and a copy of the supporting documents such as CRBA? \n3. If the passport records do not contain a CRBA, how do I find out if a CRBA has **ever** been issued for my brother?\n4. Would it help my brother's citizenship case if I were to get my own passport records? I do have my CRBA.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.84,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
  
    {
        "id": "16wtpmn",
        "title": "Can I get my daughter a tourist visa if I’m a U.S. Citizen?",
        "score": 12,
        "num_comments": 37,
        "author": "pulchratulip",
        "created_utc": 1696141807.0,
        "created_readable_utc": "2023-10-01 06:30:07 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/16wtpmn/can_i_get_my_daughter_a_tourist_visa_if_im_a_us/",
        "permalink": "https://reddit.com/r/immigration/comments/16wtpmn/can_i_get_my_daughter_a_tourist_visa_if_im_a_us/",
        "selftext": "My daughter was born abroad. CRBA was denied since I didn’t meet the criteria. If I’m not living in the U.S. currently and have citizenship in the country where she was born, could I apply for a tourist visa for her? Would she most likely get denied since I’m a citizen? \n\nFor more context she’s enrolled in school, I have stable income, and we have traveled as tourists to other places.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.8,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "16vs93c",
        "title": "Help please - CRBA",
        "score": 1,
        "num_comments": 24,
        "author": "Holiday_Way_2070",
        "created_utc": 1696033223.0,
        "created_readable_utc": "2023-09-30 00:20:23 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/16vs93c/help_please_crba/",
        "permalink": "https://reddit.com/r/immigration/comments/16vs93c/help_please_crba/",
        "selftext": "My brother (14y/o) qualifies for CRBA but my father (US citizen) cannot provide any proof of living in the US for 5+ years as he shredded all documents before he left the U.S. 20+ years ago. We have tried contacting irs, electric and gas provider, banks and credit card issuers and they all do not have documents from 20+ years ago. We tried to apply for my brother’s green card but he was denied on the basis that he is considered a U.S. citizen in the eyes of the consulate. Is there any other way?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },

    {
        "id": "16px2kf",
        "title": "Inconsistency between CRBA \"birth certificate\" and what DoS considers birth certificates",
        "score": 1,
        "num_comments": 6,
        "author": "Interesting-Cap-8081",
        "created_utc": 1695450625.0,
        "created_readable_utc": "2023-09-23 06:30:25 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/16px2kf/inconsistency_between_crba_birth_certificate_and/",
        "permalink": "https://reddit.com/r/immigration/comments/16px2kf/inconsistency_between_crba_birth_certificate_and/",
        "selftext": "I am trying to gather documentation for CRBA for our child. According to the checklist for the CRBA on the Embassy website, we need a birth certificate from the local magistrate. But when we look at the civil documents and reciprocity table, it says that a \"birth certificate\" is a certificate we order from the population registry. This seems to be a discrepancy. Any advice besides \"contact the Embassy\"?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "16mkvdz",
        "title": "Birth Certificate Rejected by NVC (again)",
        "score": 4,
        "num_comments": 10,
        "author": "miusabi",
        "created_utc": 1695110151.0,
        "created_readable_utc": "2023-09-19 07:55:51 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/16mkvdz/birth_certificate_rejected_by_nvc_again/",
        "permalink": "https://reddit.com/r/immigration/comments/16mkvdz/birth_certificate_rejected_by_nvc_again/",
        "selftext": "Hi all, thank you for your advice and help with my previous post ([https://www.reddit.com/r/immigration/comments/16cfhrh/birth\\_certificate\\_rejected\\_by\\_nvc/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/immigration/comments/16cfhrh/birth_certificate_rejected_by_nvc/?utm_source=share&utm_medium=web2x&context=3)).\n\nTo summarize,  I'm an American citizen applying for a CR1 visa for my husband, an Egyptian citizen born in the UAE. We previously submitted a CRBA that was issued by the Egyptian consulate, and that was rejected.\n\nWe finally located a copy of my husband's original UAE birth certificate issued by the UAE's Ministry of Health and Prevention, so we submitted it along with an English translation. That has also just been rejected, with the following message:\n\n&#x200B;\n\n>\"Birth, Death, and Divorce documents from Egypt should be issued by the Ministry of Interior Civil Status Organization CSO. The document should be bilingual in both English and Arabic.\"\n\n&#x200B;\n\nNow we're even more confused since the issue in the first place was that the BC needed to be from the UAE. Why are they referring to an Egyptian BC? Should I submit both the Egyptian CRBA and the UAE BC?\n\nThank you!\n\nEdit: To clarify, the Egyptian consulate in the UAE issued a consular document for my husband because he is an Egyptian born abroad in the UAE. I used the term CRBA as that was the closest description I could find for that document, and was unaware that CRBAs are for American citizens.\n\n&#x200B;",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.84,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "16micb0",
        "title": "What sort of evidence does the US Consulate prefer the most for a CRBA?",
        "score": 2,
        "num_comments": 12,
        "author": "Extension_Tennis_872",
        "created_utc": 1695101109.0,
        "created_readable_utc": "2023-09-19 05:25:09 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/16micb0/what_sort_of_evidence_does_the_us_consulate/",
        "permalink": "https://reddit.com/r/immigration/comments/16micb0/what_sort_of_evidence_does_the_us_consulate/",
        "selftext": "I am looking to file my son's CRBA. But it is difficult to do with me being overseas and not having access to my high school transcripts. So I am looking to do this in a practical and cost-effective way. \n\n1. I do a online FOIA for my American entry and exit records work? I was born in late 90s so all of my (theoretical) entry and exit records to Canada/Mexico would still be recorded. I actually have never been in Canada/Mexico.\n\n2. A similar request with the UK government to show the times I was in the UK.\n\n3. Tax transcripts are free, so I can get those and they'd show I was working in the US.\n\n4. A copy of my university transcripts from my workplace. I'm not sure if they'd accept this because my work doesn't have the original stamped and sealed.\n\n5. Vaccination records from my home state which I can get online.\n\n6. My high school senior yearbook.\n\n7. Emails of my flight details to and from the US.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "16cjjji",
        "title": "Applying for CRBA in the US by 7 FAM 1444.3-1",
        "score": 0,
        "num_comments": 4,
        "author": "Previous-Rest1561",
        "created_utc": 1694102372.0,
        "created_readable_utc": "2023-09-07 15:59:32 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/16cjjji/applying_for_crba_in_the_us_by_7_fam_144431/",
        "permalink": "https://reddit.com/r/immigration/comments/16cjjji/applying_for_crba_in_the_us_by_7_fam_144431/",
        "selftext": "I am an American citizen. Son was born during the pandemic and we haven't gotten to filling out the CRBA and getting his US passport because we couldn't find an appointment. Can he come with me across the border? I have his Canadian birth certificate and his Canadian passport, and from the laws it seems he is already an American citizen because I spent high school and college in America.\n\nAlso, can I apply for his CRBA in the US?\n\nAccording to 7 FAM 1444.3-1, it mentions\n\n> Parents may execute an application for a Form FS-240 before a notary public in the United States and transmit the application, together with the supporting evidence needed to establish the citizenship claim and identity and the requisite fees to the U.S. embassy or consulate in whose consular district the child was born;\n\nWill they really accept this?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
  
    {
        "id": "162gbga",
        "title": "Filling out CRBA. Don't know exact dates of place.",
        "score": 0,
        "num_comments": 2,
        "author": "OkRace6460",
        "created_utc": 1693109810.0,
        "created_readable_utc": "2023-08-27 04:16:50 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/162gbga/filling_out_crba_dont_know_exact_dates_of_place/",
        "permalink": "https://reddit.com/r/immigration/comments/162gbga/filling_out_crba_dont_know_exact_dates_of_place/",
        "selftext": "Hi,\n\nI am trying to fill out the CRBA for my child. Over the years, I took a few road trips to San Francisco (lived in San Diego my entire life) both on my own and with parents. How should I put these? I don't remember the dates. Should I just sort of skip over them in the sense that I just include them in the single line of San Diego, CA?\n\nSo basically the breaks between the entries in the DS-2029 will only be when I was abroad.\n\nEDIT: I should add the other parent (my wife) isn't a US citizen.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "15xczza",
        "title": "CRBA DS-5507",
        "score": 2,
        "num_comments": 5,
        "author": "BeginningIntention51",
        "created_utc": 1692636428.0,
        "created_readable_utc": "2023-08-21 16:47:08 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/15xczza/crba_ds5507/",
        "permalink": "https://reddit.com/r/immigration/comments/15xczza/crba_ds5507/",
        "selftext": "I'm looking to fill out the DS-5507 for my child. My girlfriend is a foreign citizen. \n\nI'm confused on how to fill out the form in the part on physical presence and residency and dates.\n\nFor context, I was physically present in the US for overwhelming majority of my life. \n\nHowever, as a kid, every summer I would go to visit my grandparents in another country.\n\nSo was my residency interrupted for those reasons?\n\nSo I have two options\n\n1. Fill out the section where it asks about my physical presence/residency in the US as one line with my parents' US home address, with the dates being from when I was born to when I graduated high school. Then say under column \"Purpose of stay\" as residence. Then I would list the times I was physically pressnt abroad in the next section where it asks for physical presence abroad.\n\n2. Separate the times in the section on physical presence in the US itself. Meaning I would use a new line for each time I came back from visiting my grandparents overseas. So it would be like\n\nPlace                      Date                                    Purpose \n\nSomeplace, USA Birth-june 1995    residency\n\nSomeplace, USA Fall 1995-june 1996    residency\n\nAnd then each individual line in the next section would be info on the specific dates I was visiting my grandparents.\n\nWhich option do I choose?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "15t2t9z",
        "title": "CRBA QUESTION",
        "score": 1,
        "num_comments": 4,
        "author": "kariniush",
        "created_utc": 1692221549.0,
        "created_readable_utc": "2023-08-16 21:32:29 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/15t2t9z/crba_question/",
        "permalink": "https://reddit.com/r/immigration/comments/15t2t9z/crba_question/",
        "selftext": "How hard is it for me to file for the CRBA\nOr should i use a service that does that for me?\n\nAlso what should i bring to the interview?\nPhoto albums? Reciepts? Etc",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "15omxnf",
        "title": "US Embassy Ottawa",
        "score": 0,
        "num_comments": 2,
        "author": "MellaAlpha",
        "created_utc": 1691793068.0,
        "created_readable_utc": "2023-08-11 22:31:08 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/15omxnf/us_embassy_ottawa/",
        "permalink": "https://reddit.com/r/immigration/comments/15omxnf/us_embassy_ottawa/",
        "selftext": "I am an US citizen who just had a baby in July and I completed the CRBA application online but when I went to book an appointment and there are absolutely none available. Is this normal for all the consulates and is there certain times I should check for new openings?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    {
        "id": "15nx003",
        "title": "CRBA Questions: Mexican born baby w/ U.S Citizen Parent, traveling back to the United States",
        "score": 2,
        "num_comments": 30,
        "author": "ChihuahuaNamedTofu",
        "created_utc": 1691723221.0,
        "created_readable_utc": "2023-08-11 03:07:01 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/15nx003/crba_questions_mexican_born_baby_w_us_citizen/",
        "permalink": "https://reddit.com/r/immigration/comments/15nx003/crba_questions_mexican_born_baby_w_us_citizen/",
        "selftext": "\n\nHello everyone! I just gave birth to a sweet baby boy here in CDMX and I live here with my husband who is a Mexican citizen. My Son and I need to go back to the United States mid September. \n\nWe have started the process of getting his passports already: My appointment at the US consulate for his CRBA *(Consular Report of Birth Abroad)* is not until September 5th- I have read that after the appointment I can apply for his US passport which may take 8-12 weeks to receive. I have also requested for my child’s Birth Certificate at the Registro Civil and will need to go through the process of getting his Mexican passport as well but saw that that may take 8 weeks too. \n\nMy question is:\n\nIf I do not receive either passport before mid September will I still be able to travel to the US as long as I present his Mexican certificate of birth (the form I received at the hospital) or his Mexican Birth Certificate? Since I am his mother and am a U.S. citizen? Will they allow us to enter?\n\nHad any one else been through the process of getting a CRBA and child’s passport  in CDMX? How long did it take? Do you have any tips for our appointment so we make sure everything goes smoothly? \n\nIf you did not have either passports, were you able to travel back to the states with your newborn without any passport/ CRBA as long as you can prove you are the parent? We will be entering by land from CDMX to Tijuana via the Cross Border Express and crossing to California. \n\nI also read online that if he has his Mexican passport he can go to the US as long as I present my US Passport. Is this true? If so I am hoping that he gets the Mexican passport soon.\n\nI was able to find this info on help.cbp.gov : \n\n*Children- Travel Documents for infants\nEach American citizen must possess his or her own passport. U.S. and Canadian citizen infants are not required to have a passport for travel by land or sea - although they are required to present a copy of a birth certificate and, if not traveling with both parents, the Department of State suggest a consent letter accompany the other parent(s) due to the rise in instances of child abduction in custody cases, and a growing number of children who are the victims of trafficking.\n\nWhen U.S. citizen children under the age of 16 arrive by land or sea from Canada or Mexico they may present an original or copy of their birth certificate, a Consular Report of Birth Abroad, or a Naturalization Certificate. \n\nIf traveling domestically, a passport is not needed but If you are driving into the United States (U.S.) and have not yet received a birth certificate for a U.S. or Canadian citizen infant, the U.S. Customs and Border Protection (CBP) Officer will accept: the birth record issued by the hospital, a letter on hospital letterhead or a letter from the doctor who delivered the child providing details of the birth, including the name of the child, time and place of birth, and the parent(s) named*\n\nFrom what I understand it says to present a copy of birth certificate, but how soon will I receive his American birth certificate after his CRBA appointment? Or is his Mexican one okay? Or Will I receive a form after my CRBA appointment on Sept 5th that will allow him to travel with me? \n\nAll of this is a lot to navigate with a newborn so any help is much appreciated. Thank you for reading and for any advice",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    }
]