[
    {
        "id": "1k1nq5q",
        "title": "Birth in Mexico",
        "score": 0,
        "num_comments": 3,
        "author": "New_Intention_4234",
        "created_utc": 1744923948.0,
        "created_readable_utc": "2025-04-17 21:05:48 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1k1nq5q/birth_in_mexico/",
        "permalink": "https://reddit.com/r/immigration/comments/1k1nq5q/birth_in_mexico/",
        "selftext": "Has anyone had experience with giving birth in Mexico? Will we be allowed to drive across the border while I’m 8 months pregnant. I know birth tourism is a sensitive topic, but as a lower class family with no college degrees, we have very few options to leave the US. Is there anything else other considerations we should have? Thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
 
    {
        "id": "1k011i9",
        "title": "Immigration help",
        "score": 3,
        "num_comments": 22,
        "author": "MelodicAd6357",
        "created_utc": 1744746047.0,
        "created_readable_utc": "2025-04-15 19:40:47 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1k011i9/immigration_help/",
        "permalink": "https://reddit.com/r/immigration/comments/1k011i9/immigration_help/",
        "selftext": "I, female (27) and my husband(26), are expecting our first child and I am giving birth by the end of November. I am a USA citizen and I am currently living in Mexico with my s/o he and he is in the process of becoming resident. It has been two years since I put in the paperwork and with this new office it is taking longer. I want to have my child in the USA because hospitals are better and I don’t want to go through a long process of making my child a citizen. My question is that if there is any way my husband can get a humanitarian visa so he can attend the birth of my child?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.58,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
 
    {
        "id": "1jzajgk",
        "title": "If i married a immigrant and she has a daughter outside of us can i bring her with me?",
        "score": 4,
        "num_comments": 22,
        "author": "Commercial_Unit_2034",
        "created_utc": 1744666047.0,
        "created_readable_utc": "2025-04-14 21:27:27 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1jzajgk/if_i_married_a_immigrant_and_she_has_a_daughter/",
        "permalink": "https://reddit.com/r/immigration/comments/1jzajgk/if_i_married_a_immigrant_and_she_has_a_daughter/",
        "selftext": "Im about to marry my love after 3 years she has a daughter ive been supporting in mexico were thinking of bringing her too what steps should we take?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.59,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },


  
    {
        "id": "1jkmhwg",
        "title": "Marriage Question",
        "score": 0,
        "num_comments": 2,
        "author": "clist6",
        "created_utc": 1743022651.0,
        "created_readable_utc": "2025-03-26 20:57:31 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1jkmhwg/marriage_question/",
        "permalink": "https://reddit.com/r/immigration/comments/1jkmhwg/marriage_question/",
        "selftext": "Im hoping to get some advice on marrying my partner. We’ve been living together for 4 years in Mexico, we have a daughter that has currently gotten her CRBA thru me. There is a considerable age gap between us. She does not work. I work in the US and have my address there too. I want her to be able to cross. I don’t know if this means getting her visa marrying her. I’m looking for whatever is easiest. Should I marry her at the border? Should I marry her in Mexico? Should i forgo all that and just take out a visa for her? Any advice is greatly appreciated. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   
    
  
    
    {
        "id": "1jedblu",
        "title": "Feel trivial, still asking: Naturalized Citizens, parents of Adopted Naturalized Kids are we traveling??",
        "score": 0,
        "num_comments": 3,
        "author": "Full-Contest-1942",
        "created_utc": 1742325597.0,
        "created_readable_utc": "2025-03-18 19:19:57 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1jedblu/feel_trivial_still_asking_naturalized_citizens/",
        "permalink": "https://reddit.com/r/immigration/comments/1jedblu/feel_trivial_still_asking_naturalized_citizens/",
        "selftext": "\nHearing lots about green card holders getting stopped..even those only traveling domestic.  So, nervous & feeling crazy.\n\n\nW had been planning a trip to Pompeii this year. And South Africa, Costa Rica or Mexico in the next few years. I know there is no looking glass for a few years out. So, I will focus on now.. how are things coming and going from Western Europe? Canada?  DC, New York or Toronto airports?\n\n\nGoing to Pompeii has been in the works for a couple years. So, feel crazy for not moving forward with our plans. Also, feel kinda like it is a big risk. It is a dream & special interest trip for the kids & at their request.\n\nNot sure if flying to other domestic locations would be any safer?? Heard about people getting stopped coming back from Puerto Rico and US Virgin Islands.\n\nWe are adoptive parents & birth citizenship with naturalized black child. We all have passports, global entry, adoption paperwork etc. Minors Birth Country is not currently on any of the travel ban lists. But, also not one T & M probably think very highly either. \n\nWhat creditable news outlets or organizations are you using to stay on top of changes??\n\nSo, are you traveling? Do you have a immigration attorney on retainer? Avoiding certain ports of entry or airports?\n\n\n\n\n  ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
    
  
    {
        "id": "1iwjsip",
        "title": "Child born abroad to US citizen and wife with visa",
        "score": 13,
        "num_comments": 5,
        "author": "Puzzleheaded_Run7442",
        "created_utc": 1740342829.0,
        "created_readable_utc": "2025-02-23 20:33:49 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iwjsip/child_born_abroad_to_us_citizen_and_wife_with_visa/",
        "permalink": "https://reddit.com/r/immigration/comments/1iwjsip/child_born_abroad_to_us_citizen_and_wife_with_visa/",
        "selftext": "Hello, I hope y'all see this and are able to take the time to read and give advice.\n\nI am a US citizen that was living in the US up until I was 9, moved to Mexico, came and went up until I was 25 and I am now currently back in the US working (as of February of this year), in January I was still in Mexico with my wife (that has a visa) and we had our babies (twins) in said country.\n\nWhat should I do if I want to move my family over to the United States, as the jobs I've secured are well paying and we are planning to live in the United States for the foreseeable future.\n\nThanks in advance!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.84,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
 

    {
        "id": "1iry2gh",
        "title": "Moving to MX",
        "score": 1,
        "num_comments": 0,
        "author": "gm2551",
        "created_utc": 1739834325.0,
        "created_readable_utc": "2025-02-17 23:18:45 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iry2gh/moving_to_mx/",
        "permalink": "https://reddit.com/r/immigration/comments/1iry2gh/moving_to_mx/",
        "selftext": "So the familia and yo are moving to mexico. Couple of questions though, any help would be appreciated. \n\nMy wife is mexican and a perm resident of the US. My daughter was born in Mexico and got her US citizenship through me. My other daughter was born in the US and we need to get her mexican citizenship. I am a US Citizen and want to get my Temp. residency in mexico. With all that, we have no idea where to start. We are starting with the easy stuff and getting all passports renewed so we can fly. After that, we have tried calling the Mexican Consulate closest to us which is the one is Washington DC. No answer though. Were going to keep trying obviously but we were wondering, can my daughter and I enter mexico through an airport and get the 6 month tourist visa and them apply for her citizenship and my temp residence while in country? Or is that a no go? Any help would be appreciated, thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   
    {
        "id": "1irioyv",
        "title": "Can I get citizenship",
        "score": 0,
        "num_comments": 5,
        "author": "PrincipleHelpful1186",
        "created_utc": 1739795181.0,
        "created_readable_utc": "2025-02-17 12:26:21 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1irioyv/can_i_get_citizenship/",
        "permalink": "https://reddit.com/r/immigration/comments/1irioyv/can_i_get_citizenship/",
        "selftext": "For co text. My mom is a US citizen, but she never lived in the US, she was taken to Mexico so she doesn’t  have any records of education or anything here. She went to school and vaccines everything  in Mexico. It wasn’t until she divorced my dad in 2012 that she moved to the US and started working and paying taxes, but I was already a teenager. \n\nI did went to a private school here in the us and did my bachelors in the US. But everything under a student visa. Is there anyway to get a permanent status?\nSorry if it sounds confusing.\n\nLawyers say the easiest way is to marry a citizen.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.14,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   
    {
        "id": "1il63fm",
        "title": "Questions about naturalizing minors who were born in Mexico",
        "score": 0,
        "num_comments": 11,
        "author": "Outside_Education933",
        "created_utc": 1739073467.0,
        "created_readable_utc": "2025-02-09 03:57:47 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1il63fm/questions_about_naturalizing_minors_who_were_born/",
        "permalink": "https://reddit.com/r/immigration/comments/1il63fm/questions_about_naturalizing_minors_who_were_born/",
        "selftext": "My cousin, born citizen, spent a few years in Mexico and fathered two children. He then abandoned those children who were 5 and 3 at the time and came back to the US. The children, now 8 and 10, have been abandoned by their mother and are staying with their elderly grandparents who cannot take care of them. Their father recently was released from prison after serving a lengthy sentence for multiple felonies. They want to come with their dad but a lawyer told their father that he could not help them because of his criminal history. Any advice?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.22,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    },
   
  
    {
        "id": "1igb7pr",
        "title": "Weird Complex Immigration Case - Any Help Would be Appreciated",
        "score": 1,
        "num_comments": 6,
        "author": "rooseveltsmustache",
        "created_utc": 1738539585.0,
        "created_readable_utc": "2025-02-02 23:39:45 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1igb7pr/weird_complex_immigration_case_any_help_would_be/",
        "permalink": "https://reddit.com/r/immigration/comments/1igb7pr/weird_complex_immigration_case_any_help_would_be/",
        "selftext": "This is a hypothetical situation. Or maybe its for a friend. Or maybe its for some other stranger on the internet. Or maybe I just like testing the sub's knowledge. I don't know shit about fuck. I prefer ice that melts.\n\nForgive the long post, but here we go:\n\nThe situation involves an elderly person well over 70 yrs old. This person has been in the United States since the 1950's. This person worked and paid taxes their whole lives. When this person applied for Social Security benefits some time ago, it was denied because of immigration status. The person's family was baffled. So the research and investigations began. Consider the following items about the person:\n\n\\- born in Mexico, has a Mexican birth certificate\n\n\\- born to an American citizen mother and Mexican father (no, this is not automatic, the law at the time required proof that the mom lived in the US for a certain amount of time, which she did)\n\n\\- came to the US as a young child\n\n\\- at some point in early adulthood, person filed for naturalization based on his mother's citizenship and US residence \n\n\\- person is now of older age and doesn't remember much from that time\n\n\\- person has a Social Security number issued from Texas in the 1950's\n\n\\- person has been married to an American citizen since the early 1980's\n\n\\- person worked legally (everyone assumes) for decades; even after eVerify became a thing, the person always qualified and was cleared as eligible for work until as recently as 2019\n\n\\- family tried to get info from USCIS, but none of the correspondence actually verifies his status, and they were only told that the prior Naturalization Application form was filled out incorrectly (no mention of eventual denial, acceptance, etc..)\n\n\\- family FOIA-ed a copy of the Naturalization Application, there are some administrative markings on it but nothing that says it was approved or denied\n\n\\- at the time of that application, the person did have an A- number. the person nor the family do not remember the person ever having a green card in recent years and always assumed they were a citizen\n\n\\- family tried to re-file Naturalization Application but it was not accepted (not denied, but kicked back) because the previous one was not filed out correctly\n\n\\- person has multiple other siblings that were in the same situation, some older and some younger, all born to same American mom and Mexican dad, and all of those siblings were naturalized long ago and are citizens\n\n\\- several lawyers have looked into this, and none have ultimately taken the case because of the complexity\n\nHERE'S THE KICKER: not too long ago, the person refiled for Social Security benefits, and was approved! They are getting their monthly check and are enrolled in Medicare. BUT, they can't cash the checks because they don't have a bank account in their name. The person only has an expired state driver's license, which expired around the same time as the discovery of this issue, so they have not been able to get a new ID with the new Real ID requirements.\n\nSo that's a partially happy ending with the SS benefits. But they need an ID and bank account, and the family is still not sure of the person's status. In order to get a Real ID, the DMV requires their Social Security benefits letter AND either their certificate of naturalization or other proof of citizenship.\n\nHERE'S THE ASK: How and where can the family safely verify status without raising any red flags? They are understandably nervous about the current climate, and they also don't want this to have been a mistake and have the benefits snatched back if they still can't prove eligibility.\n\nThe best case here is that the first time they filed, it was denied by mistake, and they have been a citizen all along. The fact that they have been working for forever, and that they always clear through eVerify, and that the SS benefits were eventually approved, probably means that AT LEAST they are a permanent resident (but again, no one remembers, has seen, or has ever had to use a green card for this person).\n\nAny ideas or resources you guys might have would be a world of help. Also referrals to a reputable lawyer that might be up for the challenge would also be amazing. Thanks in advance!\n\nTLDR: Older person doesn't know their status. It's a complex tale but all signs point to likely permanent residence or citizenship. Family needs help safely verifying without raising red flags.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null
    }
    
   
]