[
    
    {
        "id": "1jzay4w",
        "title": "Denied Passport at Post Office — Derivative Citizenship Confusion, Need Help",
        "score": 0,
        "num_comments": 6,
        "author": "BrokeKartel",
        "created_utc": 1744667127.0,
        "created_readable_utc": "2025-04-14 21:45:27 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jzay4w/denied_passport_at_post_office_derivative/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jzay4w/denied_passport_at_post_office_derivative/",
        "selftext": "I was brought to the U.S. as a child and have been a lawful permanent resident since 1993. My father became a U.S. citizen before I turned 18, and I was living with him at the time. Based on what I’ve read about **derivative citizenship under INA §320**, I should already be a U.S. citizen.\n\nI went to the post office recently to apply for a U.S. passport, but they told me I needed a **Certificate of Citizenship (N-600)** or naturalization certificate to prove my citizenship. I explained that I derived citizenship through my dad when I was a minor, but they said they couldn't process my application without official proof from USCIS. She looked at me and was like you were supposed to do this back then. Not now. I figured the post office would not be helpful in this matter. I then called the passport agency but they are telling me I need to provide an itinerary that I am going somewhere internationally before I get an appointment and also made mention of me needing my parents wedding certificate which I cant get. They were married in Mexico back in 83. \n\nI have the following 1. Dads naturalization certificate 2. 4 notarized affidavits that I was living with him one being from him. 3. my expired resident alien card at that time 4. my birth certificate 5. current state ID 6. The passport application itself. \n\n\n\n* Should I just go ahead and file Form **N-600** with USCIS?\n* Has anyone else successfully gotten a passport approved **without** the N-600 (maybe through affidavits or with the right documents)?\n* Is it worth hiring a lawyer for this, or can I handle it myself if I have the documents?\n\nAny insight or shared experiences would be really appreciated. I just want to get this resolved the right way.\n\nThanks in advance 🙏🏼",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
   
    {
        "id": "1jwnmut",
        "title": "Wife is 8 weeks pregnant. How soon do we file for CRBA? (Mexico)",
        "score": 0,
        "num_comments": 2,
        "author": "8647742135",
        "created_utc": 1744371193.0,
        "created_readable_utc": "2025-04-11 11:33:13 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jwnmut/wife_is_8_weeks_pregnant_how_soon_do_we_file_for/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jwnmut/wife_is_8_weeks_pregnant_how_soon_do_we_file_for/",
        "selftext": "FS-240 right? We are in Tijuana ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "NVC/DOS Support"
    },
    
    
   
    {
        "id": "1js5ylv",
        "title": "Bit of an unusual situation, advice requested",
        "score": 1,
        "num_comments": 12,
        "author": "ZakuZaku85",
        "created_utc": 1743866832.0,
        "created_readable_utc": "2025-04-05 15:27:12 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1js5ylv/bit_of_an_unusual_situation_advice_requested/",
        "permalink": "https://reddit.com/r/USCIS/comments/1js5ylv/bit_of_an_unusual_situation_advice_requested/",
        "selftext": "I am a US citizen living in Mexico with my Mexican wife and her 3 kids (2 are dual citizenship, one is not). \n\nWe have been together for 6 years, living together for 5, and married for one year. She is a housewife that takes care of the kids and house, I used to work in family law, and we live off an annuity that I have.\n\nOur lives are in Mexico, and we have a great quality of life. However, my mom has ALS and we all want to go spend time with her/help her and my dad. We have no desire to reside in the US, but I've read that because she is married to me, she has no chance of a tourist visa. It seems our only option is LPR. We could use my parents residence, but as I said, we don't intend to live in the US. We want access to the US for family functions (and I really want to take my stepkids to Disneyland)\n\nDo we have any option besides knowingly gaining LPR status with no intention to reside in the US?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
 
    {
        "id": "1job3yt",
        "title": "Migration",
        "score": 1,
        "num_comments": 2,
        "author": "IllAdvantage7993",
        "created_utc": 1743447674.0,
        "created_readable_utc": "2025-03-31 19:01:14 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1job3yt/migration/",
        "permalink": "https://reddit.com/r/USCIS/comments/1job3yt/migration/",
        "selftext": "Hello, I have a question. I am currently married to my husband, and I filed an I-130 application. Although he is not the biological father of my son, he raised him briefly before he turned one year old. He is currently 7 now.  He had always wanted to adopt him as his son, but he is from Mexico and can't travel to the USA. How could this process be made? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    
    {
        "id": "1jladrc",
        "title": "US/MEX citizen marrying mexican gf while living in Mexico - how to proceed.",
        "score": 0,
        "num_comments": 8,
        "author": "eeedddggg",
        "created_utc": 1743098789.0,
        "created_readable_utc": "2025-03-27 18:06:29 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jladrc/usmex_citizen_marrying_mexican_gf_while_living_in/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jladrc/usmex_citizen_marrying_mexican_gf_while_living_in/",
        "selftext": "Hello all, I'm requesting your support to get recommendations on the best and fastest way to proceed. Here's my situation. \n\nI'm a dual Mexican/American working in Mexico for an American company under their Mexican division and I will be marrying my gf soon, we are already engaged. \nWe would like to move to the US in approximately 2 years and are wondering what's our best way to proceed, \nI've discussed this plan  with my management in the American branch and they're willing to directly hire me ( I'll have to quit the Mexican branch and apply directly to the American branch) \n\n\n* My gf holds a US tourist visa and visits the US  regularly for work (she also works for the same company) \n* I have Global Entry and travel regularly between Canada, USA and Mexico \n* I hold USA address (from a family member) and have USA bank accounts/ Investments\n* I file taxes in both USA and Mexico \n\nThanks! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    
    {
        "id": "1jjouf4",
        "title": "New Citizen: US Passport Application N400 Question",
        "score": 1,
        "num_comments": 6,
        "author": "Limp-Piano9300",
        "created_utc": 1742923404.0,
        "created_readable_utc": "2025-03-25 17:23:24 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jjouf4/new_citizen_us_passport_application_n400_question/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jjouf4/new_citizen_us_passport_application_n400_question/",
        "selftext": "I became a citizen on 3/20, received my naturalization certificate, etc.  At the ceremony they mentioned that if we apply for a passport within 30 days we would not need to mail in our naturalization certificate, however everything I read online seems to imply that you DO need to mail it in.\n\nDoes anyone know the validity of this?  I have an appointment at the passport office this Thursday 3/27.\n\nAlso, I live in Michigan and will have to convert my Enhanced Drivers License to a REAL ID which counts as proof of citizenship for trips to Canada, Mexico, Caribbean, Virgin Islands etc.. would it still be advisable to get a \"passport card\" or is this the same thing?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    },
      
    {
        "id": "1jc466r",
        "title": "Immigration Advice",
        "score": 1,
        "num_comments": 2,
        "author": "AioliAdvanced1111",
        "created_utc": 1742069994.0,
        "created_readable_utc": "2025-03-15 20:19:54 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1jc466r/immigration_advice/",
        "permalink": "https://reddit.com/r/USCIS/comments/1jc466r/immigration_advice/",
        "selftext": "Hello, everyone, I have debated posting about my situation on Reddit. Still, this will be the right place to get some advice as well as some encouragement. Here is a little background about myself: I was born in Guadalajara, Mexico, in 2002 and then brought to the US three times. All three entries have been legal through business/tourist visas & dependent visas (the first entry being in 2006 - 4 years old, the second entry in 2007 - 5 years old, and the final entry in 2013 - 11 years old.) Due to my parents' uncertainty about where to settle, we have been coming out of the country until 2013, which is my latest entry, and we have been in the US since then. I have been struggling to live a \"normal\" life due to my inability to fix my status. I graduated high school in my hometown, where I lived most of my life.\n\nI will be graduating soon with a BBA in finance and applied economics. I also managed to land an internship for a reputable firm in commercial real estate with no pay. I now have a job offer upon graduation. I have also had my ITIN since 2021 and have money invested into the US stock market under a Roth IRA. I have talked with two attorneys on my own. My family has, too, making it a total of 4-5 attorneys we have contacted. We received the same information from the attorneys. There is no current law I can apply to fix my status since the timeline does not apply for DACA due to not being continuously living in the US. The other options are through marriage or a work visa. However, I am unaware of which one to pursue. I have been putting marriage off since I want to marry for love and genuine connection rather than a number. I do not know if the work pathway is a viable approach either, taking current policy changes and increasing business expenses. I currently have a girlfriend who is a US citizen that I have been dating for one year and six months but have known for two years and one month. I firmly believe she is the one as she supports me and understands me without judgment, and our connectivity is great. I am thinking of pulling the trigger on one of these options as I approach graduation in May as I need to grow my career for my future and that of my future family and really start my life and can't really keep waiting for a \"policy miracle\" I also do not have the financial support to continue education to stretch the timeline past this administration in hope for a better chance. Any advice and perspectives from what you would do in my shoes will be greatly appreciated. Thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },
   
    {
        "id": "1j48evt",
        "title": "Would it help or hurt our case to open a joint bank account despite the fact we both live in Mexico?",
        "score": 1,
        "num_comments": 11,
        "author": "TeachMeWhatYouKnow",
        "created_utc": 1741195450.0,
        "created_readable_utc": "2025-03-05 17:24:10 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1j48evt/would_it_help_or_hurt_our_case_to_open_a_joint/",
        "permalink": "https://reddit.com/r/USCIS/comments/1j48evt/would_it_help_or_hurt_our_case_to_open_a_joint/",
        "selftext": "We are trying to get as much evidence as possible in the likely case we get an interview. One of the pieces of evidence I have heard would help is if my wife and I open a joint bank account together. \n\nI am a US citizen, she is a Mexican citizen, we have already submitted our case for a marriage based green card. I know that in the likely case that we are called in for an interview, we will be expected to have evidence additional to what we have already submitted. \n\nI have heard it is possible for a non-resident of the US to open a bank account, and in order to do this, proof of US address must be provided in the form of a document that shows both her name and the address to ensure she is associated with the property. That could include a letter with the name and address. \n\nWe are going to be living with my parents when she gets her green card, so I’m thinking we could use their address for the joint bank account, and have some sort of letter sent to my parent’s house addressed to my wife. \n\nI don’t know if this would work, but what is more important than if it would work, is if it would even help. Given that she has never even been to the US, never visited my parents home, I’m concerned that USCIS might see this and think we are being deceitful in opening a bank account together based in the US. \n\nBut I also want to get every scrap of evidence possible, which is why I am considering this one so much. So if anyone has any insight or experience on this, I would really appreciate your feedback. Thanks.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.99,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
    {
        "id": "1j3jhyx",
        "title": "What is the best option for us to marry and obtain green card/work permission? From Mexico with tourist visa to U.S.",
        "score": 0,
        "num_comments": 5,
        "author": "ayopassthat",
        "created_utc": 1741117221.0,
        "created_readable_utc": "2025-03-04 19:40:21 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1j3jhyx/what_is_the_best_option_for_us_to_marry_and/",
        "permalink": "https://reddit.com/r/USCIS/comments/1j3jhyx/what_is_the_best_option_for_us_to_marry_and/",
        "selftext": "I am from the U.S. (Long Island, NY) and my girlfriend is from Mexico (Leon, GTO). She currently lives in Mexico and I live in the U.S. She has a valid B-2 tourist visa is planning to move in with me in the U.S. in about a year. We are planning to marry and I am looking for the best way for us to get her a green card and work permission here in the U.S. We are a flexible on where and when we get married, we are just looking for the fastest/most efficient way to get her a green card and work permission considering our specific circumstances. The most important thing for her is that if she comes to the U.S. and begins the process, she has the option to go back to Mexico (for a short period in case of a family emergency, etc.) while the USCIS is processing her papers. The one snag I have as as the petitioner is that I have not filed taxes for the past 2-3 years. As far as the government is concerned, I have not made any income for the past 2-3 years. I was told that a family member of mine that makes a sufficient salary can fulfill this requirement with additional paperwork.\n\n \n\nWhat do you think is the best option for us? Getting married in Mexico and filing for Consular Processing seems like an attractive option because she would be a legal permanent resident and have work permission when she enters the U.S. However, I don’t know how long it would take and if it takes a lot more than a year it would put additional stress on our long-distance relationship. It is possible I am misunderstanding how Consular Processing works. One lawyer told me the way he does most cases is to have the person enter using their tourist visa, wait the 90 days, get married, then file for adjustment of status. Is this a violation of her tourist visa? I am assuming this process the lawyer is using I-130?, I-485?, I-131?, and/or I-765?. Is this our best option? He said it is not recommended to leave the country while they are processing but that it could be done.\n\n \n\nI think my question is relatively simple but after a few hours of reading through the requirements/limitations of each possible route, I still don’t have much clarity on which suits us best for our circumstances. Any insight is greatly appreciated. We may consult further with a lawyer for \\~$300 but we would prefer to save the $3500 lawyer fees of filing and file the papers ourselves unless it is not recommended.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (Family/Adjustment of status)"
    },
    
    {
        "id": "1ixnrat",
        "title": "Filing K1 both of us live in Mexico",
        "score": 2,
        "num_comments": 4,
        "author": "KillerKong6",
        "created_utc": 1740461785.0,
        "created_readable_utc": "2025-02-25 05:36:25 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ixnrat/filing_k1_both_of_us_live_in_mexico/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ixnrat/filing_k1_both_of_us_live_in_mexico/",
        "selftext": "Like the title says my fiancé and I are thinking of filing a petition for a K1 visa but we both currently live in Mexico and we would like to know if she needs to move to the us in order to file the petition and since we both live and work in Mexico we would like to know if one of her family members can file form I-134 on her behalf or if she needs to be working in the us in order to file it ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-129F (K1)"
    },
    
    {
        "id": "1iwjku2",
        "title": "Child born abroad to US citizen and wife with visa",
        "score": 1,
        "num_comments": 4,
        "author": "Puzzleheaded_Run7442",
        "created_utc": 1740342284.0,
        "created_readable_utc": "2025-02-23 20:24:44 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1iwjku2/child_born_abroad_to_us_citizen_and_wife_with_visa/",
        "permalink": "https://reddit.com/r/USCIS/comments/1iwjku2/child_born_abroad_to_us_citizen_and_wife_with_visa/",
        "selftext": "Hello, I hope y'all see this and are able to take the time to read and give advice.\n\nI am a US citizen that was living in the US up until I was 9, moved to Mexico, came and went up until I was 25 and I am now currently back in the US working (as of February of this year), in January I was still in Mexico with my wife (that has a visa) and we had our babies (twins) in said country.\n\nWhat should I do if I want to move my family over to the United States, as the jobs I've secured are well paying and we are planning to live in the United States for the foreseeable future.\n\nThanks in advance!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
    {
        "id": "1iwefyb",
        "title": "Different Citizenship or Visa Options?",
        "score": 2,
        "num_comments": 11,
        "author": "Present-Garage-4263",
        "created_utc": 1740329344.0,
        "created_readable_utc": "2025-02-23 16:49:04 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1iwefyb/different_citizenship_or_visa_options/",
        "permalink": "https://reddit.com/r/USCIS/comments/1iwefyb/different_citizenship_or_visa_options/",
        "selftext": "My friend entered the country illegally when she was 12 year old. She grew up with her dad after her parents were divorced which prompted her mom to send her here. Parents never bothered to get her papers but her dad did become a citizen through marriage after she graduated. Her mom and brother (moved to the US later were deported shortly after she graduated and she has been scared to apply for anything or tip off the government that she's here ever since. She's only gotten some traffic tickets but other than that lives a very lowkey life. She did qualify under DACA at one point but missed the chance to apply and they are no longer accepting new applicants.\n\nWith things being the way they are, I'm worried she might be as well if she doesn't apply for a green card or visa. I know next to nothing about the processes but what are some options she has to stay here legally? We are in a very conservative part of Texas idk if that matters. If she has to apply from Mexico, will she be able to get back in? I read in an article that for certain visas you have to apply from your home country.\n\nThank you in advance!!\n\nETA: I am obviously not going to rely solely on internet strangers, but it's been very overwhelming to find a starting point on our own. We just want a starting place and some options before we start spending thousands or more on lawyers. I also don't want to get my leg pulled by going to a lawyer without any background info. Thank you!\n\n  \nEdit 2: With the help of some comments and research from there, the best option is an i601A and going from there. It's a long road ahead for anyone wondering the same thing we were and basically if you don't marry a citizen, it will be decades or longer :( Her father is a citizen (not natural born) so we're hoping that helps. Wish us luck! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-485 (General)"
    },
    
    {
        "id": "1ith3fp",
        "title": "Case Opened",
        "score": 1,
        "num_comments": 3,
        "author": "HolidayWestern1749",
        "created_utc": 1740000370.0,
        "created_readable_utc": "2025-02-19 21:26:10 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ith3fp/case_opened/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ith3fp/case_opened/",
        "selftext": "US Citizen here, born and raised in NC. My wife and I have been married for 4 years in March. She is from Mexico, right across the border from McAllen, TX (Reynosa, MX). We applied for change of status in January which the case was received and opened February 7, 2025. We have 2 children together, ages 32 months and 5 months. Her 2 children from Mexico, ages 17 and 15 are residing with us and are actively enrolled in school with the oldest graduating in June and wants to enlist in the USMC. We have our names together on lease and on electric bills, however could not get joint bank accounts due to her not having a SS# or TIN#. Just checking in on thoughts related to our case and if anyone else has similar circumstances. Any insights would be greatly appreciated!  Our field office is Norfolk. Thanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Timeline Request"
    },
   
    {
        "id": "1is4n6k",
        "title": "Petition for my children",
        "score": 2,
        "num_comments": 20,
        "author": "Itsjuliatoledo",
        "created_utc": 1739853905.0,
        "created_readable_utc": "2025-02-18 04:45:05 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1is4n6k/petition_for_my_children/",
        "permalink": "https://reddit.com/r/USCIS/comments/1is4n6k/petition_for_my_children/",
        "selftext": "Hi! I hope someone can help me, I’m an american citizen and my children were born and live in Mexico. I just come to US for small time periods where I work but my stay is temporary since I have to go back to Mexico with my kids. I would like to turn my children either into citizens or permanent residents. How can I do that?\n\nI would appreciate if someone could help me. Thanks!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 & I-485 (Family/Adjustment of status)"
    },
    
    {
        "id": "1imhufm",
        "title": "Ina 321 a 3 US Citizenship through American Born Mother and in her custody",
        "score": 1,
        "num_comments": 1,
        "author": "Future-Mention-7041",
        "created_utc": 1739223422.0,
        "created_readable_utc": "2025-02-10 21:37:02 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1imhufm/ina_321_a_3_us_citizenship_through_american_born/",
        "permalink": "https://reddit.com/r/USCIS/comments/1imhufm/ina_321_a_3_us_citizenship_through_american_born/",
        "selftext": "Hi, I’m new here. Question: how can I get someone to help me fight my US Citizenship? I’m 47 yrs old mother was born in USA. I was born in Mexico. Mother was 16 years old at the time and married to my alien father who received permanent residence two weeks after my birth and I received my lpr two months after my birth and crossed through port of entry San Ysidro CA. Parents divorced when I was 4 yrs old and in American born mothers custody with visitation rights to father. Do I qualify for INA 321 (a) (3) ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    
   
    {
        "id": "1iiipxm",
        "title": "Confused on new immigration policy",
        "score": 0,
        "num_comments": 11,
        "author": "yungoctober",
        "created_utc": 1738784330.0,
        "created_readable_utc": "2025-02-05 19:38:50 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1iiipxm/confused_on_new_immigration_policy/",
        "permalink": "https://reddit.com/r/USCIS/comments/1iiipxm/confused_on_new_immigration_policy/",
        "selftext": "So, my wife is Mexican. However, she was born in the US, but her parents weren’t legal at the time, and still aren’t now. They live in Mexico, and she lives here. With the new policy, is her citizenship at risk?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Self Post"
    },
  
    {
        "id": "1ifk92m",
        "title": "A couple of questions about citizenship through adoption",
        "score": 1,
        "num_comments": 5,
        "author": "liberty340",
        "created_utc": 1738454655.0,
        "created_readable_utc": "2025-02-02 00:04:15 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1ifk92m/a_couple_of_questions_about_citizenship_through/",
        "permalink": "https://reddit.com/r/USCIS/comments/1ifk92m/a_couple_of_questions_about_citizenship_through/",
        "selftext": "My wife and daughter are in Mexico and currently going through the I-130 process; we're waiting for our interview letter.  Who knows when it'll arrive, but that's another post.\nIf I adopt our daughter (she's from my wife's first marriage, but for all intents and purposes she's my daughter), how long will she need to live in the US?  Will she have to renounce her Mexican citizenship to have my US citizenship transferred to her?  \nAll of this is currently far-fetched due to the current administration, but I'm just planning for the future",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Other Forms"
    },
  
    {
        "id": "1if1eq5",
        "title": "Girlfriend worried (Mexican citizen) that she won’t be able to come to America after marriage.",
        "score": 1,
        "num_comments": 7,
        "author": "Gainz4thenight",
        "created_utc": 1738395913.0,
        "created_readable_utc": "2025-02-01 07:45:13 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1if1eq5/girlfriend_worried_mexican_citizen_that_she_wont/",
        "permalink": "https://reddit.com/r/USCIS/comments/1if1eq5/girlfriend_worried_mexican_citizen_that_she_wont/",
        "selftext": "My girlfriend of over 2 years is worried that once we marry she will not be able to come to America. We’re planning out our wedding right now, but with families in different countries it’s not the easiest. So we’re figuring out logistics in that sense. At the end of it all I know our wedding will be held in Mexico. She is greatly worried about Donald trump making it more difficult for her. I am trying to ease her worry that this is not the case. Yes, I know there are many people that are vulnerable, but I do not believe our situation is within this concern. She has never been to the United States (therefor never abused/ violated immigration laws). I’ve spoken to an immigration lawyer and she says my gf will conduct her process in Mexico at a U.S. embassy. Which is fine since she lives basically in Mexico City (Ecatepec). We have been dating over 2 years, have receipts of me traveling to Mexico every month for one week. Pictures, the lot. So the proof of our relationship is there. I think once we get close to having wedding plans set then we should get a joint bank account to the very least. (Which I’m not sure if it would be possible for her and me in the US or her and me in Mexico for best results). She currently works for the Mexican government and is in charge of billings of all federal buildings for the entirety of Mexico. She has no criminal record, no tattoos, nothing that would insinuate “criminal”.  She does have some family that was involved with a cartel, but the uncle was murdered when she was young, and the son of the uncle is basically rejected from her immediate family. And the cousin is already barred from entering America. So her immediate family has no ties or relation to any crime syndicates. Her bank account isn’t necessarily large due to the fact that the Mexican government pays her around 600$ per month. (I’m not sure if her finance is considered). But she has no bills since she lives with her family. Once we marry I will submit the marriage certificate in the US as well as Mexico. All the usual denials with spousal GC don’t seem to apply to her at all. I understand people are worried now and exclaim their deportation worries, but it seems lots of people leave out crucial information to create more worry to others, and or they exclaim very legal reasons as to why they would either deal with deportation or denial.\n\nIf there is any other information that may be pertinent I can provide it. But from the brief conversation with the immigration lawyer and information on government websites it doesn’t seem as if she should have a genuine worry. She’s never done anything to put herself in the basket of people that should worry. If I am wrong then tell me. I don’t seek political bias info and I don’t care what your political affiliation is. I just simply want to know based on this situation if she has a genuine worry. I’m seeking to calm her down, not speak to her about politics that don’t involve our own situation. \n\nThanks.  \n\nEdit: regarding schooling she has a bachelors from an accredited university in Mexico City. It slightly confuses me due to the difference of college in the US and Mexico. She graduated and walked, but she says she must complete her thesis to gain her “title”. So she is finished with classes, walked on stage, but needs to complete her thesis. I am not positive if this means that she has an American equivalent of a bachelors already, or if this comes after her thesis is submitted. I myself am currently still in college (4 classes left before I graduate). \n\nAs well, I currently work part time so the sponsorship is quite vague at the moment. My previous job the income amount greatly exceeded the requirement, but I changed jobs. So depending on the timeline I’m not positive if my dad would be considered the sponsor (150,000+ per year) or if I should take a break from school and increase my hours for one year to meet the requirements for sponsorship. I do make majority of my money trading within the stock market which allows me to work part time and travel to Mexico every month for a week each month. I’m not positive as to whether financial investments are included in the sponsorship requirement due the to fact that it’s not a consistent number, unlike a w-2. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-130 (Family/Consular processing)"
    },
 
    {
        "id": "1iaz269",
        "title": "Please need help",
        "score": 1,
        "num_comments": 32,
        "author": "Dox666999",
        "created_utc": 1737949921.0,
        "created_readable_utc": "2025-01-27 03:52:01 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1iaz269/please_need_help/",
        "permalink": "https://reddit.com/r/USCIS/comments/1iaz269/please_need_help/",
        "selftext": "Hey everyone, I’m in a bit of a pickle and could really use some help. I’m from Mexico and married to a US citizen. I’m wondering what the steps are to get a legal status in the US. I’ve been living here in the USA since I was 3 years old, and I have a daughter with my wife. We’ve been married for 9 years now.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "I-485 (General)"
    },
   
    {
        "id": "1i67kx1",
        "title": "Lost passport/ proof of citizen",
        "score": 1,
        "num_comments": 14,
        "author": "Ok-Pitch8237",
        "created_utc": 1737424483.0,
        "created_readable_utc": "2025-01-21 01:54:43 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i67kx1/lost_passport_proof_of_citizen/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i67kx1/lost_passport_proof_of_citizen/",
        "selftext": "Hi everyone, \nAlmost 2 years ago I lost my passport in Mexico. I became a citizen through my mom when I was eight years old and I’m 27 now. I applied for N-565 because we realize we also lost my certificate of citizenship, and I need that for my passport.They denied my N-565. Do you guys have any advice on what I should do?  I am very stressed ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 1.0,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "N-600 (Citizenship)"
    },
    
    {
        "id": "1i2ihqs",
        "title": "How to get U.S passport through born citizen parent?",
        "score": 0,
        "num_comments": 12,
        "author": "Rezlyyy",
        "created_utc": 1737007545.0,
        "created_readable_utc": "2025-01-16 06:05:45 UTC",
        "url": "https://www.reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "permalink": "https://reddit.com/r/USCIS/comments/1i2ihqs/how_to_get_us_passport_through_born_citizen_parent/",
        "selftext": "Brief summary, I am almost 24, I was born in Mexico in 2001, to a born U.S citizen father and a Mexican mother who were not married at the time, married couple years later, and I did NOT get a Consular Report of Birth Abroad (CRBA).\n\nMy dad was born in the U.S but stayed in Mexico until he was about 25 ish, then they married and he got my mom and I green cards and we moved to the U.S, I was 7 at the time. I’ve been living here ever since. \n\nThey ended up separating when I was around 12, but did NOT divorce, they are still technically married.\n\nSome immigration services recommend naturalization, some people I’ve talked to recommend getting a passport as I should have the right to get citizenship through my dad. \n\nWhat documents would I need to get a U.S passport through my dad? \n\n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": "Passport Support"
    }
  
]