[
    {
           "id": "14jt1fc",
           "title": "Mexican Interview Tourist Visa Denied",
           "score": 0,
           "num_comments": 8,
           "author": "Emiliano20_02",
           "created_utc": 1687813026.0,
           "created_readable_utc": "2023-06-26 20:57:06 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/14jt1fc/mexican_interview_tourist_visa_denied/",
           "permalink": "https://reddit.com/r/immigration/comments/14jt1fc/mexican_interview_tourist_visa_denied/",
           "selftext": "Hey everyone, I just had a question or maybe a few questions about getting denied a tourist Mexican visa. \n\nRecently, a family member and her daughter who is 13 in Mexico recently she had her interview. Unfortunately it was denied.\n\nThe letter states that she can reapply, but she needs stronger ties, involving: professional work, school, family, or social links. She mentioned she has a food stand and she has family in the states. Given what is in the letter it wasn’t enough and I am wondering what is something she can do to strengthen her ties. \n\nI feel like it’s pretty obvious that some type of work or school would help. But I’m just not sure, how she could integrate herself in those fields. She didn’t receive a proper education which I feel limits most of those areas. I’m trying to brainstorm, but all that comes to mind are possible solutions but almost immediately my brain suggests why such idea wouldn’t be enough. \n\nShe doesn’t have any plans to work in the country. It is for a genuine tourist visa . From what I’ve heard a lot of people have abused this process to eventually stay in the country. \n\nI was thinking that maybe she’d like to come to my graduation next year in June or she’d love to see her family who she hasn’t seen in years but, I feel those aren’t solutions to our problem. \n\nAny suggestions would be a major help as we’d like to implement some type of solution as soon as possible and give proof that she is trying. I was wondering if anybody here has experienced something similar or what their family member, friend, or just someone you know. And what they did to become successful during the interview.\n\nThanks in advance!",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.17,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": null
           },
           "sex": null,
           "document": "Tourist Visa / B2"
       },
       {
           "id": "14d0iyw",
           "title": "Helping my brother with VISA?",
           "score": 0,
           "num_comments": 4,
           "author": "Gold-Jacket8897",
           "created_utc": 1687136985.0,
           "created_readable_utc": "2023-06-19 01:09:45 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/14d0iyw/helping_my_brother_with_visa/",
           "permalink": "https://reddit.com/r/immigration/comments/14d0iyw/helping_my_brother_with_visa/",
           "selftext": "So I am citizen of the U.S. I was born in Mexico but I got my Consular Report of Birth Abroad. My half brother lives in Mexico and wants to get a Visitors Visa. Can I as a citizen help with like a recommendation or letter?\nI’m over the age of 18 and have a clean legal record. I have contacted my local immigration office but they are charging just for a consult so if I can avoid that fee that would be nice.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.5,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": null,
           "document": "Visitor Visa / B2"
       },
       {
           "id": "141w2iu",
           "title": "Back to the States?",
           "score": 0,
           "num_comments": 3,
           "author": "Calm-Firefighter9574",
           "created_utc": 1686007906.0,
           "created_readable_utc": "2023-06-05 23:31:46 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/141w2iu/back_to_the_states/",
           "permalink": "https://reddit.com/r/immigration/comments/141w2iu/back_to_the_states/",
           "selftext": "From California. Going to be turning in my birth certificates for a passport next week. My family is planning a trip to San Felipe Mexico for Father's Day weekend ;was wondering if I am able to photocopy my sons birth certificate before I turn it in and if that wouldn't cause any issues on the way back from the trip back from San Felipe?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.33,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": "California"
           },
           "sex": null,
           "document": "Birth Certificate / Passport"
       },
       {
           "id": "13ua1a0",
           "title": "Ciudad Juarez / Spouse Visa / DS-5535",
           "score": 5,
           "num_comments": 66,
           "author": "Ok_Software2677",
           "created_utc": 1685305109.0,
           "created_readable_utc": "2023-05-28 20:18:29 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/13ua1a0/ciudad_juarez_spouse_visa_ds5535/",
           "permalink": "https://reddit.com/r/immigration/comments/13ua1a0/ciudad_juarez_spouse_visa_ds5535/",
           "selftext": "Hi everyone, so this was an extremely sad week this week for my wife and I. My wife has lived in the United States now for 28 years. She came into the US with her mom when she was 16 and her mom never took take of her papers, only her own. My wife and I married in 2017 and decided to get this out of the way beginning in 2018. It was June 2022 we were documentarily completed, petition and waiver of unlawful entry all approved. We received the interview appointment in March 2023 and began preparing for everything. All documents, evidence, everything was nicely organized and a nice handheld organizer and labeled to be a professional as possible. We ever got her police report even though it was technically not required. There was nothing that was not ready for the interview day. Here we are on Thursday 5/25 and my wife emerges from the consulate about to burst into tears. She was refused and handed a blue sheet of paper and told we would receive and email for a DS-5535.\r  \n\r  \nUpon review of what the DS-5535 even was and the email specifically stating to email the responses to the seven questions to the email provided. She was given her passport back and sent on her way. We later find out that the DS-5535 is taking months and months if not over a year to hear anything back. This is where it got really bad. My wife has lived in Dallas for 28 years and and we have a life together in Dallas. My wife owns two house she pays taxes on and we live in my home where she has her minor child and my mentally disabled son she helps to care for. She has nothing in Mexico. She has no family, no house, no nothing, and she was dealt with this ridiculous request that has no end date in sight.\r  \n\r  \nOur attorney says to email congress and senator and he'll also submit an inquiry. I just cannot comprehend how these interviewers can get on these ridiculous power trips that are seriously unjustified. The whole purpose of the DS-5535 is extreme vetting for national security risks. My wife is a petite 4'10\" little mexican lady who has only ever been in Mexico and the US. All of her previous documents were approved and she even had extra approvals with the unlawful entry waiver. How can one human being not see the situation what what it is rather than getting on a power trip can throwing the only thing you can at her, a DS-5535. I think because of Trump and and others alike they are hatters for the immigrants and making unjust decisions. They have no business approving people for Visas. This process should not be a one way process only where the interviewer is the only one who knows why. Just like in the US, you are allegedly innocent until proven guilty. The facts must be presented from BOTH sides, not just one. In this case is is entirely unfair because the interview holds the cards and has no accountability to the affected person and provide some justification for asking for more information. My wife was unfairly judged and ultimately for something she had no control over when her mom brought her into the United States. My wife simply made the best of her life. My was was NEVER on government provided services like food stamps, medicaid, nothing like that. She worked and stood on her own two feet.\r  \n\r  \nAs a legally born US Citizen, rest assured I will not stop and there will be some accountability to this system. It is abused by interviewers and I absolutely will NOT stand around and just let the system work itself out. I am a hardworking US Citizen who met a lovely lady who is now my wife and we are both paying the price for this unjustified interviewers decisions. Get ready for some hell raising!",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.66,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": "Ciudad Juarez"
           },
           "sex": "Hombre",
           "document": "DS-5535 / Spouse Visa"
       },
       {
           "id": "13rnwgi",
           "title": "Help Naturalization Proof",
           "score": 0,
           "num_comments": 6,
           "author": "prissynyan13",
           "created_utc": 1685035897.0,
           "created_readable_utc": "2023-05-25 17:31:37 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/13rnwgi/help_naturalization_proof/",
           "permalink": "https://reddit.com/r/immigration/comments/13rnwgi/help_naturalization_proof/",
           "selftext": "So my husband was born in Mexico but is naturalized citizen because his dad was from Kansas City. He lost his TX drivers license & DMV will not give him replacement without proof of certificate of naturalization or passport. Problem is, my husband was left with nothing. He has no certificates or proofs of anything aside from social security card & his birth certificate from Mexico. He hasn't a clue how to get this resolved.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.5,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": "Texas"
           },
           "sex": "Mujer",
           "document": "Certificate of Naturalization / Passport / Proof of Citizenship"
       },
       {
           "id": "12w0thf",
           "title": "Big Issues with CRBA/VISA for Baby in Mexico - We need help!",
           "score": 20,
           "num_comments": 19,
           "author": "Grouchy_Teacher433",
           "created_utc": 1682237336.0,
           "created_readable_utc": "2023-04-23 08:08:56 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/12w0thf/big_issues_with_crbavisa_for_baby_in_mexico_we/",
           "permalink": "https://reddit.com/r/immigration/comments/12w0thf/big_issues_with_crbavisa_for_baby_in_mexico_we/",
           "selftext": "Hi everyone and thanks for reading!\n\nWe are in a difficult situation right now and don't really know what to do. Maybe someone over here can help us...\n\nMy husband is a U.S.citizen and I'm a greencard holder. We came to Mexico at the end of last year and I gave birth to a baby girl. She has the Mexican citizenship now.\n\nWe then tried to do the birth abroad (CRBA) at the U.S.consulate in the city where we are, but unfortunately, the documents to proof my husband's physical presence (5 years) in the U.S. prior to her birth weren't sufficient enough. We should have more documents in the U.S. that we can submit later. \n\nWe then applied for a B2 Visa for her to be able to bring her to the U.S. and we got the earliest available interview appointment in November 2024. Unfortunately, our request for an expedited appointment was denied. I'm currently checking the website several times every day for an earlier appointment in case someone else cancels the appointment. That's what the consulate told us. So far without success...\n\nWe both have to return to work in May in California and right now we have no idea how to bring our baby girl with us to the U.S.!\n\nI already called the consulate, the U.S. citizen emergency contact number, Border Protection and Department of State without success. Last week we went to the consulate again in person and still have no solution. It's getting ridiculous...\n\nAny ideas what we can do...?! What happens if we just try to enter the U.S. without a VISA for our baby?\n\nThanks in advance!!",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.88,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": null
           },
           "sex": "Mujer",
           "document": "CRBA / B2 Visa / Proof of physical presence"
       },
       {
           "id": "12rlgs8",
           "title": "My (US Citizen) Wife was denied a tourist visa. How can we overcome this so she can visit the US with me?",
           "score": 0,
           "num_comments": 6,
           "author": "turkishdelight1013",
           "created_utc": 1681891358.0,
           "created_readable_utc": "2023-04-19 08:02:38 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/12rlgs8/my_us_citizen_wife_was_denied_a_tourist_visa_how/",
           "permalink": "https://reddit.com/r/immigration/comments/12rlgs8/my_us_citizen_wife_was_denied_a_tourist_visa_how/",
           "selftext": "Hello, I am currently residing in Turkey. I got married last year and want to visit the US with my wife this summer. I am a dual citizen and have been since birth (Both US and Turkish Citizen). However her visa application was immediately denied with the main reason being given as she has failed to demonstrate she has a residence in a foreign country which she has no intention of abandoning. \nWe are currently renters, however we plan on buying a house within the next month. Would showing this help? She owns her own car debt free and is employed here. Would showing our two cats help? We also plan on putting a decent amount of cash in her bank accounts ahead of time to show she has ties here. \nMy parents have a permanent residence in the US and we showed that as an address and said that my mother would be sponsoring her, was that a mistake. \nAny input is appreciated, thank you in advance.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.5,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Turkey",
               "state": null
           },
           "sex": "Hombre",
           "document": "Tourist Visa / B2"
       },
       {
           "id": "12orzrt",
           "title": "Mother (Green Card)’s Name on Child’s Birth Certificate?",
           "score": 2,
           "num_comments": 4,
           "author": "domo-r",
           "created_utc": 1681685064.0,
           "created_readable_utc": "2023-04-16 22:44:24 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/12orzrt/mother_green_cards_name_on_childs_birth/",
           "permalink": "https://reddit.com/r/immigration/comments/12orzrt/mother_green_cards_name_on_childs_birth/",
           "selftext": "My wife (green card holder born in Mexico) and I (US Citizen) are about to have a baby in the US. There are fields on the birth certificate to enter the mothers name. However, her name on her green card is different than the name on her Mexican passport. Additionally, on previous immigration documents before we got married, her last name was different than her passport as well. See the below for an example. \n\nThe criteria on the birth certificate is First, Middle, Birth Last Name. \n\nIs there a specific way we need to structure her name on the birth certificate as additional support for eventual citizenship in the US?\n\nExample of name discrepancy:\n\nPassport Name:\nFirst: Maria Karla\nLast: Dominguez Ramirez\n\nGreen Card Name:\nFirst: Maria\nMiddle: Karla\nLast: Smith (married name)\nLast/maiden name on previous docs: Dominguez\n\nSecondly, we would like our child to also obtain citizenship in Mexico if possible. Has anyone had experience with a similar issue as this and how the Mexican consulate has handled?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.75,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": "Hombre",
           "document": "Birth Certificate (US) / Mexican Citizenship"
       },
       {
           "id": "1277kgj",
           "title": "I-129f / K1 Visa, Name question",
           "score": 1,
           "num_comments": 2,
           "author": "Complex-Pack-5775",
           "created_utc": 1680230634.0,
           "created_readable_utc": "2023-03-31 02:43:54 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/1277kgj/i129f_k1_visa_name_question/",
           "permalink": "https://reddit.com/r/immigration/comments/1277kgj/i129f_k1_visa_name_question/",
           "selftext": "I filled out an I-129f, of which recently got approved, it has an area to put your fiancé's name including, first, middle, and last name. If the fiance's name is for example \"Bob del Terry Mugen Devise\", as it is written on their birth certificate, and they're from Mexico how should I fill out first, middle, and last name? Now, I've already submitted it and it was approved after around 15 months of waiting. In the example above, I had put First Name: Bob, Middle Name: Terry, Last Name: Mugen Devise.\n\nWhen going forward will this be an issue being \"del\" is on the birth certificate? When my beneficiary receives their K1 packet and goes to schedule an interview, likely needing to fill out a ds-160, should the Middle Name be changed on any future documents to include \"del\"? Does it even matter? As an American, I assumed \"del\" was simply a signifier and wasn't actually a necessary part of a legal name, is it? Would this cause denial at any stage?\n\nAlso, using mexican passport as another example: Given Names: Bob del Terry, Surname: Mugen Devise",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 1.0,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": null
           },
           "sex": null,
           "document": "I-129f / K1 Visa / DS-160 / Birth Certificate / Passport (Name issue)"
       },
       {
           "id": "126uvxi",
           "title": "Big issue, need ideas",
           "score": 1,
           "num_comments": 6,
           "author": "No_Example_2687",
           "created_utc": 1680200123.0,
           "created_readable_utc": "2023-03-30 18:15:23 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/126uvxi/big_issue_need_ideas/",
           "permalink": "https://reddit.com/r/immigration/comments/126uvxi/big_issue_need_ideas/",
           "selftext": "Here is the issue at hand, my brother in law was born in Florida, has a birth certificate (the original), his mother moved to Mexico before he turned 1, while in Mexico he never registered or got a Mexican birth certificate and thus no ID or passport, he also did not get a US passport, he is over 30 now. What options does he have to come to the US? His father just passed away, I don't think he can go into the embassy without proper ID, can he go to the border, get detained and get his identity verified? Any ideas, I'm upset that they didn't do anything proper and just let this happen.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.67,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": null
           },
           "sex": null,
           "document": "US Passport / Proof of Citizenship / ID"
       },
       {
           "id": "11w7jw8",
           "title": "Visa stamping after change of status inside the US.",
           "score": 3,
           "num_comments": 6,
           "author": "cosa0101",
           "created_utc": 1679283897.0,
           "created_readable_utc": "2023-03-20 03:44:57 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/11w7jw8/visa_stamping_after_change_of_status_inside_the_us/",
           "permalink": "https://reddit.com/r/immigration/comments/11w7jw8/visa_stamping_after_change_of_status_inside_the_us/",
           "selftext": "I'm a mexican citizen currently in the US as a F1 student on OPT. My employer has agreed to sponsor me for a TN visa. We decided to apply for a change of status while I stay in the US since is the fastest method to get the TN visa status (\\~3 weeks according to the USCIS website) vs going to a US consulate in Mexico (the earliest visa appointment available at any given consulate is in mid-August). \n\nAs I understand it the change of status doesn't provide me with a visa stamp which is a requirement if I want to travel outside the US. \n\nOnce I get the change of status to TN, can I apply for the visa stamp at the consulate while my TN status is still valid?\n\nThe reason for this is that my EAD expires mid-May, so I cannot wait for the consulate appointment until August.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.71,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": null,
           "document": "TN visa / Change of Status / Visa Stamp / F1 / OPT / EAD"
       },
       {
           "id": "11vqr4f",
           "title": "Identity Crisis",
           "score": 1,
           "num_comments": 3,
           "author": "naivetheprogrammer",
           "created_utc": 1679245546.0,
           "created_readable_utc": "2023-03-19 17:05:46 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/11vqr4f/identity_crisis/",
           "permalink": "https://reddit.com/r/immigration/comments/11vqr4f/identity_crisis/",
           "selftext": "In over two decades of life, I have hardly lived in my home country of India (only around 4 years) and this was not even during the foundational or advanced years of my pre-adult life but my formative years (basically 2nd-5th grade). \n\nBefore living in India, I lived in the Mediterranean immersed in Judeo-Christian and Islamic lifestyle. My parents left India days after my birth. So, my foundational years were spent in a mix of an Indian and English speaking household with parents of two religions and having friends of nearly three to four religions and a multitude of languages. This is the first count against my Indian identity in that I am extremely heterogeneously mixed in both language and culture. \n\nWhen living in India, I found it very hard to bond to the culture. I went to a private international school that had a mix of foreign and domestic students and primarily conducted education in English. I regularly failed my domestic language classes, having a greater affinity for the foreign languages. The most I could enjoy was the food. My parents saw this and we left for United States where I started 6th grade. This is the second count against my Indian identity in that I seemed to have an intrinsic otherness to it.\n\nI went through the entire middle school, high school, and college life in United States. I didn't care much of my immigration, thinking I was going to be fine being a potluck of so many cultures and experiences. This is the third count against my Indian identity in that even the Western biases (I call it this as a way to distinguish cultural, ethical, and metatheoretic inducing that the culture has that's distinct from the Indian equivalent) of education were highly internalized to my psyche. It wasn't until I was taken off my dependency status from my parents and faced the dehumanization of my entire identity to just another working immigrant that my psyche started to appear as a discarded persona, forcing me to adopt another co-psyche.\n\nI've been involved in many churches, mosques, and hillels. Its a recent occurrence that I am fraternizing with the graduate student body which is significantly immigrant that I am getting any sort of first degree connection (most has been second degree through books and philosophical treatments of Indian subcontinent religious development) to my culture. Even then, its more rocky than I'd want it to be and not as easy to make as with American relationships. This strengthens the second count even further.\n\nA lot of these feelings are taking over me and its giving me a hard time to work towards my own cause because I'm at a point where I feel neither America nor India would take me. I don't even have the SSN equivalent documents for India which is given to every American here (I think) when they are born. Now that I'm cracking into my professional life in America, I feel like I have to behave like an immigrant now even though I have the mannerisms and upbringing of a domestic person. I have to tell employers my status and they infer what they do of the average immigrant. \n\nMy question is are these feelings unfounded? Do I actually have to assume my true spirit and force myself to learn a culture my parents don't even want me to go back to? They speak about H1B, etc. What is the ethic surrounding this geopolitical quandary? Am I actually still bound to my home country even if I don't internally feel any identity to it? Why do I need to keep lying to immigrant officers that I have intent to return to the country to contribute to it? I don't believe it is natural at all for a human to take on so many identities. \n\nI am open to philosophical or legal discussions. Please ask for any further clarifications.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.56,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": null,
           "document": "Immigrant Status / H1B"
       },
       {
           "id": "11hiid3",
           "title": "Can I get a US passport based on American citizen mother.",
           "score": 0,
           "num_comments": 30,
           "author": "Practical-Card488",
           "created_utc": 1677885784.0,
           "created_readable_utc": "2023-03-03 23:23:04 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/11hiid3/can_i_get_a_us_passport_based_on_american_citizen/",
           "permalink": "https://reddit.com/r/immigration/comments/11hiid3/can_i_get_a_us_passport_based_on_american_citizen/",
           "selftext": "\nI am currently in the US on a f1 visa. My mother was born in the US and lived here for more than 365 days but less than 5 years. Due to the supreme courts ruling of sessions vs morales Santana in 2017, there was confusion whether the new 5 year rule would be held in effect for me since I was born before 2017. Even lawyers have given different answers.. As far as I’ve read because I was born out of wedlock the 365 days should apply. Does anyone have some guidance on this - would be much appreciated! At this point I’m inclined to apply with my mothers birth certificate, my birth certificate and form ds5507 but not sure.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.45,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": null,
           "document": "US Passport / DS-5507 / Proof of Citizenship"
       },
       {
           "id": "1102x6g",
           "title": "fast non-immigrant visa options for medical reasons...",
           "score": 0,
           "num_comments": 23,
           "author": "lijame85",
           "created_utc": 1676163168.0,
           "created_readable_utc": "2023-02-12 00:52:48 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/1102x6g/fast_nonimmigrant_visa_options_for_medical_reasons/",
           "permalink": "https://reddit.com/r/immigration/comments/1102x6g/fast_nonimmigrant_visa_options_for_medical_reasons/",
           "selftext": "I'm a US citizen and my husband is a Mexican citizen. We live in Mexico and still have no desire to immigrate to the US. With that said, I'm currently pregnant with our first child and was recently told by our doctor that I'm very high risk and it would be advised to consider having the baby in the US. The problem is that my husband doesn't have a visa to travel to the US.  \n\\*\\*\\* We are looking for fast non-immigrant visa options that could allow him to be in the US for at least 6 months to be present at the birth of our child and help with the first few weeks after/recovery. Is he eligible for a work visa being married to a US citizen? What other options are there in this situation?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.33,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": null
           },
           "sex": "Mujer",
           "document": "Non-immigrant Visa / Visitor Visa / B2"
       },
       {
           "id": "10kpe90",
           "title": "I am looking for some direction about applying for a Certificate of Citizenship",
           "score": 2,
           "num_comments": 11,
           "author": "dibblackbird",
           "created_utc": 1674618938.0,
           "created_readable_utc": "2023-01-25 03:55:38 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/10kpe90/i_am_looking_for_some_direction_about_applying/",
           "permalink": "https://reddit.com/r/immigration/comments/10kpe90/i_am_looking_for_some_direction_about_applying/",
           "selftext": "So I was born in Mexico but I was basically stolen at birth.  When I found out the truth about my mom not actually being my mom I moved out and she destroyed all of my paperwork.  That paperwork doesn't matter as I found out my birth certificate was fake anyway.   \n\n\nI am now in my 30s and I found my legit birth mother so now we are working on fixing all of this and getting my paperwork in order.  I need someone who can answer some questions about me filing an N600 since she is a US Citizen and was one before I was born.  From what I have looked into I have seen everything involving an N600 has to be done before I was 18.    \n\n\nI could use some advice for sure",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.75,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": null
           },
           "sex": null,
           "document": "N-600 / Certificate of Citizenship"
       },
       {
           "id": "10cr2rb",
           "title": "Ciudad Juarez IR-1 interview wait times after DC notice",
           "score": 2,
           "num_comments": 12,
           "author": "MrSandman2008",
           "created_utc": 1673807620.0,
           "created_readable_utc": "2023-01-15 18:33:40 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/10cr2rb/ciudad_juarez_ir1_interview_wait_times_after_dc/",
           "permalink": "https://reddit.com/r/immigration/comments/10cr2rb/ciudad_juarez_ir1_interview_wait_times_after_dc/",
           "selftext": "I'll start this post with some of the facts of our case. My wife and I were married in the US on August 10, 2020. She is from Mexico and returned there after our wedding. I started our immigration paperwork in October 2020 through USCIS. We received approval of the I-130 on 09/24/21 and the case was sent to the NVC. Our case was approved by the NVC and marked documentarily complete on 01/03/2022. We have been waiting for an interview date in Ciudad Juarez since then.\n\nMy question is whether there is any information available that will help us estimate when her interview date might be scheduled. The NVC releases monthly backlog reports that show how many DC cases were assigned interview dates each month but I'm not sure how helpful those are as they don't specify the numbers by embassy. I've called to the NVC and the embassy in Juarez, sent emails to both, and have gotten nowhere. I've also contacted one of my Senators for assistance and not gotten much help there, either.\n\nAccording to the backlog reports, when we were first given the DC notice in January 2022, there were 465k IV applicants who were documentarily approved and waiting for interviews. However, it's my understanding (I could very well be wrong, though) that IR-1 visas have priority over certain other IV categories, with the exception of certain asylum cases, so I'm not sure whether we actually would have started in the back of the line or not. If there is a priority given, it certainly doesn't feel like it. lol. \n\nI realize I'm not going to get any definitive date or anything. I also realize that Ciudad Juarez is one of the busiest embassies in the world and the current situation at the border may very well be causing some delay as well. However, I'm hoping there are some resources available that might help us understand what cases are currently under review or something. The hardest part about this whole process has been the not knowing. My wife and I have both said that even if the interview was another year away, we would feel better just knowing that there's a date to look forward to. So, any resource that can help us calculate a somewhat-accurate estimate of where the embassy is currently at would help lift our spirits.\n\nAny and all help is appreciated...\n\nThanks!",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.75,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": "Ciudad Juarez"
           },
           "sex": "Hombre",
           "document": "IR-1 Visa / Interview Scheduling"
       },
       {
           "id": "zuhodg",
           "title": "How can grandparents apply for citizenship for grandchildren living abroad?",
           "score": 2,
           "num_comments": 24,
           "author": "pluviosilla",
           "created_utc": 1671912583.0,
           "created_readable_utc": "2022-12-24 20:09:43 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/zuhodg/how_can_grandparents_apply_for_citizenship_for/",
           "permalink": "https://reddit.com/r/immigration/comments/zuhodg/how_can_grandparents_apply_for_citizenship_for/",
           "selftext": "We want to apply for naturalization of two grandchildren born in Mexico to our 26 year old son who is a U.S. citizen but who has lived in Mexico since before his 15th birthday. He is not eligible to obtain the certificate of birth abroad for his kids, because he hasn't lived in the U.S. since 1999. He is very discouraged, because the process is complicated and he can't afford an immigration lawyer, so we want to initiate the process ourselves as grandparents of his two children, ages 3 and 5. We created an account on the USCIS website but can't find any procedure for initiating this process as grandparents. How do we start the process?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.55,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": null
           },
           "sex": null,
           "document": "N-600K / Certificate of Citizenship / CRBA"
       },
       {
           "id": "zev2o8",
           "title": "Need advice on how to get my child US citizenship",
           "score": 1,
           "num_comments": 8,
           "author": "Which-Belt-5976",
           "created_utc": 1670398215.0,
           "created_readable_utc": "2022-12-07 07:30:15 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/zev2o8/need_advice_on_how_to_get_my_child_us_citizenship/",
           "permalink": "https://reddit.com/r/immigration/comments/zev2o8/need_advice_on_how_to_get_my_child_us_citizenship/",
           "selftext": "Hello all, just wanting to get some advice. I am a US citizen (by birth) and was living in New Zealand for 2 years with an ex and had a child in that country (out of wedlock). We are no longer together but legally I have permission from NZ family court to raise my child with me in the US. The only problem is that I was not able to go to the US embassy to obtain a CRBA due to DV situations and then the US embassy closing down due to Covid. My DV lawyer also thought it was best to get me and my child out of the country asap. So now I am here in the US and I’m having a bit of trouble trying to file for my daughters citizenship. Would it be easier for me to go to a foreign US embassy (like Canada or Mexico) and obtain a CRBA that way? Any advice is greatly appreciated thank you.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.6,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": null,
           "document": "CRBA / Proof of Citizenship"
       },
       {
           "id": "y5ym97",
           "title": "US born raised abroad in Mexico required to submit form DS-5520. Can one use documents from Mexico even if last names half match?",
           "score": 0,
           "num_comments": 6,
           "author": "Ok-Leading-3046",
           "created_utc": 1665972534.0,
           "created_readable_utc": "2022-10-17 02:08:54 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/y5ym97/us_born_raised_abroad_in_mexico_required_to/",
           "permalink": "https://reddit.com/r/immigration/comments/y5ym97/us_born_raised_abroad_in_mexico_required_to/",
           "selftext": "My cousin (25f) was born in the US and taken to Mexico shortly after to live there with my aunt, her mother and has lived there since. In mid January of this year, she came back to the states and applied in September for a US passport. Just recently, she received a letter asking her to submit form DS-5520 with additional documentation to prove her identity. She went to school there and has her Mexican ID.\n\nNow the main concern has to do with her last names. My aunt, when registering my cousin in Mexico, ended up using her own last names, let’s go with Espinoza Aguilar. Therefore, all of the documents my cousin, let’s call her Rosa Anamaria, might be able to use has the name, Rosa Anamaria Espinoza Aguilar.\n\nHer US birth certificate however, has her mother and her fathers last name, let’s go with Ortiz Guzman. Therefor, my cousin’s legal name in the US is Rosa Anamaria Ortiz Espinoza.\n\nHow would she be able to go about in filling form DS-5520 or whatever form necessary to be able to continue her process to get her passport or would the last name discrepancy not matter?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.33,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": null,
           "document": "DS-5520 / US Passport / Birth Certificate (Name issue)"
       },
       {
           "id": "xp81s7",
           "title": "Certified translations spanish to english?",
           "score": 2,
           "num_comments": 4,
           "author": "stingraymond27",
           "created_utc": 1664257855.0,
           "created_readable_utc": "2022-09-27 05:50:55 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/xp81s7/certified_translations_spanish_to_english/",
           "permalink": "https://reddit.com/r/immigration/comments/xp81s7/certified_translations_spanish_to_english/",
           "selftext": "I'm filling out i-130 forms for my wife and two daughters, my wife and i got married in Mexico thus our marriage certificate was emitted by the Mexican government, both my daughters were born and Mexico and their birth certificates were emitted the same way, for evidence i have to upload them but it says i also need to upload the certified translations, i have all the documents in pdf, is there any trustworthy website where i can get those documents translated and certified?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.67,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": "Hombre",
           "document": "I-130 / Certified Translations / Marriage Certificate / Birth Certificate"
       },
       {
           "id": "xmexvz",
           "title": "Will \"skipping\" or not boarding the second leg of a booked ticket cause serious issues?",
           "score": 1,
           "num_comments": 1,
           "author": "Anxious_Law_797",
           "created_utc": 1663981854.0,
           "created_readable_utc": "2022-09-24 01:10:54 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/xmexvz/will_skipping_or_not_boarding_the_second_leg_of_a/",
           "permalink": "https://reddit.com/r/immigration/comments/xmexvz/will_skipping_or_not_boarding_the_second_leg_of_a/",
           "selftext": "I am in a rather complicated situation. 22 years ago I committed a monumental stupidity. I use the word monumental as a qualifier because it truly opened my eyes to the wrong choices I made two decades ago. Rewinding my life to the year 2000, I committed a crime that redefined my life in a negative way. Regret... yes, very much but it's too late for that and I am unable to time-travel back to correct those foolish and irresponsible actions, the consequences of which I am now confronted with. The crime was counterfeiting currency. I reproduced or \"cloned\" 60 pieces of 50 Euro banknotes (bills, if you're an American reading this) and spent them with a whatever-they'll-never-find-out-it-was-me attitude. Little did I know (and this is why I aptly began this story with the phrase \"monumental stupidity\" above) that police in my country have some of the most sophisticated tools for solving crimes, even those perpetrated by perfectionist offenders. I underestimated them.\n\nAfter spending the entire lot of my own version of 50 Euros, I got my first inkling of dark clouds ahead when a family member called me to say that police were making inquiries about my whereabouts. I can still vividly remember having that conversation on that iconic Nokia 3310, dazed and asking myself how I was so quickly and positively identified as the source of these fake Euros, how to deal with the prospect of a prison sentence and the effect this criminal record will have on my future, how to explain this to those who I least wanted to disappoint in my life and endless other hows, whys and whats.\n\nBeing a coward, I decided to not deal with the consequences. I left Europe and arrived somewhere in Asia (I won't say where for my privacy and because of how this story further unravels). I will redact the irrelevant bits, like what happened in the many years that followed. I basically created and lived a new life for myself. The first few years were lonely and rather quiet. I knew back then that criminals were almost always caught when they made that fatal mistake of contacting their families and friends back home and revealing their whereabouts or asking for money to be transferred which creates a traceable transaction or paper trail. Eventually friendships and relationships were established during my 22 years abroad. Some of them evolved to very close friendships and led to fateful decisions which I will briefly write about now.\n\nIn 2003 I mentioned my predicament to a friend of mine (a local of the country I am in now) and told him the entire story. He was and is still very understanding and after listening to my (mis)adventure he thought it only existed in movies but he promised to help find a solution. I was both grateful and also surprised because I never asked for help in the first place. It didn't take long for him to suggest one. Within a few weeks he invited me for dinner at his parents' home. After dinner, he mentioned that his brother knew someone who worked at the local birth registry office. Curious, I listened intently. He then mentioned that a friend of a friend would be willing, for 2k USD, to have his birth certificate used for applying for a passport under his name but with my picture on it. This friend of a friend was disabled, around my age, never traveled and had no intention of ever traveling internationally in the future. After what seemed to be an eternity of silence, I noticed he was looking at me and waiting for me to say something. I quickly switched to analyst mode, weighing the pros, cons and risks in my mind. I asked how this could be achieved when I couldn't speak the language fluently yet and if this could endanger the passport application process, he quickly dismissed this concern with a wave and said a travel agent will take care of everything. He raised his beer bottle and said cheers.\n\nI got the passport and have since that year (2003) moved on with my life. I established a company, opened bank accounts, built an impeccable credit history, bought a house and led a life without any infractions and trouble with local laws (apart of course from this closely guarded secret of having a borrowed identity). When I left my home country, I needed just 3 semesters to complete an undergraduate degree. Anxious to have academic credentials for a more solid standing in society, I studied part time locally and graduated in 2009 with a bachelor's degree in business.\n\nFast forward to last year. I was having a cup of coffee one morning and reading the local headlines on my iPad. COVID this, COVID that. Travel bans and countries locked down. Now here's an article about vaccines and there's one about so many COVID deaths in Italy. Then boom... I see it. An article about the government introducing a new e-passport, completely redesigned and incorporating a new system  linked to Interpol's databases. Ironically, it's funded by the EU with most of the logistics handled by, you guessed it, the country I'm originally from. Next to the article was a video of masked government officials proudly showing off the new passport system and how it scanned law enforcement databases and international AFIS systems in real time. One immigration officer talks about the advantages of the new passport and how the biometric identifiers stored in the passport's chip are now checked against international police databases.     \n\nAfter reading this, I discussed this new development with my friend. At first, he dismissed it but I pressed on and told him not to ignore the level of sophistication of this new e-passport technology. After a few weeks of serious thoughts, I decided it was time to expect a day of reckoning and that the earlier I prepared the less unpleasant the outcome.\n\nSo I come to the final part of this story. I intend to settle my affairs in this country. I will close my bank accounts, sell my land and house (I already have an offer) and return this borrowed identity to the rightful owner. After 22 years on the run, I plan to fly back to Europe and surrender to my country's authorities. In the meantime, I applied for a passport at the embassy because the one I had when I left Europe expired 19 years ago. The embassy made inquiries back home (they always do when a passport is applied for) and told me there is \"something\" on the system preventing a full passport from being issued. As a result, I am eligible for an ETD only. ETD stands for emergency travel document and it is valid for travel to my country only. It doesn't allow travel to other countries.  Great. This means I'm still wanted.\n\nNow this is the dilemma I am in now and it's the reason for posting this story here on reddit :\n\nI have to (must!) leave this country with the local passport. This is because the ETD from my country has no record of entry and therefore no record of me ever entering here under my real name. Using it at the airport to fly to Europe might lead to me being detained, a thought I am not fond of when I think about local prison conditions here. I therefore plan to fly from here (country X) to an assumed destination (in this case, Mexico). I use the word assumed because I have no intention of completing all legs of the journey. The local passport allows visa-free travel to Mexico and no transit visa is required for my country in Europe. I will therefore fly directly from this country to my country's airport like this:\n\nMy current country --> ZRH (my country's main international airport which allows transits without visa)\n\nand not board the second leg to Mexico. \n\nAt the airport, I will present my ETD to immigration and I expect to be detained for the offence I committed 22 years ago.\n\nMy question is if this is something that can be done realistically, given how I am not familiar with how airport transit arrangements work. Will I be liable to pay or reimburse the airline for \"skipping\" the second and return legs of this booking? Will the flight to Mexico just leave without me or will one less passenger on the manifest trigger a large-scale hunt for me at the airport. LOL I'm most worried about this because of the media attention it might generate.\n\nThank you for reading this rather long and convoluted story.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 1.0,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Asia (unspecified)",
               "state": null
           },
           "sex": null,
           "document": "Fraudulent Passport / ETD (Emergency Travel Document)"
       },
       {
           "id": "xdiak9",
           "title": "Getting a US passport as PR pt2",
           "score": 1,
           "num_comments": 6,
           "author": "celestia828",
           "created_utc": 1663102336.0,
           "created_readable_utc": "2022-09-13 20:52:16 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/xdiak9/getting_a_us_passport_as_pr_pt2/",
           "permalink": "https://reddit.com/r/immigration/comments/xdiak9/getting_a_us_passport_as_pr_pt2/",
           "selftext": "I was airlifted to the U.S. from Haiti with my (adoptive) brother because of the earthquake in 2010.  My US-born adoptive parents had already started the adoption process. The U.S. airlifted over 1000 children, and those who were in our category were handed over to custody of adoptive parents.\n\nThe adoption was incomplete in Haiti. The U.S. adopted this law at the end of 2010 that states that the adoptees could just their status from \"humanitarian parole\" to \"green card\" - deadline of 3 years.https://www.uscis.gov/archive/green-card-through-the-help-haiti-act-of-2010.\n\nI came with my brother and was admitted on humanitarian parole.  Our parents finalized our adoption in Illinois in 2010 at the court (there are photos) and we were given Illinois \"record of foreign birth\" with our adoptive parents' names and dates of births.  https://dph.illinois.gov/topics-services/birth-death-other-records/adoption.html\n\nMy parents did NOT adjust my status or my brother's status before 2013.  When we finished high school, we realized that we did not have proper documentation to get SSN (or so we thought).  We hired a lawyer to apply for EADs and GCs.  My brother and I received our green cards at the ages of 22 and 21 respectively. We have not yet had them for 5 years.\n\nMy brother and I now want to travel abroad, so we went to get passports recently.  I thought he went to the Haitian consulate, so I was confused when he came home with a U.S. passport.  It turns out he went to the passport agency NOT the Haitian consulate and got a U.S. passport.  Took 6 months.  https://www.reddit.com/r/immigration/comments/x6i0do/my_brother_got_a_us_passport_as_pr/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nI wanted to get a Haitian passport to travel to Thailand (it’s supposed to be here in 3 weeks) but now I am confused if my brother and I are entitled to U.S. passports.  I called USCIS yesterday twice. The first officer said that yes, I was a US citizen, the second officer said no, yes, and then eventually admitted she does not know and safe someone from USCIS would call me.\n\nIf I go to the passport agency with my green card and a filled out DS11 form with my brother, and if I get a U.S. passport (both officers told me I should apply), am I in any danger of misrepresenting myself as a U.S. citizen. I don't know whether I am, and I don't know if the lawyer we hired gave us bad advice.\n\nFINALLY, here is some reading on some government and law association articles on the Haitian orphans who were airlifted in 2010.https://www.aila.org/File/DownloadEmbeddedFile/53055\n\nI believe I am category 2 (paroled into US not no actual adoption or grant of legal custody in Haiti).   Link to law of December 2010 outlining how Haitian orphans get status adjusted.https://www.govinfo.gov/content/pkg/PLAW-111publ293/pdf/PLAW-111publ293.pdf\n\nMy question is - if i get a US passport, am I safe to use it if I present all the information (green card, Illinois record of foreign birth, my parents' US birth certificates)? Also could I be a us citizen and just had not known?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.67,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": "Illinois"
           },
           "sex": null,
           "document": "US Passport / Green Card / Proof of Citizenship (Adoption/CCA)"
       },
       {
           "id": "x0k4k2",
           "title": "Child brought to USA is here Illegally, Now disabled.",
           "score": 0,
           "num_comments": 17,
           "author": "JenAMarshmallow",
           "created_utc": 1661764459.0,
           "created_readable_utc": "2022-08-29 09:14:19 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/x0k4k2/child_brought_to_usa_is_here_illegally_now/",
           "permalink": "https://reddit.com/r/immigration/comments/x0k4k2/child_brought_to_usa_is_here_illegally_now/",
           "selftext": "I am posting a question here for my friend, A\n\nHis Grandmother (gma) is insane and decided that she \"wanted her daughter to be born in Mexico\" so despite living in America under a workers permit, she traveled to Mexico to give birth only to immediately bring the baby (Y) back to the US. Gma obtained a green card shortly after but never got her daughter (Y) a green card despite never knowing a life outside of America. 36 years later Y hasn't been able to afford to naturalize, and in 2020 lost her vision due to health issues leading to increasing financial struggles and risk of homelessness. I want to know what options she may have because this was a situation caused by her mom that she's never been able to resolve.\n\nAt this time gma is still a green card holder. all 4 of Y's children are legal US citizens. her children are 22 (A), 19, 15, and 12 no one has enough money to support the family yet so we need to get her at least legal enough to obtain social assistance of some kind so she doesn't end up homeless since she is unable to work due to her disability.\n\nEdit: we aren't sure if Y's mother (Gma) brought her legally or not but we assume so as Gma later obtained her greencard, but we think she assumed that her baby was covered automatically. Because of this assumption she never got any paperwork for her child, ultimately screwing Y over. Y now doesn't have any proof of how she entered the country and doesn't have any citizenship even though her mom is a LPR and her sisters and children are citizens and Y has lived in America her entire life up to this point.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.5,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": "Hombre",
           "document": "Green Card / Proof of Legal Entry / Citizenship"
       },
       {
           "id": "wx8xmt",
           "title": "Birth of US citizen abroad",
           "score": 17,
           "num_comments": 44,
           "author": "sadboicollective",
           "created_utc": 1661417443.0,
           "created_readable_utc": "2022-08-25 08:50:43 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/wx8xmt/birth_of_us_citizen_abroad/",
           "permalink": "https://reddit.com/r/immigration/comments/wx8xmt/birth_of_us_citizen_abroad/",
           "selftext": "Hey all i have a question. \n\nI (M,28,US citizen) live in Mexico and married to (F,26,MX) we recently had a baby and I'm filling out the form for her US birth certificate. \n\n\nHowever there is a section 2j. *Precise periods of time in united states'* \nAnd I'm not sure how to fill this out. I used to live in the US as a kid and moved to Mexico when I was 13. I currently live in Mexico and commute to work to the US everyday I haven't stayed in the US for an extended period since i did my GED in my hometown almost 12 years ago now.\n\n\nShould I just list everyday i came to and from work on the form or leave it blank to explain it at the consulate?\n\n\nThanks in advance!\n\n\nEDIT: Incase anyone searches a similar question we got her Born Abroad birth certificate in CDJ\nSo on the application I just put a general date range of when i crossed to and from for work and with my W2s they accepted it as sufficient time in the US.",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.87,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": "Ciudad Juarez"
           },
           "sex": "Hombre",
           "document": "CRBA / Proof of physical presence / DS-2029"
       },
       {
           "id": "wwki2t",
           "title": "Green card by Marrying a US citizen but not living in US",
           "score": 3,
           "num_comments": 17,
           "author": "Kurineko_Regan",
           "created_utc": 1661350021.0,
           "created_readable_utc": "2022-08-24 14:07:01 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/wwki2t/green_card_by_marrying_a_us_citizen_but_not/",
           "permalink": "https://reddit.com/r/immigration/comments/wwki2t/green_card_by_marrying_a_us_citizen_but_not/",
           "selftext": "Hey, so im a US citizen but i live in Mexico, i've been dating my gf for 5 years already and i want to see if there is a way, if we got married, to get her a green card for the US so that if we ever need to go we can. i read the requirements (I-130 Document Checklist) and everything looks fine, only thing is the part that says \" Evidence of a bona fide marriage relationship such as a shared residence  and finances. Examples for this include joint bank accounts, apartment  leases, shared household bills, health or life insurance designations,  birth certificates of children born to the marriage, etc. \", we have a bank account together as well as other things since we have been living together for a year, but all this in Mexico, does that still count?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.8,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "Mexico",
               "state": null
           },
           "sex": "Hombre",
           "document": "I-130 / Green Card / Proof of Bona Fide Marriage"
       },
       {
           "id": "wetm37",
           "title": "Im a US citizen can me and my gf get married on her tourist visa if there's no intent to stay afterwards I plan to go to mexico after anyways and stay there",
           "score": 0,
           "num_comments": 6,
           "author": "Cold_Ad5055",
           "created_utc": 1659491352.0,
           "created_readable_utc": "2022-08-03 01:49:12 UTC",
           "url": "https://www.reddit.com/r/immigration/comments/wetm37/im_a_us_citizen_can_me_and_my_gf_get_married_on/",
           "permalink": "https://reddit.com/r/immigration/comments/wetm37/im_a_us_citizen_can_me_and_my_gf_get_married_on/",
           "selftext": "Im a US citizen my gf is from Mexico  can me and my gf get married on her tourist visa here if there's no intent to stay afterwards I plan to go to mexico after anyways and stay there. it's just easier to get married here because in mexico they require birth certificate and mine has a patronymic name in it so it's better we get married here and I'll just go to Mexico after , there no intent to get her a green card here , she'll leave right after we get married \n\nis that ok?",
           "is_self": true,
           "is_video": false,
           "upvote_ratio": 0.4,
           "stickied": false,
           "spoiler": false,
           "over_18": false,
           "link_flair_text": null,
           "us_president": "Joe Biden",
           "location": {
               "country": "United States",
               "state": null
           },
           "sex": "Hombre",
           "document": "Marriage on Tourist Visa / Birth Certificate"
       }
   ]