
[
    {
        "id": "1k1nq5q",
        "title": "Birth in Mexico",
        "score": 0,
        "num_comments": 3,
        "author": "New_Intention_4234",
        "created_utc": 1744923948.0,
        "created_readable_utc": "2025-04-17 21:05:48 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1k1nq5q/birth_in_mexico/",
        "permalink": "https://reddit.com/r/immigration/comments/1k1nq5q/birth_in_mexico/",
        "selftext": "Has anyone had experience with giving birth in Mexico? Will we be allowed to drive across the border while I’m 8 months pregnant. I know birth tourism is a sensitive topic, but as a lower class family with no college degrees, we have very few options to leave the US. Is there anything else other considerations we should have? Thank you!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Mujer",
        "document": null
    },
    {
        "id": "1k1j67u",
        "title": "Immigrant's perspective on illegal immigration",
        "score": 0,
        "num_comments": 60,
        "author": "TerribleWinner7",
        "created_utc": 1744912466.0,
        "created_readable_utc": "2025-04-17 17:54:26 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1k1j67u/immigrants_perspective_on_illegal_immigration/",
        "permalink": "https://reddit.com/r/immigration/comments/1k1j67u/immigrants_perspective_on_illegal_immigration/",
        "selftext": "I just want to openly debate and offer my perspective as lived experience, immigrant myself coming into this country in 2012 legally. I dont get why a lot of people support illegal immigration policies and open borders. \n\nThis is not a troll or anything, I want to understand and have genuine discourse which I think we lack lately as people are quick to jump conclusions and paint others with right/left/center/racist/facist or whater you want. \n\nLet me give you a few details of how legal immigration works(from my experience) and then I would write an arguments why it needs to be overhauled, but not with opening borders as its bad for the country and bad for people coming over here illegally. \n\nI came to the US in 2012. I had to submit any imaginable paperwork living person can conjure, birth certificate, passport, background checks, my education, high school diploma, collage, my work experience, references, etc. \n\nFirst interview was in my country in the US embassy, questions about my past and current allegiance, why I was going, and even stupid ones which I thought was silly - are you going to try destabilize the USA government? Are you part of terrorist organization? (I was like even if someone was trying who would say yes lol). Anyway, many forms followed, my biometric pictures, finger prints(I guess for extra background check), sponsors here, their recommendations, etc. Very long process. Finally, the last part after I was approved to come over was my vaccination documents from childhood, I had to submit them and any vaccines my country might not required or by USA standards needed boosting I had to get in the US embassy approved clinic before leaving. \n\nComing into JFK was another stop for my photo, fingerprints. When in the USA, I was called into immigration center for another interview, few weeks or month or so later I got my ssn card and green card, which gave me permission to work. I started applying to jobs and from here normal story you have heard probably millions times. I dont want to retell all my struggles or diminish any others but it is a story you probably familiar  with, very real by the way. Anyway that is not the point of my post. All immigrants go through this one way or another, how hard it is to leave family, friends, integrate into different country, language issues/accent, etc etc.\n\nI had one more interview about one year been here, more like touch point what I was doing etc.  Two years later I had to resubmit some of what I have been doing in the country, one more interview with background check from my local sheriff's office (I am sure they did more background checks themselves to make sure I was not involved in any criminal activity) thats when I was granted permanent green card. After holding permanent green card for over 5 years, I went and passed exam for citizenship and got naturalized. \n\nNow my perspective on the process pros: \n1) You are screen so deliberately and carefully that it is almost impossible to come over in the USA for any ill intent. Criminal record pretty much gets you automatic denial(I had none, so not sure exactly but many forms ask the question and you have yo go through multiple background checks). \n\n2) Again, screening is so intense that you have yo provide your vaccination results from childhood to make sure no diseases are brought in the country. \n\n3) During the interviews and countless paperwork submissions, people are screened who would be functioning members of society, who can integrate well and bring good to the USA. (I never actually worked or known anyone close who works for immigration office, just this was my perspective as I was going through these myself).\n\n4) The whole process somewhat prepares you what to expect, you go through so much paperwork and interviews that you need to have basic knowledge of English. It is drilled into you that crime is bad(you cant come into the country with record). Moreover during the probationary period (temp green card you get before permanent) if you commit any crime you are going back to your country,  as you would lose your status.  \n\nCons: \nMy main problem with current process is how hard it is to go through it even if you are qualified or eligible. The paperwork, bureaucracy is insane. It is so tedious that many times I felt like giving up. You might have noticed how many times I had to submit paperwork, its not that mistyped and wrote it few times,  no if anything I missed more times I had to submit papers before interviews or afterwards, it is constant. \n\nInterviews are brutal, sometimes it feels like you are interrogated as if you are already guilty of something and you have to prove your innocence. Many immigration officers, workers are rude and sometimes assholes, not sure deliberately or not. I encountered dozens of workers for years and can only recall two people who I could say were nice. Again this is my perspective, can be a requirement for a job to screen criminals? To me many of them could have been nicer. \n\nCurrent limit on legal immigration is set to 650,000 a year I believe. If we needs more immigrants, then we need to losen requirements and make process easier. Make this number 1,000,000 and simplify the process and actually set people up for success. \n\n‐-----------------------------------------------------\n\nAbove I outlined my story, my perspective on legal immigration, here I will focus on illegal immigration and whats my perspective on this. \n\nFirst why it is bad for the USA: \n\n\n- Criminals, terrorist, bad people! Allowing everyone to come here, you will also let bad people come through in much more higher numbers than before. As I described due process above, even that can be gamed and criminals can forge the papers, lie on interview and all that but I hope you understand amount of effort they need to put in that process than here.\nAlso, let me explain why America has for a lucrative aspect for just every day criminals too. If you are in any other country stealing you will get less money than stealing in the USA for the same stuff. And many times USA has much more lenient laws than country of origin. \n\n\n- Living standard disparity between US and other countries encourages some people to sit on gov aid and do nothing, because it is much much better than where they came from. You want this or not it is true, I know many who do this.(Many would paint me as traitor to my community as immigrant myself but fact is fact and I want to give you my honest thoughts on this issue). \n\n\n- Health care much higher standard than some other countries. It is true that for working Americans most will not qualify for medicaid and healthcare can be very expensive but lot of people who came over jumped on medicaid. (trigger warning, probably I will be called names again for this but I know people who do this and are currently on it). \n\n\n- Vaccination and potential for bringing some diseases into the country, read my point above. People crossing over dont go through same scrutiny. \n\n\n- Empathy to the point where our country can be ruined. The most people who have not been outside the US, dont understand that 80-90% of the worlds countries have worst economies than USA or face some type of discrimination based on their sex, beliefs, orientation, list goes on. If you open up borders and let everyone who has financial difficulties come in, the country would be overrun. This means there is billion people right now who would leave everything and move if they could. \n\n\n- Lowering wages for certain industries. Many illegals are hired for exploitation and are paid cents on the dollar to do the work. This lowers overall wages for legal workers too and incentivizes those industries to hire illegals. \n\n\n- Making cartels and criminals super rich for smuggling people to the border. Again, because I am immigrant I personally know sooo many people who paid tens of thousands of dollars per person to get in the country. Now multiply this by millions, you get the idea. They can invest this money to better smuggle drugs and fund their nefarious activities, just common sense. \nIf you think that you can come over the border by yourself, without paying smugglers, you are wrong, in real life 99.9% coming over border had to pay up. \n\n\n- Overall illegal immigration is a net draw on the country and open borders are not sustainable. We can be accommodating for some time until we have massive collapse and massive issues which can not be rectified or we can take approach to overhaul legal process if more immigrants are needed and work on that part. \n\n------------------------------------\n\nSecond, why this is bad for people coming illegally: \n\n- There is a myth out there that you only need to get into the USA and that is it, people who come here without due process are not prepared. They can not integrate into society, they dont know English, they are not ready because to them hardest part was just crossing the border which is not true. It is very hard to be in the country, with no family, friends, no language or culture knowledge and then face extra pressure having no papers to get legal work. Because of this they are limited what they can do and this pressures them to do something they would have not done in their countries, it is especially hard for males. Fact is that females can get work  easier than males, I cant tell you how many males I know from my country who came here bright eyed spend all their life savings and sank into drugs and we had to send them back in caskets. \n\n- Work exploitation, when you are illegally hired you have no rights. Who do you complain when you are paid cents on a dollar? When you work 12-16 hours a day and get no overtime? When boss abuses you? Nobody, because the moment you say something you are out of the door or are threatened you will be reported to authorities and to get anothet job can take months. This is the point I dont understand people supporting saying, oh who will go and farm for you? Who will build houses for you? Who will clean streets for you? Who will care cheap for your grandparents? you are okay having cheap exploited labor to have cheap food, houses, goods and claim moral high ground? \n\n- People who come over here illegally are subjected to such horrors that some are impossible to imagine. Days in boats crossing lakes and ocean with just bread and water, days of hicking into swamps, forests, smuggled into stinky vans. Fear of seeing armed people in the countries escorting you somewhere you hope is the border and not some hole to be killed. I mean you should know someone who went through bad smuggling over the border to understand how bad it is. Not everyone goes to extreme difficult crossing as I described, but its easy for people to comment on issues like that who work 41 hour a week and take mental recover day next week because they worked 1 extra hour prior. I will be honest here most of you dont understand what they go through. \n\n- When administration of one or another first world country opens borders for illegal immigration, word gets out. I visited my country or origin in 2022 and I was flabbergasted how many strangers who I got to talk to were telling me were coming over. And they all thought hardest part was just getting through the border. The prevalent myth as I described above is you only need to get through the border to be successful. Most who I talked to had no knowledge of English or knew not what would they do when in the USA, I tried to explain but you have seen American dream in movies, hard to get people to understand its not all roses and rainbows. The story was completely different when I was back to my country in 2016, no one was talking coming over via Mexico most questions I got was how to apply for green card and if I could help some of my acquaintances and friends with forms which I did. \n\n‐----------------------\n\nLet me adress something where people can write that I contradict myself and that both my statements cant be true. \n\nI stated that many people come over here to game the system and stay latched on government support forever but I also stated that people coming over are exploited for work how can both be true? Because there are people who come over for gaming the system but there are also good, hard working, ambitions people who come here to do more and want even better lives(which are majority by the way). Only sad part is that from the beginning they are set up for failure, most of them spent last penny paying smugglers to get here, know no language and face extra challenges of having no papers. They are overworked and underpaid, their dreams crumble facing reality of dead end no pay jobs doing construction, cleaning, hospitality, care giving, etc. Thus many fall to drugs and other things they would have never done in their country of origin,  read my point again sending caskets back. \n\n-------------------------\n\nI whole heartedly support deporting:\n\n- Criminals of any type, I dont care if you stole a pair of socks in your country of origin (if you are found out to have a record back home) or here, you get deported period. \n\n- People who had social security numbers and work authorization given but have done nothing for years, are still sitting on government help programs pretending they are seeking the job. \n\n- People left after we got rid of the above groups are individuals who came here because of former administration's crime. Word got out borders were open and you could get in the US, as I described in my previous posts how many had to sell everything, pay last penny go through so many difficulties to cross over. While as adults they took responsibility and still knew they were coming illegally, administration encouraged it which is a tragedy. I personally know very good hard working people and this is why I am torn. One point they are illegally here but same time idiots from previous admin pushed message it was okay. I feel like I go in circles and circles on this point because I am truly torn. I dont know if some kind of help can be given to them but in the end they are here illegally and need to go back. I just wish whoever was responsible tricking them to come here would face justice causing so much pain and suffering, but I know it will never happen. I hope we just learn the lesson and never repeat this again, because as I described in general its not good for the country and for people coming here (There are very few exceptions but in general its negative all around). \n\n----------------------------------\n\nThis is my lived experience and my honest opinion why illegal emigration is overall bad for the country and also bad for most people who are coming over naively that everything is going to be great. \n\nI know I will get a lot of grief, but I dont care. Only one thing I ask, stay respectful to each other and lets have a dialog maybe we can change each others minds? Dont jump to conclusions. \n\nIf you made it all the way here I want to thank you, my English is not perfect nor did I proof read this or had AI correct it for me, I  just poured out my heart on the issue I am passionate about and want to know your honest opinion why would you support illegal immigration? How is this good for the country or people coming over? \n------------------------ ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.44,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": null
    },
    {
        "id": "1k011i9",
        "title": "Immigration help",
        "score": 3,
        "num_comments": 22,
        "author": "MelodicAd6357",
        "created_utc": 1744746047.0,
        "created_readable_utc": "2025-04-15 19:40:47 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1k011i9/immigration_help/",
        "permalink": "https://reddit.com/r/immigration/comments/1k011i9/immigration_help/",
        "selftext": "I, female (27) and my husband(26), are expecting our first child and I am giving birth by the end of November. I am a USA citizen and I am currently living in Mexico with my s/o he and he is in the process of becoming resident. It has been two years since I put in the paperwork and with this new office it is taking longer. I want to have my child in the USA because hospitals are better and I don’t want to go through a long process of making my child a citizen. My question is that if there is any way my husband can get a humanitarian visa so he can attend the birth of my child?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.58,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Mujer",
        "document": "humanitarian visa"
    },
    {
        "id": "1jc7byo",
        "title": "Mexican citizenship",
        "score": 0,
        "num_comments": 3,
        "author": "AdventurousBasis8723",
        "created_utc": 1742079079.0,
        "created_readable_utc": "2025-03-15 22:51:19 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1jc7byo/mexican_citizenship/",
        "permalink": "https://reddit.com/r/immigration/comments/1jc7byo/mexican_citizenship/",
        "selftext": "My dad was born in Mexico. My birth certificate says he is a us citizen. I was born in 1990. He just became a us citizen this year. Can I get my Mexican citizenship even tho he lied on my birth certificate or what do I need to do? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": null,
        "sex": null,
        "document": "Mexican citizenship / birth certificate"
    },
    {
        "id": "1iwapn0",
        "title": "Question",
        "score": 0,
        "num_comments": 10,
        "author": "Fresh_Dog_5311",
        "created_utc": 1740319075.0,
        "created_readable_utc": "2025-02-23 13:57:55 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iwapn0/question/",
        "permalink": "https://reddit.com/r/immigration/comments/1iwapn0/question/",
        "selftext": "Been with my girlfriend over a year and we want to get married to adjust her status she entered legally with a tourist visa \n\nshe did enter and gave birth to her child here in the USA in 2020 from a previous relationship (her ex husband was a Mexican citizen) and she didn’t pay the labor cost and went back to Mexico for 2 years and came back due to her ex being abusive. Is this case complicated due to her not paying labor cost to where we have to hire a lawyer or are we going to see any bumps on the road during this process? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.44,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": "Hombre",
        "document": "adjustment of status / tourist visa"
    },
    {
        "id": "1iu836t",
        "title": "Applying for citizenship to Mexico, better to do it in socal or Tijuana?",
        "score": 0,
        "num_comments": 1,
        "author": "VergaDeVergas",
        "created_utc": 1740082342.0,
        "created_readable_utc": "2025-02-20 20:12:22 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iu836t/applying_for_citizenship_to_mexico_better_to_do/",
        "permalink": "https://reddit.com/r/immigration/comments/1iu836t/applying_for_citizenship_to_mexico_better_to_do/",
        "selftext": "I’m in Tijuana every week but I live and am from Orange County. I’m applying through my dad who has passed away and from what I’ve read I only need to take his birth from Mexico and death certificate from the US along with my birth certificate and identification. I’m wondering if it’d be easier and faster to do it at the Registro Civil or at the consulate? ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": "California"
        },
        "sex": null,
        "document": "Mexican citizenship"
    },
    {
        "id": "1isuuq6",
        "title": "Interesting Case",
        "score": 0,
        "num_comments": 9,
        "author": "eateat07713",
        "created_utc": 1739932824.0,
        "created_readable_utc": "2025-02-19 02:40:24 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1isuuq6/interesting_case/",
        "permalink": "https://reddit.com/r/immigration/comments/1isuuq6/interesting_case/",
        "selftext": "Hey guys! I’m hoping someone can help me. I just had a consultation with a lawyer to see what my options are for citizenship/green card, etc. \nA little about me:\nMy mother brought me here when I was 3 illegally from Mexico . I have 6 other brothers and sisters who are all American citizens. My mother lost custody of us due to neglect and abuse and we were placed in foster care where I was adopted in 2001 at the age of 12 by an American woman. I have a foreign birth certificate and a social. Fast forward to now. I’ve been married for 9months to an American citizen but have been with my husband for 10 years. We have 3 kids together.  I spoke with the lawyer full heartedly believing the lawyer would suggest my husband sponsor me but was very surprised to hear him say he’d like to try derivative citizenship. Would that actually apply to me? He also mentioned something about The Hague convention aide. If I’m spelling that correctly, idk it was a lot of information thrown at me pretty fast. I have another consultation in a couple weeks to be able to compare the paths suggested. Thank you in advance for reading and any potential help. God bless! \n \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": "Mujer",
        "document": "citizenship / green card / derivative citizenship"
    },
    {
        "id": "1iky5c5",
        "title": "Marriage Based Visa Advice",
        "score": 0,
        "num_comments": 13,
        "author": "EmbarrassedLaw4358",
        "created_utc": 1739050034.0,
        "created_readable_utc": "2025-02-08 21:27:14 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iky5c5/marriage_based_visa_advice/",
        "permalink": "https://reddit.com/r/immigration/comments/1iky5c5/marriage_based_visa_advice/",
        "selftext": "I (24M) want to propose to my Mexican girlfriend (25F) this year and am looking into options to bring her to the United States. Now given the first statement this might not make sense, but I am planning to move to Mexico this year as well. The job I will have will be through a US-based organization and I will receive income from the US.\n\nI've heard with CR1 you have to spend extensive time apart after being married and after 3 years of LDR I don't want to put her through that again. Based on these circumstances could we do a K-1 and bring her to the US if I live in Mexico but am receiving income from the US? I would also still be maintaining a US address along with my Mexican one. What do you think is the best option in this case?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "CR1 / K-1 visa"
    },
    {
        "id": "1iiwgmz",
        "title": "How long does it usually take?",
        "score": 0,
        "num_comments": 0,
        "author": "Tacosdetrompo",
        "created_utc": 1738824184.0,
        "created_readable_utc": "2025-02-06 06:43:04 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iiwgmz/how_long_does_it_usually_take/",
        "permalink": "https://reddit.com/r/immigration/comments/1iiwgmz/how_long_does_it_usually_take/",
        "selftext": "Backstory:\nI am a US citizen by birth & a Mexican Citizen by naturalization. I have my MX passport and act of naturalization (I still need to go to Mexico to get my INE).\n\nWant:\nI want to give my US born daughter Mexican Citizenship as well. I have an appointment with the MX Consulate in Houston TX. I also want to give my husband MX temporary residency since we are married. Does anyone have an idea how long both processes would take? I have the documents needed, but are there any applications we need to complete prior to their appointments? How many appointments did you go to for either process? Any insight helps a lot and is greatly appreciated! \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.2,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": "Texas"
        },
        "sex": "Mujer",
        "document": "Mexican Citizenship / passport / INE / temporary residency"
    },
    {
        "id": "1ihxkhc",
        "title": "Citizenship through US father , denied passport",
        "score": 7,
        "num_comments": 4,
        "author": "Unlucky-Vacation-420",
        "created_utc": 1738716472.0,
        "created_readable_utc": "2025-02-05 00:47:52 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ihxkhc/citizenship_through_us_father_denied_passport/",
        "permalink": "https://reddit.com/r/immigration/comments/1ihxkhc/citizenship_through_us_father_denied_passport/",
        "selftext": "Wondering if someone can give me advice on what to do.I was born in Kenya and I came into the US at the age of 13 , my father naturalized on November 21, 2009. And when I came into the US , I was under the same address as my US citizen father and he was financially responsible for me . When I came into the country I was given a 10yr green card . I recently applied for the US passport and it was denied as I wasn’t able to establish legitimation. The letter seems to quote Kenyan legitimacy Act created in 1930 , I submitted documents and quoted the updated Kenyan children’s Act of 2012 which is more in line with when I migrated into the US. I have a sibling who we both came together and he applied for citizenship but was denied and told that he is already a citizen and he would have to apply for either the passport or certificate of citizenship. Online status shows the my passport application is still under additional information needed , but the letter says the passport was denied . I have an appointment set up to consult an immigration lawyer , more so looking for advice here what else I can do ? Can I still submit more documentation? Since they have returned all documents I have submitted for my application. \n\nDocuments I submitted are;\nForeign passport showing entry into the US in 2012 \nSchool records\nForeign birth certificate \nImmunization records as they needed documentation at my time of birth \nUS father naturalization certificate \nUS citizen father tax records \nMy W2 showing same address as my US citizen father \nDocumentation from a Kenyan lawyer quoting the updated children’s ACT of 2012, showing that legitimacy can be shown when father acknowledges paternity\nUS citizen father affidavit claiming paternity . \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.65,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "US passport / certificate of citizenship"
    },
    {
        "id": "1igqjpg",
        "title": "Current Juarez Process (January 2025)",
        "score": 20,
        "num_comments": 36,
        "author": "Euphoric_Benefit_996",
        "created_utc": 1738593591.0,
        "created_readable_utc": "2025-02-03 14:39:51 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1igqjpg/current_juarez_process_january_2025/",
        "permalink": "https://reddit.com/r/immigration/comments/1igqjpg/current_juarez_process_january_2025/",
        "selftext": "I was fortunate to marry a U.S. citizen and be petitioned in 2021. I had been a DACA recipient since April 2013, and I just arrived back home last night from my consular appointment in Juárez. Here’s how my process went from start to finish:\n\nFirst DACA Approval: 4/15/2013 \n\nMarried to USC: 12/18/2021 \n\nFiled I-130: 7/18/2022 \n\nReceived RFE and Submitted: 7/27/2022 \n\nI-130 Approved: 10/17/2023 \n\nReceived NVC Notice to Submit Paperwork/DS-260: 11/29/2023 \n\nReceived Consular Appointment: 11/25/2024\n\n**Consular Process:**\n\nDoctor & Biometrics Appointment: 1/24/2025 \n\n1st Consular Appointment (Paperwork Check): 1/29/2025 \n\n2nd Consular Appointment (Official Interview): 1/30/2025 \n\nReceived Email to Pick Up Passport at Embassy: 2/1/2025\n\n**Things to Note:** \n\nA lawyer guided me through the beginning of the process and helped me submit my I-130, which I mailed physically. After that, I used AI to assist with everything else.\n\nI did not apply for Advance Parole because I felt my process was already well underway and didn’t see the need to hire a lawyer for it. I also had no reason to believe USCIS would deny my case.\n\nI did not apply for a waiver because I only accumulated 88 days of unlawful presence in the U.S. I had 59 days from my 18th birthday to my first DACA approval. I also had a 29-day gap between my second and third DACA approvals, which was due to USCIS delays at the time.\n\nI was told by many that I did not need a police certificate since I was a child when I migrated from Mexico and had never returned. However, for peace of mind, I decided to get one while in Mexico. I requested it online and received a PDF via email within a few hours. The consulate returned the document to me and confirmed that I did not need it.\n\nAside from the required paperwork, I also took my work permits and DACA approval letters. I had misplaced two work permit cards but brought the approval letters, which were sufficient for my interview.\n\n**Day-by-Day Experience in Juárez:** \n\nThursday, 1/23 (Day 1): Drove from Arizona to Juárez and arrived at night. We stayed at City Express on Boulevard Tomás Fernández since it was cheaper and we had a car (only a 10-minute drive to the consulate). The area felt safe, and we tried many restaurants where everyone was extremely kind.\n\nFriday, 1/24 (Day 2): Doctor’s Appointment: 7 AM – Took 1 hour and 30 minutes. Everything was well-organized and quick. I did not need any vaccines since I got them all in the U.S. in advance (insurance covered them).\n\nBiometrics Appointment: 3 PM – Took about an hour. They only asked for my passport and DS-260 confirmation page. I forgot my DS-260 confirmation page, but I quickly printed it next door in under five minutes. I had to get back in line, but it was no hassle.\n\nSaturday & Sunday, 1/25-1/26 (Days 3 & 4): We explored the city, which was beautiful. We felt safe, and having a car was a huge plus.\n\nMonday & Tuesday, 1/27-1/28 (Days 5 & 6): Worked remotely from the hotel. Nothing fancy, but we went out to eat at nearby places and had a great time trying delicious foods.\n\nWednesday, 1/29 (Day 7)- 1st Consular Appointment (Paperwork Check): Appointment was at 7 AM (arrived at 6:15 AM). I waited about 20 minutes before going in. The process was smooth and took about 2 hours. It felt like a DMV visit, but instead of getting called by numbers, you move through a series of lines. They asked for my DS-260 confirmation page and the doctor’s appointment confirmation page. After that, they move you to a different section where they collected my DS-260 form, passport, and doctor’s confirmation page. They also requested: my husband’s and my birth certificates, marriage license, my passport, and my police certificate (which they confirmed I didn’t need). They clipped everything together along with a blue paper that had my appointment for the next day.\n\nThursday, 1/30 (Day 8) – 2nd Consular Appointment (Official Interview): Appointment was set for 7:30 AM – I arrived at the same time as the previous day. I waited longer in line, but once inside, everything went quickly. The interview sections are open, so you can hear others getting approved or denied—this made the atmosphere very nerve-wracking! My interview lasted under 5 minutes. I was asked: where I live, when did I crossed to the U.S., if it was my only time crossing, the meaning of my tattoos, and once she saw in the computer that I have DACA, she asked for all my DACA approvals. The officer approved my case and gave me a green paper, instructing me to wait for an email notification to pick up my passport.\n\nFriday, 1/31 (Day 9): Worked remotely from the hotel and paid for my green card. The green paper that had my approval had instructions to order my green card online, which cost $245 + taxes.\n\nSaturday, 2/1 (Day 10) – Passport Pickup: Received the email notification at 8am to pick up my passport. Went to the embassy (same place as biometrics), waited in line, and presented: Email confirmation number A form of ID They returned my passport with my temporary visa (valid for one year until I receive my green card).\n\nSunday, 2/2 (Day 11) – Returning to the U.S.: Paid $2.20 to cross back into the U.S. At the checkpoint, an officer took me into a room where people crossing on foot were processed. It had a lot of chairs, but since it was early, it was empty. I handed my passport to the officer at the window, who scanned it, stamped it, and sent me on my way—no questions asked.\n\n**Total spent for my process doing it myself: $1,575**\n\nI-130 Application Fee: $535 \n\nImmigrant Visa Fee: $325\n\nAffidavit of Support Fee: $120\n\nGreen Card fee: $245\n\nLawyer Fee: $350 (**ONLY** to submit I-130 application)\n\n\nThis was the most life-changing yet nerve-wracking experience of my life. I waited for this moment for almost my entire life, and the fear of being denied was overwhelming.\n\nBeing in Juárez, surrounded by thousands of people in the same situation, is an indescribable feeling. I hope this run-through gives you a glimpse of what the process is like out there.\n\nHappy to answer any questions!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.86,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": "Arizona"
        },
        "sex": null,
        "document": "immigrant visa / green card / consular processing"
    },
    {
        "id": "1igb7pr",
        "title": "Weird Complex Immigration Case - Any Help Would be Appreciated",
        "score": 1,
        "num_comments": 6,
        "author": "rooseveltsmustache",
        "created_utc": 1738539585.0,
        "created_readable_utc": "2025-02-02 23:39:45 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1igb7pr/weird_complex_immigration_case_any_help_would_be/",
        "permalink": "https://reddit.com/r/immigration/comments/1igb7pr/weird_complex_immigration_case_any_help_would_be/",
        "selftext": "This is a hypothetical situation. Or maybe its for a friend. Or maybe its for some other stranger on the internet. Or maybe I just like testing the sub's knowledge. I don't know shit about fuck. I prefer ice that melts.\n\nForgive the long post, but here we go:\n\nThe situation involves an elderly person well over 70 yrs old. This person has been in the United States since the 1950's. This person worked and paid taxes their whole lives. When this person applied for Social Security benefits some time ago, it was denied because of immigration status. The person's family was baffled. So the research and investigations began. Consider the following items about the person:\n\n\\- born in Mexico, has a Mexican birth certificate\n\n\\- born to an American citizen mother and Mexican father (no, this is not automatic, the law at the time required proof that the mom lived in the US for a certain amount of time, which she did)\n\n\\- came to the US as a young child\n\n\\- at some point in early adulthood, person filed for naturalization based on his mother's citizenship and US residence \n\n\\- person is now of older age and doesn't remember much from that time\n\n\\- person has a Social Security number issued from Texas in the 1950's\n\n\\- person has been married to an American citizen since the early 1980's\n\n\\- person worked legally (everyone assumes) for decades; even after eVerify became a thing, the person always qualified and was cleared as eligible for work until as recently as 2019\n\n\\- family tried to get info from USCIS, but none of the correspondence actually verifies his status, and they were only told that the prior Naturalization Application form was filled out incorrectly (no mention of eventual denial, acceptance, etc..)\n\n\\- family FOIA-ed a copy of the Naturalization Application, there are some administrative markings on it but nothing that says it was approved or denied\n\n\\- at the time of that application, the person did have an A- number. the person nor the family do not remember the person ever having a green card in recent years and always assumed they were a citizen\n\n\\- family tried to re-file Naturalization Application but it was not accepted (not denied, but kicked back) because the previous one was not filed out correctly\n\n\\- person has multiple other siblings that were in the same situation, some older and some younger, all born to same American mom and Mexican dad, and all of those siblings were naturalized long ago and are citizens\n\n\\- several lawyers have looked into this, and none have ultimately taken the case because of the complexity\n\nHERE'S THE KICKER: not too long ago, the person refiled for Social Security benefits, and was approved! They are getting their monthly check and are enrolled in Medicare. BUT, they can't cash the checks because they don't have a bank account in their name. The person only has an expired state driver's license, which expired around the same time as the discovery of this issue, so they have not been able to get a new ID with the new Real ID requirements.\n\nSo that's a partially happy ending with the SS benefits. But they need an ID and bank account, and the family is still not sure of the person's status. In order to get a Real ID, the DMV requires their Social Security benefits letter AND either their certificate of naturalization or other proof of citizenship.\n\nHERE'S THE ASK: How and where can the family safely verify status without raising any red flags? They are understandably nervous about the current climate, and they also don't want this to have been a mistake and have the benefits snatched back if they still can't prove eligibility.\n\nThe best case here is that the first time they filed, it was denied by mistake, and they have been a citizen all along. The fact that they have been working for forever, and that they always clear through eVerify, and that the SS benefits were eventually approved, probably means that AT LEAST they are a permanent resident (but again, no one remembers, has seen, or has ever had to use a green card for this person).\n\nAny ideas or resources you guys might have would be a world of help. Also referrals to a reputable lawyer that might be up for the challenge would also be amazing. Thanks in advance!\n\nTLDR: Older person doesn't know their status. It's a complex tale but all signs point to likely permanent residence or citizenship. Family needs help safely verifying without raising red flags.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "proof of citizenship / naturalization certificate / Real ID"
    },
    {
        "id": "1iec1yz",
        "title": "U.S. Citizenship through father (18+)",
        "score": 0,
        "num_comments": 9,
        "author": "1DanR",
        "created_utc": 1738320187.0,
        "created_readable_utc": "2025-01-31 10:43:07 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iec1yz/us_citizenship_through_father_18/",
        "permalink": "https://reddit.com/r/immigration/comments/1iec1yz/us_citizenship_through_father_18/",
        "selftext": "Hi. Just a quick question, I am 21, was born in the UK, out of wedlock, my father is a U.S. citizen by birth and has spent 5+ years in the U.S most of which before I was born, me my older sister and brother don’t have CRBAs, or a US passport, and would like to apply for first U.S. passports Over 18, we meet all of the requirements, and am I right in thinking that I was automatically given citizenship at birth, and I wouldn’t need a letter of financial support until I was 18 this way would I since I am now over 18 this isn’t needed right? Just want to clarify before I apply as getting his citizenship and physical presence documents should be easy enough, just want to make sure that I am able to apply ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.2,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "UK",
            "state": null
        },
        "sex": null,
        "document": "US passport / CRBA"
    },
    {
        "id": "1iayy3s",
        "title": "Realistically speaking, what are the projections of immigration policies in the near future?",
        "score": 3,
        "num_comments": 36,
        "author": "klutz69",
        "created_utc": 1737949603.0,
        "created_readable_utc": "2025-01-27 03:46:43 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iayy3s/realistically_speaking_what_are_the_projections/",
        "permalink": "https://reddit.com/r/immigration/comments/1iayy3s/realistically_speaking_what_are_the_projections/",
        "selftext": "Specifically thinking about illegal immigration and deportations, as well as expectations for existing pathways to citizenship and potential hurdles for those with permanent residency. \n\nRecent reports show an increase in deportations, raids, and expedited processes. But how many people can really be deported in terms of capacity, given the manpower and logistics available at hand? At some point there will be a plateau. \n\nFor those with temporary stays, due to a refugee status or temporary visa, will there be an end to their legal status? \n\nWhat about permanent residents? I have a ton of family that are permanent residents, many of them through the Reagan Amnesty bill. Not all of them are US citizens, but they have succesfully renewed their residency each time. Is there any chance that renewals will be impacted? \n\nThe narrative is that those here illegally with deportation orders and criminal records will be removed, but as the days pass I see that various other groups are being observed like the potential end to birth-right citizenship. \n\nMany are in fear, although some is due to the media taking things to the extremes. Just like every person of illegal immigrant status is being protrayed as a savage, violent rapist and murdered, those who are here legally are also being told that they will potentially be illegal pretty soon and removed. \n\nThoughts?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.58,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": null
    },
    {
        "id": "1iam4yi",
        "title": "Help with Name Discrepancy Between Mexican and US Documents",
        "score": 1,
        "num_comments": 3,
        "author": "your_boi_leo",
        "created_utc": 1737916140.0,
        "created_readable_utc": "2025-01-26 18:29:00 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1iam4yi/help_with_name_discrepancy_between_mexican_and_us/",
        "permalink": "https://reddit.com/r/immigration/comments/1iam4yi/help_with_name_discrepancy_between_mexican_and_us/",
        "selftext": "I need some advice about a frustrating name discrepancy between my US and Mexican documents.\n\nI have dual nationality (Mexico and USA), but my name is recorded differently on documents from each country:\n\n• On **most of my US documents** (driver’s license, social security card, school records, bank information, etc.), my name is “Leonardo Diaz Garcia,” with **no hyphen**.\n\n• However, on my **US birth certificate**, my last name is written as “Diaz-Garcia” with a hyphen.\n\n• On my **Mexican passport and birth certificate**, my last name is also “Diaz-Garcia” because when I went to register my Mexican birth certificate, the Registro Civil required me to match the name format on my US birth certificate.\n\nHere’s the problem I need advice on:\n\nIn Mexico, you’re supposed to have **two last names**—your paternal last name and your maternal last name. But because of the hyphen, my Mexican birth certificate and other documents now treat “Diaz-Garcia” as a **single hyphenated last name**, instead of showing two separate last names (“Diaz” and “Garcia”).\n\nThis has created a problem getting my Mexican passport because it doesn’t reflect my real name. It also causes confusion since all my other US documents (except my birth certificate) have my correct name, “Leonardo Diaz Garcia,” without the hyphen.\n\nHas anyone dealt with this issue before? Is it possible to have my Mexican birth certificate corrected to reflect two separate last names (Diaz and Garcia) rather than one hyphenated name (Diaz-Garcia)? If so, what’s the process with Mexican authorities?\n\nI’m worried this inconsistency could lead to legal or bureaucratic issues in the future. Any guidance would be greatly appreciated!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.66,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": "Hombre",
        "document": "Mexican passport / birth certificates (US/MX)"
    },
    {
        "id": "1i7ymdk",
        "title": "What I've learned about immigrating to the USA during my long-distance relationship with an American. (Marrying on ESTA / CR1 & IR1 / Sponsorship & Joint Sponsors/ Bona Fide relationship proof) (01.22.2025)",
        "score": 6,
        "num_comments": 2,
        "author": "Gastonium",
        "created_utc": 1737619665.0,
        "created_readable_utc": "2025-01-23 08:07:45 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i7ymdk/what_ive_learned_about_immigrating_to_the_usa/",
        "permalink": "https://reddit.com/r/immigration/comments/1i7ymdk/what_ive_learned_about_immigrating_to_the_usa/",
        "selftext": "I was with an American girl for a good while in my life, we wanted to live together; however, we're from different countries and she has a kid so I ended up agreeing to be the one who moves for the other, as much as I would have preferred to carry on living in Europe; however, it was something I was willing to sacrifice for the woman I loved. During this time, I found myself having a headache trying to navigate confusing resources regarding how we should go about the process of closing the distance between each other. I am making this post to explain some things I've learned to somebody who may be in the same boat I was, a long time ago. We have broken up since and I'm much happier with her out of my life but I have learned valuable information and I wish that a pair of lovers out there can make better use of it than me and my ex were able to.      \n\nMy ex wanted us to get married when I was visiting her in the USA; however, I refused. (dodged a bullet of a lifetime)     \n\nI refused to marry who I thought to be the love of my life, because, as far as I was aware, marrying an American on American soil as an alien requires a K1 Visa; which at the time, we were not able to back financially due to her not meeting the income requirements of being a sponsor. I believed that if I were to visit her and marry her on her whim, I would be committing visa fraud, which carries a long prison penalty and can lead to permanent deportation from the USA. Needless to say, I was wrong.      \n\nI entered the USA on my ESTA, which actually allows you to marry in the United States; however, it is only permissible under the condition that you do not intend to remain in the USA afterwards and will leave within the time period the ESTA allows you to stay for. Later on, marrying in this way may allow your partner to file for you as an immigrant spouse, allowing you two to apply for a CR1 or IR1 green card, assuming your partner is able to sponsor you.     \n\nMy ex was a single mother and unemployed for a majority of the relationship. While it seems reasonable for a single person to be somewhat comfortably able to sponsor a spouse on an average income, the income requirements increase depending on how many dependents the sponsor has. My ex being a single mother made it quite difficult for her to reasonably reach this income level, especially when the job she eventually did find, she'd have to take days off quite often because she had difficulty with securing childcare and the father was absent and wasn't even on the birth certificate and there was no child support settlement so whatever scraps he'd occasionally throw her on cashapp when she came begging wouldn't really count towards her taxed income, making it a non-factor to USCIS.      \n\nWith this in mind, we had to look for a joint sponsor. A joint sponsor can be anybody who is willing to take on the burden of being a sponsor who has the means of sponsoring your spouse. Her mother made just enough to have been able to back the sponsorship; however, another option I had discovered was the ability to have two joint sponsors at once; however, struggled to find much more information on the intricacies of this option. Some resources said that if you are to be sponsored by two people, it must be a pair with joined income, such as a married couple; however, I am unsure to what extent this is true, as information on dual sponsors is difficult to come by online and the resources I did find weren't very specific on how it works. Sponsors may also be able to wager their property, if adequately high in value, to make up for any income requirement shortcomings.    \n\nAdditionally, I would like to go over the bona fide relationship proof process, as I rarely see it being spoken about at its true length. Me and my ex had a genuine relationship, I loved her, I loved her daughter to death, and I loved her family. Having trouble proving your that relationship is genuine will typically not come as much of a problem to real couples, assuming you remain conscious of the process and take the necessary steps together throughout your time together to make sure that nobody can poke holes in your relationship and doubt it. Remember to take many photos together, especially if you are in a long distance relationship like I was. Make sure to save everything that links the two of you together. Save gifts, save letters, save flight tickets, everything you can get your hands on that shows that you two share a past together. You really don't need to overkill it, just show that you two love each other and that this is something serious that has been going on for a fairly long period of time. Forget about hauling ass across the world for a girl you met on discord three days ago, is what I'm trying to get at here.     \n\nYou will need to prove your relationship is bona fide, when applying for a K1 visa, or a CR1/IR1 green card. You do not need to prove your relationship is bona fide, when you enter the USA to marry on an ESTA; however, as far as I am aware, if you disclose this while entering the USA at border control you will be subject to significantly more scrutiny and will likely be dragged to secondary inspection. When I would visit the USA I'd just disclose at the border that I am visiting my girlfriend for the week and despite showing the return flight and asserting I have a life back home I can't just abandon on a whim, without fail, the lovely border officers made sure my ex waits a couple more hours at the airport. I never had an issues at secondary control, though, I'd just show them everything, including our texts planning our week together, and I was let through without a hassle.     \n\nI'd imagine that if you can reasonably prove you are going to return home after marrying on an ESTA you should be fine as well; however, if you've already flown there and spend hundreds if not thousands for the flight, just be low-key and tell them you're visiting your partner. You can just haul ass back home afterwards with a ring on your finger. You can also claim you were proposed to while there and married with no prior intentions in the heat of the moment. Marrying in the USA is pretty easy you can have a civil ceremony for like a hundred bucks but I'm unsure if this varies per state, please do your research based on where you plan to elope exactly. We would have had it pretty easy since it was Montgomery County, Maryland.      \n\nA batshit crazy idea we had at the height of the relationship when we weren't think rationally as madly in-love 20 year olds was her getting pregnant with my child which would make it so she could put me in a situation where I'd have to marry her and the government couldn't take issue with it, effectively allowing us to get quite far ahead at the cost of us having a baby at a point in a relationship where we had no business starting a family and also taking a gigantic risk if she were to be pregnant and I were to be forced to leave the USA. Please never go this route unless you are absolutely desperate or have the means together to raise a child and be sponsored by your spouse. We did not and if we went with this route we'd be ultra fucked because she'd then need to make even more money to be a potential sponsor.      \n\nAll that aside, once you do actually marry, in whichever (documented) way you've managed to, you are now legally their spouse and eligible to potentially be petitioned for a CR1 or IR1 green card. A CR1 (CR = Conditional Relative) is given to a spouse who has been married less than two years and vice versa. CR1 lasts for two years before you need to file an I-175 which, if approved, changes you from a \"conditional relative\" to an \"immediate relative\" (Hence the \"IR\"). While doing this, you will, once again, need to prove that you and your spouse are in a bona fide relationship but this time you should come fully stacked with everything you can to prove you two have a life together. Joint bills, joint bank account statements, proof of living together, pictures together, and the most effective evidence, birth certificates of any children you may have had together while living together in the USA. Once you are converted from CR1 to IR1 you have a green card which is valid for 10 years before needing to be renewed. This gives you more than enough time to become a naturalized citizen of the United States of America and finally be able to relax and not have to fear getting fucked over by USCIS. All the best.      \n\nI also apologise for any typos, I'm writing this on a late night, unable to sleep and wanted to share my findings to tire myself out mentally",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.69,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "Europe",
            "state": null
        },
        "sex": null,
        "document": "ESTA / K1 / CR1 / IR1 / Green Card"
    },
    {
        "id": "1i66jj5",
        "title": "Can anyone help with this?",
        "score": 0,
        "num_comments": 6,
        "author": "Clean-Park2333",
        "created_utc": 1737421391.0,
        "created_readable_utc": "2025-01-21 01:03:11 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i66jj5/can_anyone_help_with_this/",
        "permalink": "https://reddit.com/r/immigration/comments/1i66jj5/can_anyone_help_with_this/",
        "selftext": "    80% of my family is American, my dad is American, my grandfather is, my grandmother, uncles, aunts and cousins, I am of legal age and I no longer depend on an adult and my parents decided to give birth to me in MEXICO and I only count With the American visa, how can I get support to obtain my American citizenship or some permanent residence or work permit?\n    Or if you know the best process to do it, it would be very helpful since I read that joining the ARMY will no longer help you at all.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Donald Trump",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "citizenship / permanent residence / work permit"
    },
    {
        "id": "1i58s7t",
        "title": "For US naturalization, does \"processing time\" encompass time from application to oath, or just application until interview? And other N-400 process questions.",
        "score": 2,
        "num_comments": 3,
        "author": "BrazilianTinaFey",
        "created_utc": 1737320106.0,
        "created_readable_utc": "2025-01-19 20:55:06 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i58s7t/for_us_naturalization_does_processing_time/",
        "permalink": "https://reddit.com/r/immigration/comments/1i58s7t/for_us_naturalization_does_processing_time/",
        "selftext": "Hello. I will apply for naturalization later this year and have a few questions about general process:\n\n1. The center closest to me has an average processing time of 8 months. Does that mean that, on average, from application to oath it takes 8 months, or just until interview/test?\n2. After you apply and before you get the citizenship, are there any limitations to when you may or may not leave the country, like with the greencard processing?\n3. Do they take your green card once you're approved for citizenship but before you have your passport?\n4. After the oath, given a positive outcome, what are the next steps? I'm assuming getting a US birth certificate and passport, anything else? How long does that take usually?\n5. If there are multiple service centers in my metro area, can I pick which one to apply to or must it be the closest one?\n\nThank you",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "N-400 / naturalization"
    },
    {
        "id": "1i4m5ie",
        "title": "Process to get Mexican citizenship. Received U.S citizenship after 1998.",
        "score": 0,
        "num_comments": 3,
        "author": "MariCPR",
        "created_utc": 1737248000.0,
        "created_readable_utc": "2025-01-19 00:53:20 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i4m5ie/process_to_get_mexican_citizenship_received_us/",
        "permalink": "https://reddit.com/r/immigration/comments/1i4m5ie/process_to_get_mexican_citizenship_received_us/",
        "selftext": "Hi all! I was born in Mexico in 1997 but obtained my U.S. citizenship in 1999 aftermy step dad, a U.S citizen, brought me over. I know that the 1998 \"Mexican Nationality Law,\"allows Mexican citizens to hold dual citizenship. What would the process for reinstating my Mexican Citizenship and receiving my Mexican passport look like? It looks like I need a valid ID (my U.S. passport), Mexican birth certificate and the last document is the one I'm not sure about. Would I need a naturalization certificate with an apostille? If so where do I obtain the certificate and the apostille?\n\nIf you can include links that would be helpful. I live in Seattle so I know the Mexican consulate is in Caphill. Where would I go to make an appointment once I have all the proper documents?\n\nThank you and sorry for all the questions. I just finally decided to go ahead and really look into it.\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": "Washington"
        },
        "sex": null,
        "document": "Mexican Citizenship / Mexican passport / naturalization certificate / apostille"
    },
    {
        "id": "1i26c3l",
        "title": "Someone ik Trying to get a ID and setup for the future",
        "score": 0,
        "num_comments": 30,
        "author": "Gobnem",
        "created_utc": 1736971336.0,
        "created_readable_utc": "2025-01-15 20:02:16 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1i26c3l/someone_ik_trying_to_get_a_id_and_setup_for_the/",
        "permalink": "https://reddit.com/r/immigration/comments/1i26c3l/someone_ik_trying_to_get_a_id_and_setup_for_the/",
        "selftext": "\nFriend asked me to post the following. \n \n“I Was born in Mexico. When I was born my father was a u.s citizen (giving me Derivative Citizenship). My father remained in America while my mom gave birth in Mexico, because of this my mom failed to mark my dad as a u.s citizen on my birth certificate (she was unaware she was supposed to). With both my parents being marked as Mexican citizens on my birth certificate it couldn't have been converted to an  American birth certificate without out proof of a parent being a u.s citizen at the time I was born. I managed to be able to get a real SSN but using my high school transcript (as an ID) and my father social security number as proof he's an American citizen (giving me Derivative Citizenship) I was able to use my social security number and school transcript to get a job. Now the only issue I have is that I need a license and a real American id but I am not able to get that with a high school transcript. But I have no other form of id. My dad is no help bc he dosent want to spend money or I ask for him to do things to help but he doesn’t. If he had the proper forms still (he lost them) we could get the Mexican Birth certificate to become a U.S one. My question is, does anyone know of a way for me to get a license or an ID to get a license?”\n\nEdit: forgot to mention she was brought to the US illegally as a baby.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.3,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "ID / driver's license / birth certificate (US)"
    },
    {
        "id": "1hikgk0",
        "title": "Transit ESTA After exceeded time in Mexico",
        "score": 0,
        "num_comments": 7,
        "author": "Astral_Cooker",
        "created_utc": 1734703444.0,
        "created_readable_utc": "2024-12-20 14:04:04 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1hikgk0/transit_esta_after_exceeded_time_in_mexico/",
        "permalink": "https://reddit.com/r/immigration/comments/1hikgk0/transit_esta_after_exceeded_time_in_mexico/",
        "selftext": "I entered the U.S. on October 15 and plan to leave for Mexico on January 10, which is about 85 days. After spending 45 days in Mexico, my total time in the U.S. and neighboring countries will add up to around 130 days.\n\nHowever, it’s significantly cheaper for me to fly back to my home country (Australia) by exiting through the U.S. My concern is whether I could face issues at the border when re-entering the U.S., given that my \"total time\" in the U.S. and nearby regions exceeds 90 days.\n\nDoes anyone have experience with this? Could this impact my eligibility for a travel visa or re-entry? Any guidance would be appreciated.\n\nMy thought is that as i am not looking for a Visa waiver and just want to transit, the border patrol may allow it as it's not time in the USA, although i understand it could be different in practice.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "ESTA / visa"
    },
    {
        "id": "1ha3kel",
        "title": "Marry in US or Mexico",
        "score": 0,
        "num_comments": 5,
        "author": "JH2856_1122",
        "created_utc": 1733725535.0,
        "created_readable_utc": "2024-12-09 06:25:35 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ha3kel/marry_in_us_or_mexico/",
        "permalink": "https://reddit.com/r/immigration/comments/1ha3kel/marry_in_us_or_mexico/",
        "selftext": "Hello all, I am looking for advice. I intend to marry my girlfriend and I believe the spousal visa to be the best path, but I am not sure where we should Marry.\n\n-she is Mexican and is in Mexico currently.\n\n-she has the b1/b2 travel visa to be able to visit here up to 6 months\n\n-she spent august-november here with me, I spent 17 days there in two trips there.\n\n-she has no criminal or other issues that would come up during immigration.\n\n-she is pregnant and due in late June\n\n-I am traveling there later this month (december) and she is traveling here on January 20th.\n\nI am wondering if it is best to complete marriage paperwork while I visit mexico in december, or if waiting until January would be best.\n\nThe biggest goal is to have her here in June for the birth.\n\nThank you all!",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.38,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": "Hombre",
        "document": "spousal visa / B1/B2 visa"
    },
    {
        "id": "1h5ftw8",
        "title": "How likely is it we will have baby passport by December 15th?",
        "score": 0,
        "num_comments": 2,
        "author": "ConsistentTrifle3685",
        "created_utc": 1733202205.0,
        "created_readable_utc": "2024-12-03 05:03:25 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1h5ftw8/how_likely_is_it_we_will_have_baby_passport_by/",
        "permalink": "https://reddit.com/r/immigration/comments/1h5ftw8/how_likely_is_it_we_will_have_baby_passport_by/",
        "selftext": "Birth happened 15 days ago. Will have birth cert of baby in a week. Still getting docs on physical presence.  Used US family member's address for transcripts and W2. Shipment scheduled to arrive Friday. Family member sent me pics of docs. Country: India\n\nQuestions: Can I upload to eCRBA? How long does emergency appt take to schedule? What is emergency mean in this context? If given emergency appt before docs arrive can we still get emergency passport? Am cit born and raised in US.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.25,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "India",
            "state": null
        },
        "sex": null,
        "document": "baby passport / eCRBA / proof of physical presence"
    },
    {
        "id": "1h1mjmp",
        "title": "Complicated case- looking for advice ",
        "score": 3,
        "num_comments": 2,
        "author": "Sdubin25",
        "created_utc": 1732763725.0,
        "created_readable_utc": "2024-11-28 03:15:25 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1h1mjmp/complicated_case_looking_for_advice/",
        "permalink": "https://reddit.com/r/immigration/comments/1h1mjmp/complicated_case_looking_for_advice/",
        "selftext": "For the sake of the case I will call her Jane.\n\nJane came to the US in 2011 at 6 years old. She arrived with refugee status with her family. In the following years, children services became involved as concerns for neglect were mounting. Long story short, she was put into foster care, and later adopted by myself. She was adopted through the court system and came to me with no paperwork. I was given an adoption decree and a new birth certificate with us listed as her parents. However the birth certificate says that it is not proof of citizenship. After an extended legal battle, I was finally awarded a permanent resident green card for Jane with a retroactive date back to 2011. How do I proceed to obtain a US passport for her?  Her legal parents are both citizens of the USA, she has her green card and a birth certificate as well as a state issued ID. Just trying to figure out next steps for her to be able to travel, abroad, god willing.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.8,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "US passport / green card / birth certificate"
    },
    {
        "id": "1gvjmmg",
        "title": "Mexico/US Dual Citizenship",
        "score": 0,
        "num_comments": 7,
        "author": "smalltalkor",
        "created_utc": 1732085347.0,
        "created_readable_utc": "2024-11-20 06:49:07 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1gvjmmg/mexicous_dual_citizenship/",
        "permalink": "https://reddit.com/r/immigration/comments/1gvjmmg/mexicous_dual_citizenship/",
        "selftext": "So, with everything that’s gone on this month politically in the US, me and my partner are looking into potential countries to move to.\n\nMy father immigrated to the US from Mexico at some point in the 80s. We are estranged, so I don’t know all of the details but I know he obtained his green card.\n\nAm I able to apply for dual citizenship if I do not know all of his information/don’t have access to his birth certificate? I did try to look up his birth certificate on the Government of Mexico website but didn’t find anything. He was born in a very small village in Durango in the 60s, so I’m not sure what that legal process was like.\n\nAlso, I am trans and legally changed my name a few years ago. I have both my old and new birth certificates. Would this also cause an issue? \n\nAny help is appreciated! ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.38,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "Mexican dual citizenship / birth certificates"
    },
    {
        "id": "1g7gqr8",
        "title": "VERY CONFUSED on CRBA and physical presence.",
        "score": 0,
        "num_comments": 17,
        "author": "Silent-Sentence-9563",
        "created_utc": 1729366404.0,
        "created_readable_utc": "2024-10-19 19:33:24 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1g7gqr8/very_confused_on_crba_and_physical_presence/",
        "permalink": "https://reddit.com/r/immigration/comments/1g7gqr8/very_confused_on_crba_and_physical_presence/",
        "selftext": "I've read the directions for the CRBA and I am quite confused. \n\nThe CRBA form says to list \"precise periods of time in the United States.\" How does the US government expect you to remember the exact day you returned to the US if you took multiple foreign trips as a kid and you don't have your old passports?\n\nDuring summer vacation in elementary and middle school, I would sometimes go overseas to visit family. I don't remember which specific years I went overseas and which I didn't. Neither do my parents. \n\nSince the form asks for \"precise periods of time in the United States\" as opposed to estimates, I am a bit uncomfortable with swearing that everything is correct, given the uncertainty around the exact dates I was in the USs. Instead, can I just write a statement on a separate sheet of paper saying something like\n\n> Declaration on physical presence\n\n> I, u/Silent-Sentence-9563, born on MM/DD/YYYY in _________, _______, USA with United States passport number XXXXXXXXX declare:\n\n> 1. I physically attended elementary, middle, and high school in _____, _______, USA for the academic years 20XX-20XX as evidenced by my attached school transcripts. As my state mandates that students have 180 days of instructions, I estimate I was physically present for a total of at least 1620 days in the United States between 20XX-20XX academic years and at least 540 days in my 10th, 11th, and 12th grade academic years.\n> 2. I attended University1 in _______, ______, USA for the academic years 20XX-20XX as evidence by my attacheed  transcripts from University1. This university has two semesters in one academic year and 18 weeks per semester. Thus, I estimate I was physically present in the United States for a total of at least 720 days during the academic years of 20XX-20XX.\n> 3. I attended University2 in _______, _______, USA for the academic years 20XX-20XX as evidenced by my attached transcripts from University2. This university has two semesters in one academic year and 18 weeks per semester. Thus, I estimate to have been physically present in the United States for a total of at least 180 days during the academic years of 20XX-20XX.\n> 4. Thus, I estimate I have been physically present for at least 3060 days in the United States before MM/DD/YYYY which is the date of birth of my child, ________. \n> 5. Of the aforementioned 3060 days, 1440 days were after MM/DD/YYYY which is my 14th birthday.\n> 6. My attached immunization records and tax transcripts for the calendar years 20XX-20XX provide further evidence of my physical presence in the United States before the birth of my child ________.\n\n> I declare under penalty of perjury under the laws of the United States of America that the foregoing is true and correct. Executed on MM/DD/YYYY.\n> Signature\n\nAlso what sort of questions will be asked at the interview?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": "CRBA / proof of physical presence"
    },
    {
        "id": "1g2b3tl",
        "title": "Should I give birth in Mexico or the US? ",
        "score": 0,
        "num_comments": 43,
        "author": "SpecialistBowler8163",
        "created_utc": 1728770807.0,
        "created_readable_utc": "2024-10-12 22:06:47 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1g2b3tl/should_i_give_birth_in_mexico_or_the_us/",
        "permalink": "https://reddit.com/r/immigration/comments/1g2b3tl/should_i_give_birth_in_mexico_or_the_us/",
        "selftext": "I recently found out I'm pregnant and I've been doing some research to determine whether I should give birth in Mexico or the US. I was born and raised in the U.S. for 22 years and moved to Mexico in 2022. My child will be born in wedlock to a U.S. citizen and a Mexican citizen. They say that as long as I lived in the US for 5 years, or 2 years after the age of 14, my child MAY get citizenship. Should I really risk it and see if my child MAY get citizenship or is it a guarantee that my child will get citizenship through me if born in Mexico?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.26,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Mujer",
        "document": "citizenship"
    },
    {
        "id": "1fu2y55",
        "title": "Possible difficulty with citizenship application?",
        "score": 0,
        "num_comments": 5,
        "author": "Responsible-Self1647",
        "created_utc": 1727827170.0,
        "created_readable_utc": "2024-10-01 23:59:30 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fu2y55/possible_difficulty_with_citizenship_application/",
        "permalink": "https://reddit.com/r/immigration/comments/1fu2y55/possible_difficulty_with_citizenship_application/",
        "selftext": "I am posting for a friend \n\nI entered the US from Mexico before the age of 5 and have had my paperwork (Green card) for years. \n\nLast year, I went on a vacation to Mexico. When I returned to the US, I was pulled aside and given a notice of removal. Two arrests I had from twenty years ago showed up on my record; I pled no contest to a DUI and cannabis possession. \n\nMy court date for the removal is a couple of years away. A few of my closer family members have decided to apply for citizenship, and I decided to apply too. \n\nI know I can still apply for citizenship, but do you think the prior arrests will negatively impact my application? My relatives’ applications? Should I hire a lawyer? \n\nThanks in advance. ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "citizenship application / N-400"
    },
    {
        "id": "1ft5t1u",
        "title": "Flying with two passports between Mexico and the US",
        "score": 8,
        "num_comments": 13,
        "author": "FootSpiritual",
        "created_utc": 1727728353.0,
        "created_readable_utc": "2024-09-30 20:32:33 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1ft5t1u/flying_with_two_passports_between_mexico_and_the/",
        "permalink": "https://reddit.com/r/immigration/comments/1ft5t1u/flying_with_two_passports_between_mexico_and_the/",
        "selftext": "I have been trying to understand the best way to travel with my two passports. Here's my explanation of why I would do that and the things I don't understand. \n\n  \nFirst of all, I am an US citizen by birth, and a mexican citizen by right (mexican parents). I have lived all of my life in México. In the past, when I have left Mexico with my US passport, Mexican immigration charges me a fine for having remained as an American citizen for more than six months. \n\nThe thing is I want to avoid that fee, and I just got my mexican passport with that purpouse in mind. \n\n  \nMy US passport has only one surname (my dad's surname), while my mexican passport has two of them (dad's and mom's).\n\n1. Am I able to book my flight using my mexican passport so I can leave mexico as a mexican citizen, and enter  to  the US with my US passport? \n\n2. Will they ask me for my US passport at the airline in mexico? \n\n3. Will that discrepancy between surnames be a problem? \n\n4. Let's say I leave the US and flight on the US passport. I fly to Mexico. Do I have to enter Mexico with the passport used on my flight (the US one), or I am able to use my mexican one? \n\n  \nThanks in advance for your responses, and I hope you excuse me for my broken english. \n\n  \n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.91,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "US passport / Mexican passport"
    },
    {
        "id": "1fsks68",
        "title": "My brother is a us citizen at birth and is trying to make his 5/o daughter a citizen but she is in Mexico and has a Mexican mother….",
        "score": 5,
        "num_comments": 17,
        "author": "kargra",
        "created_utc": 1727661818.0,
        "created_readable_utc": "2024-09-30 02:03:38 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fsks68/my_brother_is_a_us_citizen_at_birth_and_is_trying/",
        "permalink": "https://reddit.com/r/immigration/comments/1fsks68/my_brother_is_a_us_citizen_at_birth_and_is_trying/",
        "selftext": "Help! we are trying to figure out if my brother qualifies for a CRBA for his daughter. He is turning 25 soon and his kid is 5 in which the mother is Mexican and they never got married. We looked into this form but it says something about him needing to qualify for certain residency time as a requirement. Now we moved to Mexico when he was 3 and he crossed by land back to the USA around 2018 when the mother of his child was pregnant. He’s  been in the USA since, and he has only been out to visit a short period of time and comes back to the US. We contacted a lawyer but she said they don’t work on those cases so she is not entirely sure. The lawyer said we must read the law and do research on our own, but it is so confusing and now we do not know if he qualifies or if he sends over the  DS-5507 to the consulate and doesn’t qualify will his child or him be penalized? Can that jeopardize the kids chance of citizenship? Or if anyone is familiar with the requirements Do they qualify for the  CRBA? \nPlease and thank you anyone ",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.65,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "CRBA / DS-5507"
    },
    {
        "id": "1fpwb1s",
        "title": "Mexican Consulate will not grant me INE or Passport because I did not use maternal last name on Mexican Birth Certificate ",
        "score": 2,
        "num_comments": 14,
        "author": "Alternative-Ease3116",
        "created_utc": 1727357616.0,
        "created_readable_utc": "2024-09-26 13:33:36 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fpwb1s/mexican_consulate_will_not_grant_me_ine_or/",
        "permalink": "https://reddit.com/r/immigration/comments/1fpwb1s/mexican_consulate_will_not_grant_me_ine_or/",
        "selftext": "I am a US citizen living in Ireland, and I’ve been granted Mexican citizenship by descent through both Mexican parents. I have my Mexican birth certificate, both parents names and birth dates are correct, but because I did not use my mother’s last name along with my father’s then the consulate said this is an issue and they need to speak with Mexico City about what to do about this. \n\nI’m 100% sure that I’m not the only one with only my father’s last name as I’ve been raised in US and every single document I have only has my father’s last name. This would also have conflicting issues with my current EU immigration if I was to suddenly have dual citizenship documents with a second last name different to what I’m currently registered with now. The embassy has been cooperative, but with no real time frame in sight when we can find a solution. \n\nIs there anyone here who has seen or heard a similar situation? \n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.67,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Ireland",
            "state": null
        },
        "sex": null,
        "document": "Mexican INE / Mexican Passport / Mexican Birth Certificate"
    },
    {
        "id": "1fpnea3",
        "title": "CRBA for a child of naturalized citizen?",
        "score": 2,
        "num_comments": 9,
        "author": "desertgem_7887",
        "created_utc": 1727322606.0,
        "created_readable_utc": "2024-09-26 03:50:06 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fpnea3/crba_for_a_child_of_naturalized_citizen/",
        "permalink": "https://reddit.com/r/immigration/comments/1fpnea3/crba_for_a_child_of_naturalized_citizen/",
        "selftext": "I was born in Mexico and moved to the U.S. when I was 8 years old and my family and I got a green card. In 2015, when I was 21 I became a U.S. citizen through naturalization. I lived in the U.S. until 2021-2022 when I moved to a border town in Mexico and continue working remotely for a U.S.-based company. My fiancée is pregnant and we are considering our options of either having the baby in the U.S. or here in Mexico. Can I request a CRBA for him through the Consulate if I'm naturalized? Are there any risks if we go this route? What kind of documentation should I submit? My fiancee only has a tourist visa and we are trying to avoid any hassle of her giving birth in the U.S. if possible.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": "Hombre",
        "document": "CRBA"
    },
    {
        "id": "1fphok1",
        "title": "Falsely claiming to be a US citizen while being a minor?",
        "score": 0,
        "num_comments": 16,
        "author": "silveeea",
        "created_utc": 1727304718.0,
        "created_readable_utc": "2024-09-25 22:51:58 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fphok1/falsely_claiming_to_be_a_us_citizen_while_being_a/",
        "permalink": "https://reddit.com/r/immigration/comments/1fphok1/falsely_claiming_to_be_a_us_citizen_while_being_a/",
        "selftext": "Any hope? This is unfortunately my situation. I have been living in the US as an immigrant since i was 3 years old. I exited the USA and into my birth country (Mexico) at the age of 15, not by choice. At the age of 16 tried to come back into the US with a birth certificate from a US citizen which was given to me to cross. I was caught and taken into immigration custody. Since i was a minor i was released back into the US and my custody was given to my parents and i received a I-94. I requested my FOIA last month and was going through it and it does say that i falsely and verbally declared i was a US citizen with documents that weren’t mine. It also says that when i was taken in to give my statement i freely and voluntarily admitted the truth and said to be a citizen of Mexico. This was 12 years ago, i’m now 29 married to a USC. Any hope for me?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.38,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": null
        },
        "sex": null,
        "document": "false claim to citizenship / adjustment of status"
    },
    {
        "id": "1foupej",
        "title": "Question on constructive retention",
        "score": 0,
        "num_comments": 8,
        "author": "Sensitive_Taro7589",
        "created_utc": 1727233283.0,
        "created_readable_utc": "2024-09-25 03:01:23 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1foupej/question_on_constructive_retention/",
        "permalink": "https://reddit.com/r/immigration/comments/1foupej/question_on_constructive_retention/",
        "selftext": "Based on a previous post, would you say it’s a waste of time and money to seek out a lawyer like Shusterman to know if I have a case?\n\nIn short, US citizen mother born in the US to US citizen mother, they all moved to Mexico when she was around 2 years old, but visited often due to family (grandparents also US citizens).\n\nThe last time she was there was in 1980, took a year of High School, then never went back. For some reason that continues to puzzle me, she never had a SSN or US passport, only a border crossing ID that’s no longer used. \n\nShe married, had children (me) and filed for a US visitor visa which she received and even renewed despite the fact she was a citizen all along. I got her birth certificate and had her request a passport at a consulate (with much resistance, she thought she would get her visa revoked because if they thought it was a fraud) almost 4 years ago. By that time, my siblings and I were over 21, we missed our chance to get a green card as IR and many opportunities to get citizenship like the Child Citizenship Act of 2000. My mother failed to act on grounds of ignorance, but my siblings and I have to deal with the consequences.\n\nDo I have a case? I think not, but I can prove it was not in bad faith as the US consulate nor anyone even knew my mother was a citizen so her initial visitor visa should have been declined. Such notice would have prompted her to act. I believe she thought she had lost citizenship by marrying, but honestly, I don’t know what she thought back then.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.33,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": "citizenship / constructive retention"
    },
    {
        "id": "1fm2tc1",
        "title": "US birth abroad; painful",
        "score": 2,
        "num_comments": 21,
        "author": "danjonwig",
        "created_utc": 1726924674.0,
        "created_readable_utc": "2024-09-21 13:17:54 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fm2tc1/us_birth_abroad_painful/",
        "permalink": "https://reddit.com/r/immigration/comments/1fm2tc1/us_birth_abroad_painful/",
        "selftext": "Am not looking for advice, so much as commiseration.\n\nMy wife is American, and I'm not. We live outside the US. We have 3 kids. I registered the first 2 kids' births at the consulate (CRBA), and subsequently got their passports. Kid 3 was born during Covid, so I did it in the opposite order; we got his passport without the CRBA. Now, I am finally getting the paperwork together to apply for his report of birth abroad. I know, this is not technically needed given that he already has his US passport, but there are certain bureaucratic contexts in which I have found it useful to have the CRBA in addition to the passports for the other kids.\n\nThe [state.gov](http://state.gov) website, the passport application process, and the consular staff have frequently disagreed with each other about the requirement re US presence. They frequently use \"presence\" and \"residence\" interchangeably. Given this, when I applied for kiddo #1, I prepared two versions of the form in advance of our visit. The first listed the periods my wife lived in the US (easy: a single period right up to the time I whisked her away in her 20's). The second listed the periods my wife was physically present in the US. This second form was painful to assemble, because she was on a team that represented the US at international competitions from the time she was an early teen. She travelled internationally ALL THE TIME. Plus, we travel to the US frequently for business. That form had more than 30 \"periods of presence\" in the US. I used her passport stamps and the results of a freedom of information request to DHS to get her travel history as best I could.\n\nI showed both forms to the consular staff, and asked them which one they wanted. The fellow laughed at me, and took the shorter form.\n\nFor kid #2, I brought only the shorter form.\n\nWhen applying for passport for kind #3, I sent only the shorter form. They sent a follow-up requesting more information, which again conflated residence and presence, and we pointed this out via a letter, and they eventually issued the passport. No problem.\n\nNow I'm finally getting around to applying for CRBA for kid #3. Now, they have a fancy web interface. Now, THAT form does NOT conflate presence and residence. In fact, they explicitly give an example of a person taking a brief trip ending one period of presence, and beginning another.\n\nKid #1 is 7 years older than kid #3, so I now have to assemble another 7 years worth of travel history. I'd bet there will be another 20 or 30 trips to the US, some as short as a couple of hours, e.g. to apply for kid #3's passport (had to do this at a post office). One trip literally lasted only 30 minutes to do a Nexus interview. Obviously we don't count the times spent in the water over the border without landing, or in US airspace with origin and destination airports outside the US. But this is all so dumb.\n\nThis web form is PAINFUL. You can't type the dates, you have to click around in a horrible UI. You can't type the name of a state like a normal drop-down box.\n\nI'm told there's now a web portal where I can get her travel history from DHS, so at least I may not have to file another FOA request.\n\nI yell to the universe: the US law requires only a certain minimal amount of time in the US at particular life periods in order for kid #3 to qualify for US citizenship. Her period of physical presence #1 covers that requirement. Every piece of data entry, which will likely take a whole day, is not actually needed to satisfy this law. But, the form (but not the law) requires every period of presence up to the birth of the kiddo. So none of this data entry is actually necessary.\n\nNo doubt others on this forum have far more painful experiences. and this may land poorly. But on the off chance this can be a source of commiseration, thank you in advance for your warm wishes :)",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.54,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": null,
        "sex": "Hombre",
        "document": "CRBA / proof of physical presence / passport"
    },
    {
        "id": "1fj5zp3",
        "title": "Thoughts on state and county-level invitations for US immigration?",
        "score": 0,
        "num_comments": 12,
        "author": "Delicious-Shop-8173",
        "created_utc": 1726595721.0,
        "created_readable_utc": "2024-09-17 17:55:21 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fj5zp3/thoughts_on_state_and_countylevel_invitations_for/",
        "permalink": "https://reddit.com/r/immigration/comments/1fj5zp3/thoughts_on_state_and_countylevel_invitations_for/",
        "selftext": "Hello!\n\n I have been thinking about how each region and locality of the US could be allowed to select (with flexible requirements and own rules for rejecting/accepting) and get more people to work and live as they need. Of course, this is given only when decision on its acceptance is given by the federal government. Also, depending on each program's rules, nominees could be able to bring their spouses and single children under 21 without any derivative dependents (if not, probably some nonimmigrant visas should be made widely available not for just the proposed pathway nominees, but for all LPR in general).\n\n So, my proposal would allocate 500-1000 nominees each year (maybe same flat limit for each state or varying per state population) to each US state, so that they can run their programs and fill in some crucial vacancies as needed. The unused part would not propagate further to any immigration path. Each state would be running an official website with all the info and terms.\n\n Next, each county and county-equivalent, as well as each Native American reservation would be getting 30-100 (allocation options as for states) slots each year for selecting and putting immigrants how and where they want. Additionally, states or feds (for reservations) could add some limited number of add-on allocation numbers for discretion of these 2nd level administrative units. Plus, they could simplify finding info about them by adding it to the state's website they are located in. Reservations could be all demonstrating their programs in another website. As an optional feature, in case approved by USCIS and DOL, when applicable, the localities could transfer their limits to one another, but none of them could get transferred more than their original limit.\n\n The character of each nomination could be contractual, with possible terms of first living in the specified place/area and working in a certain occupation or field for up to 5 years, separate terms of renewability of nonimmigrant \"bridge\" visas, although eventually every nomination would need to be allowing LPR if no serious deviations are seen. Further, to accommodate dependent family members in case needed, exceeding the limit by up to 10% for county, county-equivalent, and reservation programs each year could be allowed with the withdrawal of that number from either own local nomination limit or state limit, as agreed by respective authorities.\n\n Further, given meeting some federal standards for entry clearance, the state or local government-appointed personnel would approve or reject case-by-case every application (say, a video-call or in some cases even some live meeting with some representation-authorized persons outside US could be allowed). That approval then becomes the basis for going to the consulate/embassy to get nonimmigrant \"bridge\" visas or immigrant new arrival visas; and similarly in USCIS offices in the US. I think the administrative units must be free to limit eligibility by country of birth/citizenship, but never by religion (of course excluding radical beliefs), race, or ethnicity. Some more details would need to be determined as well, of course.\n\n In summary, this outline would have these programs invite up to 25-50 thousand people annually for states, and 104,040-348600 for 2nd level administrative units; a cumulative total is 154,040-398,600. I am pretty sure that if enacted, these limits would not be used by even 80% that often. Some measure of staged introduction (lower limits in the first few years) could be used as well. Also, required are specific universal, but not too hefty regulations for employers and organizations that co-operate with these state and local immigration programs.\n\n Please, consider writing your opinion about this. I think the higher-end limit is too much, if utilized close to full capacity.\n\n  \n TL;DR: I have an outline of a would-be immigration system that would, with a cumulative annual limit of 154 to about 400 thousand people yearly, allow US states, counties, county-equivalents, and Native American reservations nominate people for immigration.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.23,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": null
    },
    {
        "id": "1fhfv4z",
        "title": "Passport ",
        "score": 1,
        "num_comments": 4,
        "author": "mission1complete",
        "created_utc": 1726415876.0,
        "created_readable_utc": "2024-09-15 15:57:56 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1fhfv4z/passport/",
        "permalink": "https://reddit.com/r/immigration/comments/1fhfv4z/passport/",
        "selftext": "Does anyone know ? If when a passport gets issued through the US embassy’s in Mexico City does USCIS get notified of said passport being issued ? I was given citizenship through the derivative process from the born out of wedlock law before the 2017 change . Will I need to report to immigration ?",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.6,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": "Mexico City"
        },
        "sex": null,
        "document": "US passport / derivative citizenship"
    },
    {
        "id": "1faoo02",
        "title": "Does this undoubtedly mean my brother is an immigrant?",
        "score": 0,
        "num_comments": 12,
        "author": "Upstairs_Engine_2983",
        "created_utc": 1725653300.0,
        "created_readable_utc": "2024-09-06 20:08:20 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1faoo02/does_this_undoubtedly_mean_my_brother_is_an/",
        "permalink": "https://reddit.com/r/immigration/comments/1faoo02/does_this_undoubtedly_mean_my_brother_is_an/",
        "selftext": "I am sorry if this is against the rules. I don't know Reddit but I'm not getting answers anywhere else.\n\nMy parents are from Mexico but I believe got amnesty in the 80s though I'm fuzzy on the details. Regardless, they absolutely are naturalized and they told me and my four siblings that we were all born here in Texas and are 100% American citizens. I personally have never had any issues and my siblings, minus the brother in question, have said the same. We have gotten copies of our birth certificates, social security cards, gotten drivers licenses and passports with no issue other than the usual annoyances of those processes. We've had jobs without issue.\n\nSo, anyway, my oldest brother has gotten into some bad trouble over theft and burglaries and apparently there's an immigration attorney involved.\n\nI asked my parents about it and they said it was just a mistake, that he was racially profiled but I looked up his court documents and it comes up a lot. \n\nIt says WORK_WITH_IMMIGRA_ATTY on many of these documents and I'm thinking it's not a mistake if it's multiple times on multiple dates. And that's what I'm asking for clarification on.\n\nIs it at all possible that it was a mistake? Could there be any reason an immigration attorney would consult with a citizen? If not, does this necessarily mean he's undocumented? He was born in 1985 and it is my understanding that children at the time were also naturalized but could there be some issue there?\n\nI'm sorry if I sound naive, ignorant, or desperate. Up until this point, I honestly had no reason to be knowledgeable about immigration. My family is heavily Americanized. We never spoke Spanish in the house (I don't know it at all!) and my parents unfortunately have an \"above it all\" mentality about our Mexican heritage, which always made me somewhat uncomfortable but that's another story for another day.\n\nI can't understand why he would have that on there if he is a citizen. I don't know why he wouldn't be a citizen in the first place or why he didn't become one by now if he wasn't.\n\nIt doesn't make sense and my parents are very tight-lipped about it. They have boxed us out completely on the subject and I apparently can't contact my brother in jail because I'm not on his list.\n\nI just know they're more worried than I've ever seen them in my life. My mom barely eats and just stays in bed all the time. My dad retired in 2019 but started working again because of the legal expenses. Maybe it's just the 5-10 years he's likely facing in prison but given everything else, I have this gut feeling that it's a lot more than that.  They're both so tired and I fear this will kill them, honestly, but they're boxing everyone out and won't let us help. Or maybe we can't do anything.\n\nThis has been a very troubling experience and I need to do something about this impending feeling of doom I have. \n\nAny help on this is appreciated.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.4,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "USA",
            "state": "Texas"
        },
        "sex": null,
        "document": "immigration status verification"
    },
    {
        "id": "1f9oclf",
        "title": "Applying for citizenship as person born abroad, over 18 years of age",
        "score": 0,
        "num_comments": 16,
        "author": "dirtynikeairs",
        "created_utc": 1725547929.0,
        "created_readable_utc": "2024-09-05 14:52:09 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1f9oclf/applying_for_citizenship_as_person_born_abroad/",
        "permalink": "https://reddit.com/r/immigration/comments/1f9oclf/applying_for_citizenship_as_person_born_abroad/",
        "selftext": "Good Afternoon, r/immigration, \n\nBasically, the title summarizes it pretty well. I am 22 years old, having been born and raised in Germany to an American father and German mother. I am fairly certain I did not automatically obtain citizenship at birth due to my dad not meeting the residency requirements (5 years in total LIVING in the US, with two of the years being completed after the 14th birthday). He never filed a CRBA, or form N600K. Still, he is a US citizen, having and having kept ONLY the US Citizenship (despite living in Germany for close to 50 years).\n\nMy Grandfather, however, would very much be meeting the requirements (He lived in the USA for about 40 years before my Dad was born, and about 5 years just after), and as stated in the Instructions for form N600K, this would also count, given I can prove my Dads dependency on my Grandpa (which I also can). The problem here is that I am now over 18 years of age, which means form N600K doesn't apply to me anymore. Another important factor would be that my grandpa was in the Air Force for a pretty long time, with this also being the reason for him moving to Germany 5 years after adopting my Dad. We have multiple files documenting his service and exceptional performance during these years, on North American AND \"foreign\" US soil (\"Foreign\" as in the barracks here in Germany).\n\nI am currently residing in Germany, but I'm very much planning on moving to the US sooner than later. I believe I do have everything it should take to be granted citizenship / prove I am eligible for citizenship, my only REAL issue is the fact that theres no Form to fill out as I am, as stated before, resident in Germany, over the Age of 18 and have never lived in the USA myself.\n\nMy question now is the following: What are my options? How, where, and to whom can I prove my eligibility for citizenship based on the factors I just listed? Are there any forms I can fill out (except for N-600, N-600K, and DS-2029, as I don't meet the eligibility requirements for these)? Are there any resources for cases as mine? Sadly, the two USCIS agents I talked to weren't of much help, which is why I am asking here. If you made it this far, I appreciate you taking time to read through this, and if you have any answers/tips/ideas where to start, I'd greatly appreciate you telling me either through the comments or PMs. If you need any more information to be able to help me, please let me know as well.\n\nThank you very much and have a great rest of your day, \n\nJake",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Germany",
            "state": null
        },
        "sex": "Hombre",
        "document": "citizenship application (derivative/N-600K equivalent)"
    },
    {
        "id": "1f78hof",
        "title": "mexican citizenship by descent - Do not have parent's birth cerificates",
        "score": 2,
        "num_comments": 1,
        "author": "jesseinlbc",
        "created_utc": 1725288264.0,
        "created_readable_utc": "2024-09-02 14:44:24 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1f78hof/mexican_citizenship_by_descent_do_not_have/",
        "permalink": "https://reddit.com/r/immigration/comments/1f78hof/mexican_citizenship_by_descent_do_not_have/",
        "selftext": "I would like to start the process, but don't have their birth certificates. The church that held the record burned down. Is there a way to get them?\n\nDad was born in 1906, mom in the 1920s. Would the be on file somewhere?\n\nIs there another option besides birth certs? Both are deceased, and I have both their death certs that indicate they were from mexico.\n\nThanks",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.75,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": "Mexican citizenship / parent's birth certificates"
    },
    {
        "id": "1f4guz1",
        "title": " Consular Report of Birth Abroad (CRBA)and  US passport for child born in Mexico ",
        "score": 0,
        "num_comments": 1,
        "author": "Blazzer2147",
        "created_utc": 1724974316.0,
        "created_readable_utc": "2024-08-29 23:31:56 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1f4guz1/consular_report_of_birth_abroad_crbaand_us/",
        "permalink": "https://reddit.com/r/immigration/comments/1f4guz1/consular_report_of_birth_abroad_crbaand_us/",
        "selftext": "I was looking for some guidance for the CRBA application and US passport for my daughter born in Mexico. \n\nThe main question I have is how do you apply for both at the same time or do you have to do them separately. Iv seen a video of someone who did both at the same time how ever they were not clear about it. \n\nSecond, on the CRBA application on the section \"Physical Presence\", how specific do you need to be the subsections \"Time in the US\" and \"Time Abroad\"? I have traveled to and from Mexico to many times to remember. As a child on Summer vacations and holidays we would travel to Mexico to visit family and as a young adult until now I have continued to visit.\n\nIf any one is familiar with the process if you could please share your experiance or any tips.\n\n\n\n",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.5,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": {
            "country": "Mexico",
            "state": null
        },
        "sex": null,
        "document": "CRBA / US passport / proof of physical presence"
    },
    {
        "id": "1f4g2m5",
        "title": "DNA test",
        "score": 0,
        "num_comments": 15,
        "author": "DueFall1318",
        "created_utc": 1724972173.0,
        "created_readable_utc": "2024-08-29 22:56:13 UTC",
        "url": "https://www.reddit.com/r/immigration/comments/1f4g2m5/dna_test/",
        "permalink": "https://reddit.com/r/immigration/comments/1f4g2m5/dna_test/",
        "selftext": "Suppose a child is born out of wedlock to a foreign mother and the alleged biological father is a US citizen, but there isn't enough indirect evidence to support that fact. Only mother's name is on the birth certificate, and due to some weird issues the father's name cannot be added.\n\nThe US citizen father meets ALL the other requirements to pass on citizenship. \n\nThe US embassy rejects the CRBA on the sole grounds that the there isn't enough evidence that the bio dad is the bio dad.\n\nThe alleged father and mother request DNA testing, but the US embassy also refuses because in this country paternity test is only allowed if a judge orders one. \n\nI understand it is the applicant's burden to prove the case. But here, the applicant is not even being given an opportunity to present all the evidence because the Embassy won't do a DNA test and the will not accept a DNA test done at home. \n\nThe US citizen father isn't being afforded the same right that would be afforded if the child was born in another foreign country.\n\nIt would seem highly unfair and unconstitutional to prevent the child from being recognized as a US citizen solely on the grounds of a quirk in the foreign country's laws.\n\nThe parents shouldn't be forced to resort to the foreign country's judicial system, when there are easier ways to prove paternity.",
        "is_self": true,
        "is_video": false,
        "upvote_ratio": 0.29,
        "stickied": false,
        "spoiler": false,
        "over_18": false,
        "link_flair_text": null,
        "us_president": "Joe Biden",
        "location": null,
        "sex": null,
        "document": "CRBA / proof of paternity / DNA test"
    }
    ]
    