[{
    "id": "1bj4t54",
    "title": "Dual Citizenship, baby entered US with foreign passport before CRBA was issued ",
    "score": 2,
    "num_comments": 5,
    "author": "irishtwinsons",
    "created_utc": 1710907835.0,
    "created_readable_utc": "2024-03-20 04:10:35 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1bj4t54/dual_citizenship_baby_entered_us_with_foreign/",
    "permalink": "https://reddit.com/r/immigration/comments/1bj4t54/dual_citizenship_baby_entered_us_with_foreign/",
    "selftext": "Ok, so this is a bit of a unique situation, because my son was born in the foreign country where I live, via donor and isn’t genetically related to me, and the country where I live doesn’t recognize my marriage. However, turns out I was able to pass my US citizenship on to him in the end, so that leads me to this question:\n\nI entered the U.S. last year with my son (he was two months old) and he had a foreign passport and an ESTA. My partner (wife as recognized in US) who gave birth to him also accompanied me and she came in with the same situation, foreign passport and ETSA for herself. At the time I remember wondering if my son would actually qualify to be a U.S. Citizen, but hadn’t completely thought it through.  I guess I had doubts because the country I live in doesn’t recognize him as my son; they view my partner as a single parent. My partner is a nonresident alien to the US. \n\nAnyhow, since then, and after checking with the US embassy, etc. that it was OK even though I’m not a bio parent, I realized I could get a CRBA for my son and an American Passport. I have done so and he currently holds a US Passport now. \n\nI know that US Citizens by birth are required to use a US Passport when entering the US, and I plan to do it from here on out. We actually have plans to visit the US soon.  \n\nIs there going to be an issue that he entered with an ESTA last time? The ESTA is actually still valid currently. \n\nI also believe that the law that allows me to transfer citizenship to my son (in the case of not being the bio parent) - apparently this law is also fairly new and people weren’t able to do it in the past. It honestly wasn’t something I expected at first (sadly, I’m quite used to the lack of recognition in my current country of residence. I also have a son who I gave birth to myself and he was not given citizenship of the country where he was born…so I guess I was a little pessimistic about it at first). \n\nIf any immigration officer asks me about it going through, I plan to simply answer honestly. \n\nIf anyone has any insight on this I’d appreciate info or advice.  \n",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.63,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1bblq8h",
    "title": "Mexican cute ship",
    "score": 1,
    "num_comments": 1,
    "author": "Livid_Speaker2709",
    "created_utc": 1710106310.0,
    "created_readable_utc": "2024-03-10 21:31:50 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1bblq8h/mexican_cute_ship/",
    "permalink": "https://reddit.com/r/immigration/comments/1bblq8h/mexican_cute_ship/",
    "selftext": "\n\n\nEdit- * Mexican Citizenship* \n\n\n\nHello, wondering if I can get some assistance. \n\nI would like to start the process of getting my Mexican citizenship.  Both parents were born in Mexico and I have their birth certificates. They also both have passed away. Recently found out that my parents made me their appointed person on the will for both on the states and Mexico. Mom passed away less than 4 months ago and we have been slowly working in getting my parents stuff situated. \n\nWhat documentation do I need exactly to get this going? Any help would be appreciated. Thank you. ",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 1.0,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "1ba6kcj",
    "title": "Fix babies citizenship in USA ",
    "score": 4,
    "num_comments": 23,
    "author": "Virtual-Asparagus125",
    "created_utc": 1709950925.0,
    "created_readable_utc": "2024-03-09 02:22:05 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1ba6kcj/fix_babies_citizenship_in_usa/",
    "permalink": "https://reddit.com/r/immigration/comments/1ba6kcj/fix_babies_citizenship_in_usa/",
    "selftext": "Backstory: I am American born Mexican. I have dual citizenship, but was born in USA. I have a baby on the way. He’s due maybe in about a week. He’s going to be born in Tijuana Mexico, as his mom, my wife, cannot enter the USA yet. (We are in the middle of fixing her documents). Naturally, I want to give him American citizenship. What is the correct step by step process to doing that? Do I have to register him in Mexico first at time of birth? Do I need to present any documents at the time of his birth? For ex, my birth certificate, marriage license, etc.? Do I need to personally take him to the American consulate to register him, or is a form that’s filled out? If anytime has had a asimilar case, I’d appreciate the input",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.58,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "1b865kx",
    "title": "US-Mexico marriage visa questions with background story.",
    "score": 2,
    "num_comments": 2,
    "author": "USMEX1910",
    "created_utc": 1709747374.0,
    "created_readable_utc": "2024-03-06 17:49:34 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1b865kx/usmexico_marriage_visa_questions_with_background/",
    "permalink": "https://reddit.com/r/immigration/comments/1b865kx/usmexico_marriage_visa_questions_with_background/",
    "selftext": "Throwaway account for anonymity Sorry for the long post, but I feel most of the info is relevant, and it’s been a long journey, and it’s not over yet  \nMe (Us Citizen) any my now wife (Mexican citizen) are living in Mexico City but want to move to the US in a couple years. Here’s the situation. We met through a friend almost 6 years ago. Dated for awhile, She had got her B1/B2 visa and every few months we would fly to visit. Sometimes she would come her, sometimes I would go there. We decided to go for the k-1 fiancé and K-2 visa for her daughter (19 at the time) things were taking time as was expected, and everything went through and even got to the interview at the embassy. This is where it all fell apart. 20-ish years prior, she was in the US illegally. This was known and well established knowledge. The US knew it from the B1/B2 (we learn the 10 year forgiveness rule) the lawyer knew it. But, she also had brought her then 6 month old daughter with her. we had told the lawyer, but nothing came of it. We thought we were clear and this was just another stepping stone. The interviewer learned of the daughter’s situation, and it was determined that this was helping another human into the USA, and didn’t fall under the 10 year rule. They suggested to file a waiver to be forgiven of this, and seemed reasonable. Although we were obviously devastated  \nWe filed the visa within days. At the time, the wait time was 6-8 months, which was a reasonable gamble as 6 months and the daughter would still be under 21 and still a dependent, 8 months would be too long. Well, the estimated 6-8 turned into an estimated 28 months! Stupid covid. At that point, we decided that we couldn’t wait another 2.5 years-ish. We tried to get it expedited, but none of that worked. So we decided that I would move to Mexico. And get married there. We didn’t want it reach the 5 year mark. So I sold everything (I’m not rich but any stretch of the imagination, but I was Ok here, no debt besides the house (very small) and car. I sold everything and left for Mexico.  \nWe got married in April and I got my temporary residency card, and everything is great. I was still periodically checking on the waiver status, although we had all but given up on that since I had moved and the timeframe never changed. Then one day in September, I receive an email from our lawyer that the waiver was approved! We didn’t know what to do. We just wanted to trade to the US so we could both visit family and friends. So we couldn’t decide between another tourist visa or go for the marriage visa. The approved waiver doesn’t apply to a tourist visa from my understanding.   \nWell some Mexican shenanigans happened, and we both don’t want to deal with that anymore. So, we’ve decided to try for the marriage visa. I no longer have a decent paying job that could qualify as supportable, but I could get one once we move back. I would definitely have a place to live as all of my family would let us live with them until we were on our feet again. I still have some the money left from selling everything before I moved.   \nDoes all of this seem feasible? What roadblocks do you foresee? What shouldn’t we forget?  \nThank you.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 1.0,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "1azyt4m",
    "title": "PhD student thinking about NIW",
    "score": 4,
    "num_comments": 3,
    "author": "Nice_Doctor_8783",
    "created_utc": 1708894856.0,
    "created_readable_utc": "2024-02-25 21:00:56 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1azyt4m/phd_student_thinking_about_niw/",
    "permalink": "https://reddit.com/r/immigration/comments/1azyt4m/phd_student_thinking_about_niw/",
    "selftext": "Hi all,  \nI'm a STEM PhD student graduating in early 2025. Country of birth is very severely backlogged. I have a question, and all lawyers I've spoken to have given me conflicting answers. \n\n I'm thinking of filing NIW after getting my initial OPT. I've had my case evaluated with wegreened, and they've offered me their refile until approved package. I'm hoping to bump up to EB1 after a few years, and only filing NIW for a priority date. Is it advisable to do this, since 1). I definitely won't be getting a GC through EB2; 2) I'll probably need at least 2-3 yrs to qualify for EB1; 2). In the meantime, I'll need an OPT extension, H1b, etc., want to travel,  and also give consular interviews for visa stamps. And these may be affected after filing an I140. \n\nIs is worth taking this risk for a priority date, especially for a backlogged country ? \n\nSome risk-averse lawyers told me to wait till getting H1B (who knows when the lottery will click). Others told me go for it even before graduating the PhD. What do people think? Please also feel free to point out if there are other threads discussing this... I didn't find any with conclusive answers.\n\nPS: Is it worth going for the refile until approved package with wegreened or should I wait? I know that probably means my case is borderline.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.83,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1ay5pp8",
    "title": "Birthrdate discrepancy with SS and lost birth certificate possibly causing issues with renewal of greencard?",
    "score": 5,
    "num_comments": 5,
    "author": "once_again_confused",
    "created_utc": 1708708000.0,
    "created_readable_utc": "2024-02-23 17:06:40 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1ay5pp8/birthrdate_discrepancy_with_ss_and_lost_birth/",
    "permalink": "https://reddit.com/r/immigration/comments/1ay5pp8/birthrdate_discrepancy_with_ss_and_lost_birth/",
    "selftext": "A family member of mine had to go to the SS office a few years back to get their retirement/medicare stuff settled. When they did this they needed to take a birth certificate and only then did they realize they no longer had it. (Unfortunately we suspect it was sent in with their original application for their greencard all the way back in the 80s or its just flat out been lost)\n\nWent to the consulate only to be told there was no b.c under their name or date in that state in Mexico.(side note their sons b.c who was born in the same state also doesn't exist and we suspect both were lost to poor handling) Their husband then in a rush finds and takes a baptism document without noting that the date is wrong(dont get me started on the anger this caused me). This is where the issues all starter. SS office then changes their birth year and says unless they bring in the b.c then they'll have to change all documents to this date now.\n\nFamily member then goes to mexico to find their birth certificate and again they're told it doesn't exist so they have register for a new b.c. They processed to do so. Come back to the US and SS office says no to the new b.C., it has to be the original or a document older than the baptism one for them to accept it. Apparently the new b.c isn't  accepted because \"anyone can say they were born anywhere at anytime and get one\" \n\nNow their renewal is coming up and it's a mess of fear that this will cause a denial.\n\nTheir birth certificate now says the og date but their ss says another and their greencard says the original date.\n\nWe thought about trying to get the og documents back but we're pretty sure that's a pipe dream and they were likely destroyed by now. \n\nWhat's the best course of action here? Should they renew their card and only after try to fix the date? Will they catch this and deny them? \n\nShould we just give up on the og date and fix everything to the date from the baptism document? Meaning get her new b.c changed to the date on the baptism so it matches up with her ss.\n\nI fear trying to fix it now that renewal is up will cause them to deny renewal but I also fear they'll catch that the ss has one date but her documents have another and deny them for \"lying\". \n\nIf their original birth certificate no longer eixist what can we possibly do to fix any of this?\n\n**Edit** To clarify and try to make it easier to understand \n\nSSA changed birth year on their records to 56 when birth year is 57, because original birth certificate is lost and a baptism certificate with the year of 56 was given to them to enroll in Medicare as they needed to do that year.\n\nRenewal for greencard is up. Greencard has the birth year of 57. All documentation has year of 57. Only SSA has 56. \n\nWorry is SSA records having the year 56 will cause issues and denial with greencard renewal as it doesn't match with date on greencard",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.86,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1ax8e6p",
    "title": "Citizenship by decent Mexico. Help",
    "score": 0,
    "num_comments": 4,
    "author": "SnooSuggestions3721",
    "created_utc": 1708613917.0,
    "created_readable_utc": "2024-02-22 14:58:37 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1ax8e6p/citizenship_by_decent_mexico_help/",
    "permalink": "https://reddit.com/r/immigration/comments/1ax8e6p/citizenship_by_decent_mexico_help/",
    "selftext": "I was born and live here in the US states. \n\nBirth certificate only has my American mother on the certificate. (Absent Father) \n\nI have my mother's maiden name.\n\nFather was born and lives in Mexico.\n\nDo I need to have my birth certificate amended to have him added on to it? \n\nHow do I go about claiming my citizenship? \n\nFun info:\nAbout 2 years ago I found out who my father is and also that I'm not an only child. I have like 10 siblings and an older brother who's a month older than me. Yeah true player Padre.\n\nUpdate 1.\nFound this for Washington state. Acknowledgment of Parentage Form.\n\nI think that might be the one I need. \n\n",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.33,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1aqk8gd",
    "title": "K1 Visa, Ciudad Juárez",
    "score": 16,
    "num_comments": 78,
    "author": "North_Edge_8421",
    "created_utc": 1707908272.0,
    "created_readable_utc": "2024-02-14 10:57:52 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1aqk8gd/k1_visa_ciudad_juárez/",
    "permalink": "https://reddit.com/r/immigration/comments/1aqk8gd/k1_visa_ciudad_juárez/",
    "selftext": "My fiancé was just approved for his K1 Visa in Juárez. Yay! I wanted to post about our experience so that it can give others insight into their process as well.\n\nHere’s our timeline:\n\nApplication mailed: September 27, 2022\nApplication received by U.S.C.I.S: September 30, 2022\n\nNOA 1: October 5, 2022 - Mailed by U.S.C.I.S. California Service Center\n\nNOA 2: September 21, 2023 - Petition sent to NVC in Portsmouth, New Hampshire \n\nNVC email: October 11, 2023 - Confirmation of receipt of approved I-129F petition and forward to Consulate in Ciudad Juárez.\n\nConsulate Ciudad Juárez email: January 16, 2024 - Immigrant Visa Appointment and instructions \n\nMedical Appointment: February 8, 2024\nBiometrics Appointment: February 9, 2024\nDay 1 Document Drop Off: February 12, 2024\nDay 2 Interview: February 13, 2024\n\nQuestions asked during the interview:\n\nWhat is your fiancés name? \nWhere does your fiancé live? \nWhat does your fiancé do for work? \nDo you have children together? \nWhere was your child born? \nIs this your first marriage? Your fiancé’s first marriage?\nIs your fiancé an American citizen by birth or naturalization? \nWhere was your fiancé born? \nWhat will you do when you live in the USA? \nAnd finally ended with, “Welcome the the United States, your visa has been approved.”✅\n\nHere are my tips:\n\n1. Submit as much documents as you can when you initially file for the K1 visa, I mean a stack of documents. Be as heavy handed with the documents as possible send photos, copies of text messages, call logs, social media posts, discussions with family and friends trip re: fiancé, trip itineraries - everything. This will help with processing and the interview (they won’t ask for much documents in the interview). We submitted a huge folder of documents with colored tabs, separators, highlighted parts, cover sheet, all the works. During the interview they only requested both petitioner & beneficiary birth certificates, police certificates (beneficiary), sealed medical packet, form I-134 and 2022 tax return (we printed previous 3 year tax returns, employment letter, bank accounts, proof of residency other evidence but they only took my 2022 tax return).\n\n2. Bring the petitioner’s (U.S. citizen) birth certificate to the interview, a certified copy or the original will suffice. This is important, if you do not have it this will cause a delay in your case.\n\n3. When filling out the form I-134 Declaration of Support, you only need to meet the minimum income requirements - assets are a plus but are not necessary. Income > assets. The government will always prefer an income because it’s consistent and measurable, even if you have 200K in assets that’s still not considered stable unless you have a job. There is a table listed on the U.S.C.I.S. government website that will show you how much money you need to make in order to qualify. IF your income does not meet the required amount THEN you can list your assets to close that gap. There’s a formula they use to calculate the amount of assets you would need to cover  the gap (a quick google search to find it). Also, be careful when listing assets (house, car, property etc.) they will consider how much debt you have and there’s a whole process for assessing value to these assets that also might cause delays if not done properly or they might need additional information. This form in my opinion was the most tedious, confusing form but I found helpful guides on YouTube. \n\n4. Try to arrive to the consulate as early as you can, they do not check appointment times. My fiancé had an appointment at 9 am (for both days) and he was able to enter the consulate at 7am. There are hundreds of people at any given time waiting in line at the consulate, so just take that into consideration. No appointment, no entry. (Sorry petitioners, you shall not pass).\n\n5. The “interview” is spread out in the course of two days, the official appointment date that is listed in the email confirmation from the consulate is just to drop off documents. They will give you a second appointment for the following business day. The second appointment includes the infamous interview which is super quick, 5 minutes more or less.\n\n6. One sleepless night, I scoured the internet looking for any and all tips. I found one that read - the interview is just a formality, the decision has already been made prior to your arrival. (There are many check points, and the application could’ve been rejected before your interview. If rejected at the interview, it’s most likely because the consulate needs missing/more documents). If you see your hard copy file during the interview, try to look if there’s an “approval” stamp on the top page. If you see that, your visa has already been approved. (With the understanding that you’re not missing anything else on the day of the interview). My fiancé heard the same thing from the doctor at his medical appointment, and he saw it on the first day at the consulate for his document drop off. We didn’t put much weight on it, until it was approved.\n\nI wanted to share this for everyone who is going through this process and if you’re reading this, I hope it helps you! Best of luck to all the couples.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.95,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1ai1vkw",
    "title": "Mexican citizenship via birthright",
    "score": 0,
    "num_comments": 6,
    "author": "joabble",
    "created_utc": 1706982846.0,
    "created_readable_utc": "2024-02-03 17:54:06 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1ai1vkw/mexican_citizenship_via_birthright/",
    "permalink": "https://reddit.com/r/immigration/comments/1ai1vkw/mexican_citizenship_via_birthright/",
    "selftext": "American born with a Mexican born mom. \n\nI’ve read in different places it’s possible get Mexican citizenship by going to the Registro Civil of her birth state or city and getting my citizenship that way. She was born in Reynosa, Tamps. I have her birth certificate and mine, wondering if anybody else has gone this route and how it went and what exactly you’re given to show you’re a Mexican citizen.\n\nI’ve tried the consulate route, and they want my parent marriage license, but her last name is misspelled on it, so they denied me. The did suggest though that I had a right to citizenship but would have to do it within Mexico, hence why I’m asking how this route goes.\n\nThanks! Appreciate any advice in advance.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.5,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1ah6313",
    "title": "K1 visa",
    "score": 0,
    "num_comments": 9,
    "author": "jp222111",
    "created_utc": 1706887083.0,
    "created_readable_utc": "2024-02-02 15:18:03 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1ah6313/k1_visa/",
    "permalink": "https://reddit.com/r/immigration/comments/1ah6313/k1_visa/",
    "selftext": "Hello everyone, I have a question about the k1 visa. \nMy fiancé came to the US as a child (1 year old) and was here until the age of 21. His dad, a permanent resident, was trying to help him obtain his green card. He went to his birth country for his interview at the embassy, where he was denied a green card and was given a 10 year ban. \nWe are now in the process for a k1 visa to get married. The I-129f petition got approved, but I am now wondering if he be automatically denied the visa at his interview? If so, is the only option for him to wait out the ban and re-apply after the ban expires? Any help would be appreciated.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.4,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1aex6cs",
    "title": "I have no Birth Certificate",
    "score": 1,
    "num_comments": 2,
    "author": "Far-Competition89",
    "created_utc": 1706643417.0,
    "created_readable_utc": "2024-01-30 19:36:57 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1aex6cs/i_have_no_birth_certificate/",
    "permalink": "https://reddit.com/r/immigration/comments/1aex6cs/i_have_no_birth_certificate/",
    "selftext": "My birth certificate was shredded and my name was taken off the birth register in my home country. (Mexico) during the early 90s lots of churches and gov buildings were burned down and ruined in my hometown. I want to apply for something but is it the consulate that I have to request the form of no available document(birth certificate)? I can’t get my original one and to register at this age, my father won’t do it. He has taken money from me and just won’t go do the paperwork for it. Been here 29 years now. What should I apply for? And do I go again to my country’s consulate for that form/letter.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.66,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1abl894",
    "title": "Under review",
    "score": 0,
    "num_comments": 10,
    "author": "Apprehensive-Eye4908",
    "created_utc": 1706283735.0,
    "created_readable_utc": "2024-01-26 15:42:15 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1abl894/under_review/",
    "permalink": "https://reddit.com/r/immigration/comments/1abl894/under_review/",
    "selftext": "Apprehensive-Eye4908\n•\n29 min. ago\nWas given the chance to travel to the US from Africa when I was 21. I didn’t know how it was done but my uncle took me to the consulate and gave me a passport with a different name and date of birth to go and apply. I walked in not even knowing the name or actual info in h to e passport. I was denied. 7 years later I applied with my real name and actual information and got the visa. Now I’m in the US happily married to a US citizen and she advised I do an adjustment of status but on our i485 interview I was asked if I’ve ever lied or tried to get into the US with false information and I remembered what happened 14 years ago, and admitted it. They put my case under review. Anyone understands how this works? And what to expect?",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.33,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "19e1xla",
    "title": "Dual citizenship Mexico",
    "score": 1,
    "num_comments": 1,
    "author": "reroser19",
    "created_utc": 1706051272.0,
    "created_readable_utc": "2024-01-23 23:07:52 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/19e1xla/dual_citizenship_mexico/",
    "permalink": "https://reddit.com/r/immigration/comments/19e1xla/dual_citizenship_mexico/",
    "selftext": "I’m trying to obtain dual citizenship for mexico, as my mother was born in Potosi, Mexico, however, my mother  doesn’t have a copy of her birth certificate and there isn’t a copy digitally online through gob.mx. My question is can a local consulate grant her a certified birth certificate if they can’t locate her digitally online? She has her passport that reports she was born in Mexico,  proof of when she entered the US as a child and online was able to find public records of her birth recording from 1948.  Unfortunately in order for me to obtain dual citizenship, they require my mother’s original certified birth certificate.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 1.0,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "19bfrqc",
    "title": "K1 interview - Sponsor birth certificate required?",
    "score": 2,
    "num_comments": 22,
    "author": "JanetYellensFuckboi",
    "created_utc": 1705768756.0,
    "created_readable_utc": "2024-01-20 16:39:16 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/19bfrqc/k1_interview_sponsor_birth_certificate_required/",
    "permalink": "https://reddit.com/r/immigration/comments/19bfrqc/k1_interview_sponsor_birth_certificate_required/",
    "selftext": "Hi everyone,\n\nJust a quick question. My fiancée and I have our K1 interview this coming Tuesday and we might have run into an issue where I did not bring my original long form birth certificate as the sponsor.\n\n I read online through various websites that only the foreign fiancée had to bring theirs, (from total.law - “Birth certificate- foreign citizen applicants are required to submit birth certificates as part of confirming their ID” | from boundless.com - “Birth certificate for the sponsored fiancé”) but nowhere did I see that the sponsor fiancé birth certificate was required.\n\nHowever, my fiancée is part of a Facebook group where individuals have said the sponsor fiancé birth certificate is required. Can anyone give some clarity regarding this issue? My fiancée is from Mexico. Thanks in advance.\n\nEDIT: the physical copy IS REQUIRED. During the pre check interview two days before the actual interview, my fiancée was told we would need the physical long form birth certificate, copies are not valid. I had to overnight the physical birth certificate to have it in time for her interview two days later. We had our interview in Ciudad Juarez.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.75,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "196qm2f",
    "title": "Urgent Choice to Make - GreenCard",
    "score": 1,
    "num_comments": 5,
    "author": "Sunshine_100000",
    "created_utc": 1705267305.0,
    "created_readable_utc": "2024-01-14 21:21:45 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/196qm2f/urgent_choice_to_make_greencard/",
    "permalink": "https://reddit.com/r/immigration/comments/196qm2f/urgent_choice_to_make_greencard/",
    "selftext": "Hi all.  \nSo im in the UK with my husband of 7 years, and was granted a green card when we were living in the US 16 months ago . We came back to the UK because my husband could not find work in the city where we were at and i had just given birth in the US and was making minimum wage. We came back to the UK as a temp thing but now its rolling to 2 years. Had legal advice and they stated i either go back now or reapply for GC all over again aborad. My husband's GC doesn't expire until 10 years BUT we have almost been abroad heading towards 2y in June. I can't leave now/ next 8 weeks as i don't have enough money to move. We have 2 little ones, the cost will be at least 5-10k easy just a bare minimum.  Let's say we applied for GC while here, yup waste of money but we have no money to move right this second. Do you think i would have to wait 1.5 - 2 years for it? Being a valid GC holder (husband), would they expedite it?/ sorry for the stupid questions we are just panicking, and dont want to be in the UK at all.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 1.0,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "196lu5t",
    "title": "K1 Visa / Divorce / marriage recognition",
    "score": 0,
    "num_comments": 9,
    "author": "ApexMX530",
    "created_utc": 1705255230.0,
    "created_readable_utc": "2024-01-14 18:00:30 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/196lu5t/k1_visa_divorce_marriage_recognition/",
    "permalink": "https://reddit.com/r/immigration/comments/196lu5t/k1_visa_divorce_marriage_recognition/",
    "selftext": "Hello, all!\n\nI’m not certain that this is the correct sub to ask this question but here goes:\n\nMy fiancée and myself find ourselves in a sticky situation. She, a Mexican citizen without any travel authorization to the US, has been estranged from her husband for many years. He went no-contact and she has had a difficult time finalizing her divorce in Baja California, Mexico. I am a US citizen and we are interested in pursuing the K1 visa to marry and live in California.\n\nMy question is this: Seeing as the state of Baja California has a two year waiting period before a divorcee can remarry and the state of California has a six month waiting period for the same, would we be able to solicit the K1 visa after six months of her being divorced, or would it be two years, or can we start immediately after her divorce decree is issued given the time it takes to approve the visa?\n\nEdit: I presume that it would take the full two years for our California marriage to be recognized by the authorities in Baja California but if someone has some insight on that aspect it would be helpful to know as well.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.5,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "1960zum",
    "title": "Husband US Citizen, Wife i130 ongoing got pregnant",
    "score": 1,
    "num_comments": 8,
    "author": "urbansleeper45",
    "created_utc": 1705187486.0,
    "created_readable_utc": "2024-01-13 23:11:26 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1960zum/husband_us_citizen_wife_i130_ongoing_got_pregnant/",
    "permalink": "https://reddit.com/r/immigration/comments/1960zum/husband_us_citizen_wife_i130_ongoing_got_pregnant/",
    "selftext": "Hi, my friend is a US Citizen and applied i130 for his foreign spouse in November. His wife just got pregnant (she lives in foreign country and the citizen friend lives and works in US at the moment). Given the wife's health and birth facility concerns at that foreign country, they were wondering if anything can be done to have the wife come here and deliver?",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.54,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "190y77u",
    "title": "Question about emergency travel",
    "score": 0,
    "num_comments": 10,
    "author": "Competitive-Bad-8690",
    "created_utc": 1704650785.0,
    "created_readable_utc": "2024-01-07 18:06:25 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/190y77u/question_about_emergency_travel/",
    "permalink": "https://reddit.com/r/immigration/comments/190y77u/question_about_emergency_travel/",
    "selftext": "Hello everyone. I am a USC and my wife is peruvian. We are on day 460 of no updates past biometrics. We just did congressional inquiry on our i485. My wife had her grandmother pass away 3 days ago. We have the death certificate and her father's birth certificate and will try to get an emergency travel document. My question is.\n On the website it says that if people are in process and have accrued illegal stay in the US then they may still be not allowed into the country and given a ban even with advanced parole or emergency travel documents. My wife overstayed her initial visa by about a year while we were dating . How real is the possibility of denial of entry when returning from peru even with the emergency travel permit. Thanks.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.5,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "18xaxmv",
    "title": "Child born in Mexico but I live in the US",
    "score": 38,
    "num_comments": 21,
    "author": "Simple-Fan1260",
    "created_utc": 1704257769.0,
    "created_readable_utc": "2024-01-03 04:56:09 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/18xaxmv/child_born_in_mexico_but_i_live_in_the_us/",
    "permalink": "https://reddit.com/r/immigration/comments/18xaxmv/child_born_in_mexico_but_i_live_in_the_us/",
    "selftext": "My brother had a baby 10 years ago with my sister in law who is a Mexican citizen. My brother was only 16 and didn’t know the steps to make sure his daughter was registered as a US citizen. Fast forward 10 years later since we live right next to the border in San Diego he just goes back and fourth a lot to go see her. When she was born in Mexico he was not allowed to sign the birth certificate because he was a minor and my mom needed to be present if he did (which idk if true) so basically what I’m \nO asking is. How do we get her\nOver here ASAP. She’s miserable over there and tells us all the time. Do we have to get an immigration lawyer or can we do this process ourselves? Another big reason why he wasn’t able to get her here sooner. Any tip or anybody else has been through this? We are desperate to get her here as soon as possible",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.86,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "18x9lp8",
    "title": "Duel citizenship Mex / Us",
    "score": 0,
    "num_comments": 0,
    "author": "JayZoo7",
    "created_utc": 1704253708.0,
    "created_readable_utc": "2024-01-03 03:48:28 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/18x9lp8/duel_citizenship_mex_us/",
    "permalink": "https://reddit.com/r/immigration/comments/18x9lp8/duel_citizenship_mex_us/",
    "selftext": "Duel citizenship\n\nHey everyone so I have a very unique situation, I’m in the process to obtain my dual citizenship. But I’ve run through some hurdles and looking to see if anyone has had any luck. \n\nBoth parents born in Mex, got married through the church only here before moving to the USA. I was born there, however my parents have them split. \n\nI tried to get my citizenship at the consulate in nyc but they said since my parent were never legally married (civil) that my dad has to request my citizenship, however my dad lives in Mexico now. \n\nThey said if I get my birth certificate appostile I can request it in Mexico. I did, I have my mother’s birth certificate from Mexico and my birth certificate appostile, I made an appointment with the civil office. \n\nAnother hurdle, they said they were not able to process because my mother’s last name Soto Romero is not on my birth certificate only her first name and first last name is. \n\nSo they said they cannot verify she is my mother. \n\nAny guidance would be great!",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.33,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "18r7xjv",
    "title": "My wife is adopted. Is it possible for her to still get US citizenship?",
    "score": 27,
    "num_comments": 33,
    "author": "Next-Community4020",
    "created_utc": 1703596610.0,
    "created_readable_utc": "2023-12-26 13:16:50 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/18r7xjv/my_wife_is_adopted_is_it_possible_for_her_to/",
    "permalink": "https://reddit.com/r/immigration/comments/18r7xjv/my_wife_is_adopted_is_it_possible_for_her_to/",
    "selftext": "I am a US citizen in the process of gathering evidence for my wife's I-130. My wife has given birth to our first son here in the country we live. So one of the pieces of evidence will be our son's birth certificate.\n\nLooking at the rules for citizenship, I was wondering if my wife is already a US citizen.\n\nMy wife's birth mother is an American citizen. She got pregnant with my wife at 18, gave birth at 19 in the foreign country and gave my wife for adoption. All this happened in a foreign country. My wife's bio dad is a foreigner. His name is on the original birth certificate as well. My wife's birth mother and bio dad weren't married.\n\nWe've finally gotten her original foreign birth certificate. It does mention my wife's birth mother. \n\nIn addition, my wife's birth mother is involved in our lives, and she would have no problem taking a DNA test.\n\nMy wife's birth mother was born in the US and lived in the US until she turned 12. She then moved with my wife's biological grandparents to another country where she got pregnant.\n\nI imagine if my wife's birth mother hadn't given my wife up for adoption, then my wife would be a US citizen today. Did the subsequent adoption terminate the US citizenship? \n\nMy wife was born in 1992. \n\nIf my wife is a US citizen, should we wait till my wife's US passport is issued to get a CRBA for my son?\n\nEDIT: My wife's adopted parents aren't US citizens.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.86,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "18qr56d",
    "title": "Process to get dual Citizenship. US born Citizen, with one Mexican born parent and all grandparents born in Mexico.",
    "score": 50,
    "num_comments": 118,
    "author": "famous_friend21",
    "created_utc": 1703538465.0,
    "created_readable_utc": "2023-12-25 21:07:45 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/18qr56d/process_to_get_dual_citizenship_us_born_citizen/",
    "permalink": "https://reddit.com/r/immigration/comments/18qr56d/process_to_get_dual_citizenship_us_born_citizen/",
    "selftext": "So I’m trying to get my dual citizenship and wanted to see if I can get advice or tips on the process. I have gone to the Mexican consulate already and they’ve given me the paperwork to fill out. My dad has already passed, but he was born in the U.S to 2 Mexican parents. I do have his birth certificate, death certificate, his passport and drivers license. My mom was born in Mexico and became a U.S citizen in 1999 but she has dual citizenship, she has all her documents: birth certificate, INE, and naturalized certificate. I have my passport and birth certificate. Besides making copies of the documents that’s all I really need right?\n\nAlso would it be possible to get my son his Mexican citizenship as well since I would have all his grandparents information already right? Or would I have to wait to get mine before doing his?\n\nThank you.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.93,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "18hzrul",
    "title": "Employer thought my FS-545 was fake. Is there a way to make it more \"official\" so USCIS won't make the same mistake.",
    "score": 5,
    "num_comments": 9,
    "author": "Mediocre_Insurance19",
    "created_utc": 1702526012.0,
    "created_readable_utc": "2023-12-14 03:53:32 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/18hzrul/employer_thought_my_fs545_was_fake_is_there_a_way/",
    "permalink": "https://reddit.com/r/immigration/comments/18hzrul/employer_thought_my_fs545_was_fake_is_there_a_way/",
    "selftext": "When I was born, my US citizen mother got a FS-545 for me.\n\nI have been living outside America, but I came to USA on vacation. I am in between jobs. Also, I wanted to renew my US passport because it is close to expiring. \n\nOnce here, I was approached by a company who was looking to hire me on an urgent basis. \n\nDuring the onboarding process, they requested certain documents from me to prove my ability to work legally. Not having my US passport (because it is being renewed) or my SSN card (in the other country), I got myself a NYCID using my foreign passport. \n\nI read I could use an\n\n> ID card issued by federal, state or local government agencies or entities, provided it contains a photograph or information such as name, date of birth, gender, height, eye color and address\n\nClearly, NYC counts as a local government agency.\n\nWell, the employer thought my FS-545 was fake. That is until some senior guy who himself had a FS-545 got involved and approved my i-9.\n\nNow, I am looking to sponsor my husband for a green card.\n\nGiven that my plans to move back to the US are coming together rapidly and that my US passport is 3 weeks from being renewed, I'd like to apply quickly for my husband. Is there a way to make my FS-545 more \"official\" so USCIS doesn't make the same mistake? Perhaps attach a copy of my birth certificate issued by the foreign government where it lists my mom as being born in the USA?",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.78,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "18b0jf2",
    "title": "Immigration issues with Baby (Mexico - US)",
    "score": 4,
    "num_comments": 51,
    "author": "Grouchy_Teacher433",
    "created_utc": 1701740702.0,
    "created_readable_utc": "2023-12-05 01:45:02 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/18b0jf2/immigration_issues_with_baby_mexico_us/",
    "permalink": "https://reddit.com/r/immigration/comments/18b0jf2/immigration_issues_with_baby_mexico_us/",
    "selftext": "Hello to everyone!\n\nI already wrote a post a few months ago and want to explain the situation again with current events and ask for advice. Thanks to everyone who already read and responded to my previous post.\r  \n\r  \nI am a German citizen with a US Green Card, and my husband is a German and US citizen. We traveled to Mexico at the end of November 2022, and I gave birth to a daughter there in mid-December. She has Mexican citizenship with a birth certificate and passport.\r  \n\r  \nOriginally, we only planned to stay in Mexico until April/May. In early 2023, we tried to obtain a CRBA. Unfortunately, my husband could only prove 4.5 years of physical presence instead of the required 5 years, so it was unsuccessful.\r  \n\r  \nThen we tried to at least get a visa for her. We only got an appointment at the consulate in December 2024, and expediting the appointment was not possible. I asked for help here on Reddit, and I was pointed to 'Child born abroad to LPR' and according to the CBP website we met all requirements.\r  \n\r  \nUnfortunately, we had some problems, and our return was delayed to mid-November – it was not planned, but I still thought we could enter with our baby since we still met all the requirements! Unfortunately, we were denied entry. We tried again the next day, and it still didn't work, despite presenting the information on paper and arguing that we meet all requirements!!\r  \n\r  \nThey argued that we had lived abroad for the last 11 months. We said it was not planned and it was still a temporary stay, and the website also states 'temporary stay abroad under 1 year'... I could also prove in writing that I am still employed in California. The officers were not interested at all. Both times we were treated very rudely and could only speak to someone through the fence.\r  \n\r  \nSince I had to enter due to my Green Card (funnily I had no issues at all entering the country by myself...) and job, my husband is now staying with our daughter in Mexico, and we are considering our options. Is there any way to appeal this decision? Do we even have a chance?\r  \n\r  \nOtherwise, we can now apply for the I-130. Does anyone know how long that currently takes? \n\nAlso, I can likely apply for US citizenship in April, and then theoretically, we could apply for CRBA again, this time without physical presence, right?\n\nAny other advice? I really miss my baby...\r  \n\r  \nThanks in advance for the help!",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.75,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "18afp6y",
    "title": "Requirements to Enter/Leave Mexico and US",
    "score": 2,
    "num_comments": 2,
    "author": "babybunny2812",
    "created_utc": 1701677619.0,
    "created_readable_utc": "2023-12-04 08:13:39 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/18afp6y/requirements_to_enterleave_mexico_and_us/",
    "permalink": "https://reddit.com/r/immigration/comments/18afp6y/requirements_to_enterleave_mexico_and_us/",
    "selftext": "I have a flight booked to Mexico in 3 weeks and JUST NOW realized that my passport expired a little less than 3 months ago. It is a Mexican passport, I am a Mexican citizen, and I have a US Green card. I will be flying from WA to Mexico City and will come back in through the Arizona border on land. \n\nI am slightly freaking out because I’m not sure what to do? Will I be let on my flight/into Mexico and then back into the US? Should I bring a Mexican birth certificate? Or try to book a passport appointment asap (though I’m trying to save that money for the trip). I am flying through Aeromexico if that means anything.\n\nAny help is extremely appreciated as I feel like I’m getting mixed signals through Google search. Thank you!",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 1.0,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},


{
    "id": "186tqiv",
    "title": "HELP! Asked for additional documents. 221g - DS5535. Do we need to mail original documents??",
    "score": 1,
    "num_comments": 2,
    "author": "Due-Jelly-7968",
    "created_utc": 1701275952.0,
    "created_readable_utc": "2023-11-29 16:39:12 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/186tqiv/help_asked_for_additional_documents_221g_ds5535/",
    "permalink": "https://reddit.com/r/immigration/comments/186tqiv/help_asked_for_additional_documents_221g_ds5535/",
    "selftext": "\n\n\nHello, \n\nWe have a bit of a complicated immigration case, and we are a bit confused what to do next. \nMy spouse was DQed and had his interview in August 2023. He was given 221g and DS5535 because his visa category was changed. Civil documents and a new DS-260 were needed from my side. \n\nWe submitted all the required civil documents on the CEAC website as instructed. \nI read the form they gave him and it says submit all required ORIGINAL documents. Now do they mean birth cert, marriage cert, police clearance etc? Documents we already submitted on CEAC? \n\nOn the CEAC website the documents we uploaded still says submitted and hasn’t changed to accepted yet. \n\nTried calling and emailing to just make sure what we need to do and if we need to courier the docs but haven’t gotten a reply. Thought I’d ask here. \n\nThankyou",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 1.0,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "17x2qo0",
    "title": "Is my daughter a US citizen?",
    "score": 0,
    "num_comments": 62,
    "author": "AppearanceNo7859",
    "created_utc": 1700182532.0,
    "created_readable_utc": "2023-11-17 00:55:32 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/17x2qo0/is_my_daughter_a_us_citizen/",
    "permalink": "https://reddit.com/r/immigration/comments/17x2qo0/is_my_daughter_a_us_citizen/",
    "selftext": "I'm a natural-born American citizen who has lived mostly in America except for when I occasionally go to visit my long-term girlfriend overseas. I'm a surgeon, so I can't travel much other than the occasional holidays. My girlfriend gave birth abroad. But both of them are overseas. I can't go overseas because of work. \n\nI know that American citizens can't be issued visas. But I'd like for my girlfriend and daughter to come. My girlfriend got offered a job in her company on L1. So I was wondering if my daughter is not yet a US citizen, thereby making her eligible for a L2 visa or ESTA (she has an ESTA eligible passport).\n\nHere are my reasons to believe my daughter is not a US citizen:\n\n* She is not legitimated. In the country she was born, I can't be added onto the birth certificate unless I marry my girlfriend, which I can't do because my girlfriend and I don't want to get married.\n\n* I haven't acknowledged my daughter under oath. I've just acknowledged her, but not under any formal legal oath.  Just when I send money, I'll say in the description box when I need to send money because of daughter's XYZ. \n\n* I haven't agreed in writing to support her until 18, although of course I have every intention of doing so.\n\nSo then she is not a citizen and thus eligible for the L2 visa. Would the Embassy still issue the visa because she isn't technically a citizen yet? I suppose we'd have to disclose I am the father. But she isn't technically a citizen. If the Embassy wouldn't issue her a visa, can she use ESTA? On ESTA would my girlfriend as the custodial parent have to say that my daughter is an American citizen?\n\nEDIT: The main reason besides the lack of marriage I can't be added is if I were to be added somehow, then my daughter would have to take my last name, but we want both of our last names to be given to our daughter.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.42,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "17twa7x",
    "title": "What happens when a child is born to non immigrants or parents unable to transmit citizenship in a jus sanganus country?",
    "score": 4,
    "num_comments": 50,
    "author": "Maleficent_Cash909",
    "created_utc": 1699829831.0,
    "created_readable_utc": "2023-11-12 22:57:11 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/17twa7x/what_happens_when_a_child_is_born_to_non/",
    "permalink": "https://reddit.com/r/immigration/comments/17twa7x/what_happens_when_a_child_is_born_to_non/",
    "selftext": "Apparently these births should be handled quite differently than births where the child is born as a citizen of the same country. How do birth certificates or birth registration work in such cases? I normally hear the hospital reports to the government agency which in term the immigration department and puts the child under the same visa restrictions as the parents. But what happens when its time for parents to return. Ie end of assignment, lease and visa?\n\nWhile the child is technically automatically a citizen of parent's country in most cases many times countries need to authenticate birth and parents marriage certificates from the nearest counsulate or embassy where it was issued to prove legitimacy in order to grant a passport which can be rather difficult process for some people. What would happen if the kid returns home and parents never were able to complete the process. The parents may be married at remote state or country. Ie if kid born on the road in Mexico than the parents who are US citizens or one of the a US citizen just drives to the US border and say that is their child? If the child makes it over would they still need to go through the process or that kid despite being technically a US citizen under US nationality laws by descent may still be treated as an undocumented person?\n\nEdit: Mexico is a Jus Soli country and the kid would be registered as a Mexico national by birth at a Mexican hospital but many countries i.e homogenius east asian countries are not that way. \n\nEdit: many in US wants to amend the 14th amendment so that birthright citizenship is restricted to at least legal residents. Though what would be the unintended consequences should US, Canada or the rest of the Americas follow much of the world(aside from Aus, New Zealand) in this. UK and ireland could be an example as they “recently” ended unconditional jus soli. Ie we would have many undocumented kid born in the US causing quite an issue.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.61,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},


{
    "id": "17iw0jo",
    "title": "A tricky situation...",
    "score": 0,
    "num_comments": 24,
    "author": "alan_anonymous_11",
    "created_utc": 1698556877.0,
    "created_readable_utc": "2023-10-29 05:21:17 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/17iw0jo/a_tricky_situation/",
    "permalink": "https://reddit.com/r/immigration/comments/17iw0jo/a_tricky_situation/",
    "selftext": "I've got a tricky (and potentially interesting) case. Doing my best to keep identities private while including enough details...\n\nMy 34 yo significant other (SO) is a German citizen, who came to US (California) to study on a 6mo education visa in Jan 2020. OS arrived just as COVID started and was afraid to travel after 6 month visa expired. SO applied for a visa extension for June 2020, but didn't hear back in time, so ended up staying, afraid they would not be able to return to US if they returned to Germany, bc of Covid. OS got a job (under the table) in order to finish a two year long educational program, then found a place to live and ended up staying until April 2023, continuing to work to afford education in Ayuvredic healing.\n\nSO hadn't seen their family since pre-covid so very much wanted to visit Germany in April 2023. A friend of SO (also German)  suggested a way to do this, which the friend had already tried-- exit via the Mexican border, get a phony visa stamp, then return to USA.\n\nSO felt they had no other choice bc of overstaying initial visa, so followed this suggestion. Unfortunately it didn't work out :(\n\nSO had requested an official visa extension in June 2020, but never got a response from US govt. So, upon deciding to leave in April 2023, SO felt that they needed a visa stamp dated after June 2020, when extension was applied for.\n\nSO arranged a meeting with a provider of false visa stamps at Mexican border and met them in April 2023 at the Mexican border. and received a \"document\" rather than a passport stamp, suggesting SO had exited US via Mexico in August 2020.\n\nSO made it back to Germany, but when they came back to California a month later, after visiting their family, SO was stopped at US airport border because their documents said that they crossed over the USA-Mexico border in August 2020 when the border was closed at that time b/c of COVID. (Unclear why phony visa stamp provider wasn't aware of this or didn't choose a different date :(When detained upon re-entry to CA, SO was interrogated, said they were coming back to US to \"wrap up affairs and return to Germany\".\n\nUnder pressure, SO admitted to details of visa fraud. SO also fraudulently represented bank account info, said they had $15k instead of $2k for purposes of re-entering US, using a photoshopped image of bank account. OS says they did this in a panicked state.Unfortunately all of this is recorded on deportation documents :(\n\nFor some reason , SO was given a five year ban instead of 10 year ban, as would be standard for 3+ years of overstaying visa.\n\nAfter research and reaching out, a US immigration lawyer has recommended not to take any actions before the 5 year ban is over because SO should actually be banned for 10 years for overstaying visa for over 12 months.\n\nFrom my perspective, as a very fortunate US citizen, 5 years is a very a long time, 10 years is a very very long time. And from what I've read there is a strong possibility that SO might never be able to get a US visa again, even after ban is lifted. that is a very very cery long time that will mean my family never get to meet my SO with our child.\n\nSO is a wonderful person, who got spooked by COVID craziness and made some bad choices under pressure. SO is the love of my life, so I am moving to Germany to marry them, and we plan to have children in the next year or two.\n\nIt would very sad if my elderly parents would not be able to meet our future child, or if the only way they could meet our children is for me to return solo to US with my children but without my SO. I and my SO are both hard-working people, trained as healers, organic farmers, and artists.\n\nI would be SO happy to find a way to bring my SO and our future children back to the US to reunite with my family and friends, sooner than the 5 year (or 10 year or lifetime) ban. The idea of a life-long ban is crushing, as SO is a healer and force for good in the world. They feel much more at home in US than Germany and want to contribute to life and healing here in the US. Any advice would be greatly appreciated!\n\n\\[edited for typos\\]",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.33,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "17gkyjn",
    "title": "Do I have to change my name to claim mexican citizenship?",
    "score": 1,
    "num_comments": 3,
    "author": "nunyaabeezwaxx",
    "created_utc": 1698283732.0,
    "created_readable_utc": "2023-10-26 01:28:52 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/17gkyjn/do_i_have_to_change_my_name_to_claim_mexican/",
    "permalink": "https://reddit.com/r/immigration/comments/17gkyjn/do_i_have_to_change_my_name_to_claim_mexican/",
    "selftext": "I'm trying to become a mexican citizen through my dad, who was born in Mexico. I was born in the US. My birth certificate and all of my IDs have only my dads last name. I went to Mexico in July and I was told in order to claim my mexican citizenship, I need to use my moms maiden name on my US birth certificate and IDs. They said that the law just changed. I would prefer it if I didn't have to change my name. I don't live in the state I was born in and it honestly seems like a gaint headache. I requested an appointment through the consulate in Seattle over a year ago and I just managed to get an appointment in November. My parents don't want to bother going to the appointment just for them to tell me the same thing. I can't find anything online about having to change my name. I'm honestly just confused and I would appreciate any and all advice.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.67,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "1750z7l",
    "title": "Can a student on an F1 visa get a court ordered name change in the US?",
    "score": 4,
    "num_comments": 4,
    "author": "Fancy-Phone-2381",
    "created_utc": 1696984640.0,
    "created_readable_utc": "2023-10-11 00:37:20 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/1750z7l/can_a_student_on_an_f1_visa_get_a_court_ordered/",
    "permalink": "https://reddit.com/r/immigration/comments/1750z7l/can_a_student_on_an_f1_visa_get_a_court_ordered/",
    "selftext": "Recently, I have come to the US and my name has a rather complicated history. I come from a part of the world where people don't necessarily have surnames. The format of the names are:\n\n[Village name] [Father's name] [First name] \n\nTo complicate things further, people use initials for the Village Name and the Father's name. So on my birth certificate my name is written literally as \"Q.R. Peter\" (example). When I was young they started instituting mandatory expansion of the initials. So my name became Queens Richard Peter. But this was the name in my \"Given name\" field in the passport. So my B1/B2 visa had FNU because no surname.\n\nThen when I renewed my passport, I got my name fixed so that the \"Surname\" was \"Queens\" and the \"Given name\" is Richard Peter. The passport office in my country is pretty understanding of these situations and they didn't mind putting the Village Name as the surname. But, I am not Richard. I am Peter. \n\n1. Can I file for a court application for a name change even though I'm not a US citizen or LPR? Can I fix it so that my first name is my first name and my dad's name is my middle name?\n\n2. Can I submit this name change for SEVIS? Or SEVIS only goes by what is there on my passport. In which case, I would need passport renewal. Does this mean I need a new I-20?",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.84,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "16u69up",
    "title": "El Paso Bus to Chihuahuahua",
    "score": 2,
    "num_comments": 4,
    "author": "miiki_",
    "created_utc": 1695875135.0,
    "created_readable_utc": "2023-09-28 04:25:35 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/16u69up/el_paso_bus_to_chihuahuahua/",
    "permalink": "https://reddit.com/r/immigration/comments/16u69up/el_paso_bus_to_chihuahuahua/",
    "selftext": "Ok. So I have childhood memory that is bothering me. \n\nAs child while visiting my cousins who lived on the Army base in El Paso, I remember taking a trip to Mexico. I was pretty young (about 6-8 years old), it was pre 9/11 and during a Clinton presidency (unsure of how that may have impacted immigration policies). My Aunt, grandmaw, mom, two cousins and I rode a bus there and back. The only activity I remember from that trip was seeing glass-blowing.  \n\nWhat has really caught my interest recently was our immigration experience. We were given wristbands and when returning to the US, a man checked for our wristbands, and asked my cousin a non-threatening question or two (we were three little brown girls who could look Latin American if you use a little imagination sitting with a bunch of white women).\n\nAm I remembering this correctly? Did we really enter Mexico and return to the US with a wristband? I did not have a passport at the time and I don’t remember getting off the bus to show any documents but I was young and could have easily forgotten.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.75,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "16ojhrq",
    "title": "For those who emigrated from US to another part of the world and had children there would you allow/help your kids claim US citizenship or live back in the US?",
    "score": 0,
    "num_comments": 11,
    "author": "Maleficent_Cash909",
    "created_utc": 1695311649.0,
    "created_readable_utc": "2023-09-21 15:54:09 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/16ojhrq/for_those_who_emigrated_from_us_to_another_part/",
    "permalink": "https://reddit.com/r/immigration/comments/16ojhrq/for_those_who_emigrated_from_us_to_another_part/",
    "selftext": "Or would you do everything to discourage it. Including even if they want to go to University there\n\nGiven you became citizens of that country and your kids also got citizenship by birth in that country or from you being a citizen. \n\nWhile it’s there birthright however  drawbacks of claiming US citizenship, social security number or living in US includes Possibility of gun violence, being shunned including by banks all over the world due to fatca or other reasons, lifetime Us taxation, incurring extreme medical bills leading to bankruptcy etc. Given that your current country already have a strong passport accepted by most countries in the world including the US at least for non settled/employment purposes.\n\nCan apply to different countries other than the U.S. as well. Ie some require compulsary military service.\nOr VICE Versa.",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.14,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "16feq4q",
    "title": "US VISA interview tomorrow",
    "score": 9,
    "num_comments": 14,
    "author": "Finessedaddy420",
    "created_utc": 1694386951.0,
    "created_readable_utc": "2023-09-10 23:02:31 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/16feq4q/us_visa_interview_tomorrow/",
    "permalink": "https://reddit.com/r/immigration/comments/16feq4q/us_visa_interview_tomorrow/",
    "selftext": "Hello all, I will keep this short. So basically I was born in Mexico City, was taken to the USA at 2 years old by my parents with our legal tourist visas. Fast forward to 2019 when I was 17 and just graduated high school, I decided to come back to Mexico City to do things the correct way before I was a \"legal adult\". I am studying at the university of Arkansas campus queretaro in Mexico and have not seen my family or friends in 4 years now.\nMy visa appointment interview is tomorrow, and I obviously only want to visit my family and friends again even if it was for one week, and l've got the money. I am trying not to get too anxious but I know there is still a pretty high probability of being denied because I still have my illegal parents and sister over there. Background info: at one point I did receive a SSN, temporary license, all pre k- high school, high level soccer, awards, etc. I don't know how to explain to the immigration officers that I truly don't want to stay in the USA because I am absolutely in love with Mexico City and wouldn't move back to NC even given the chance... I just wanna see my people again. So any and all suggestions questions or answers are appreciated🙏🏼",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.91,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "16dkr6b",
    "title": "Mexican citizenship/passport question",
    "score": 1,
    "num_comments": 5,
    "author": "Srhabichuelas",
    "created_utc": 1694203809.0,
    "created_readable_utc": "2023-09-08 20:10:09 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/16dkr6b/mexican_citizenshippassport_question/",
    "permalink": "https://reddit.com/r/immigration/comments/16dkr6b/mexican_citizenshippassport_question/",
    "selftext": "Hello!\n\nI’m having trouble understanding Mexico’s citizenship process and was wondering if any of you lovely people could help me. My father was born in Mexico and registered me when I was young. So I have my Mexican birth certificate and a CURP number. I don’t have his birth certificate but I could get it, I do have his certificate of death which was also in Mexico. Here are my questions:\n\nAm I technically a citizen since I have my Mexican birth certificate?\n\nWhat would I need to get a passport? \n\nThanks so much for your help!",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.57,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "165ujhm",
    "title": "Re-entering In Laredo.Tx.",
    "score": 0,
    "num_comments": 5,
    "author": "Antha_Mayfair119",
    "created_utc": 1693438699.0,
    "created_readable_utc": "2023-08-30 23:38:19 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/165ujhm/reentering_in_laredotx/",
    "permalink": "https://reddit.com/r/immigration/comments/165ujhm/reentering_in_laredotx/",
    "selftext": "I am a American citizen and I have to return to the US immediately from Monterrey Mexico.\n\nMy US passport is expired but I also have my\n\nExpired Texas Drivers License,\n\nMy Social security card(original)\n\nMy hospital birth certificate(original)\n\nWill they let me enter into Texas with these by bus??  \n\nI called the consulate here in Monterrey and they said yes you can but it is ultimately up the border guards. I cannot wait the 13 weeks or the 7 weeks expedited to renew. Pleases! anyone with experience on this or help would be greatfully appreciated",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.5,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "15nx003",
    "title": "CRBA Questions: Mexican born baby w/ U.S Citizen Parent, traveling back to the United States",
    "score": 2,
    "num_comments": 30,
    "author": "ChihuahuaNamedTofu",
    "created_utc": 1691723221.0,
    "created_readable_utc": "2023-08-11 03:07:01 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/15nx003/crba_questions_mexican_born_baby_w_us_citizen/",
    "permalink": "https://reddit.com/r/immigration/comments/15nx003/crba_questions_mexican_born_baby_w_us_citizen/",
    "selftext": "\n\nHello everyone! I just gave birth to a sweet baby boy here in CDMX and I live here with my husband who is a Mexican citizen. My Son and I need to go back to the United States mid September. \n\nWe have started the process of getting his passports already: My appointment at the US consulate for his CRBA *(Consular Report of Birth Abroad)* is not until September 5th- I have read that after the appointment I can apply for his US passport which may take 8-12 weeks to receive. I have also requested for my child’s Birth Certificate at the Registro Civil and will need to go through the process of getting his Mexican passport as well but saw that that may take 8 weeks too. \n\nMy question is:\n\nIf I do not receive either passport before mid September will I still be able to travel to the US as long as I present his Mexican certificate of birth (the form I received at the hospital) or his Mexican Birth Certificate? Since I am his mother and am a U.S. citizen? Will they allow us to enter?\n\nHad any one else been through the process of getting a CRBA and child’s passport  in CDMX? How long did it take? Do you have any tips for our appointment so we make sure everything goes smoothly? \n\nIf you did not have either passports, were you able to travel back to the states with your newborn without any passport/ CRBA as long as you can prove you are the parent? We will be entering by land from CDMX to Tijuana via the Cross Border Express and crossing to California. \n\nI also read online that if he has his Mexican passport he can go to the US as long as I present my US Passport. Is this true? If so I am hoping that he gets the Mexican passport soon.\n\nI was able to find this info on help.cbp.gov : \n\n*Children- Travel Documents for infants\nEach American citizen must possess his or her own passport. U.S. and Canadian citizen infants are not required to have a passport for travel by land or sea - although they are required to present a copy of a birth certificate and, if not traveling with both parents, the Department of State suggest a consent letter accompany the other parent(s) due to the rise in instances of child abduction in custody cases, and a growing number of children who are the victims of trafficking.\n\nWhen U.S. citizen children under the age of 16 arrive by land or sea from Canada or Mexico they may present an original or copy of their birth certificate, a Consular Report of Birth Abroad, or a Naturalization Certificate. \n\nIf traveling domestically, a passport is not needed but If you are driving into the United States (U.S.) and have not yet received a birth certificate for a U.S. or Canadian citizen infant, the U.S. Customs and Border Protection (CBP) Officer will accept: the birth record issued by the hospital, a letter on hospital letterhead or a letter from the doctor who delivered the child providing details of the birth, including the name of the child, time and place of birth, and the parent(s) named*\n\nFrom what I understand it says to present a copy of birth certificate, but how soon will I receive his American birth certificate after his CRBA appointment? Or is his Mexican one okay? Or Will I receive a form after my CRBA appointment on Sept 5th that will allow him to travel with me? \n\nAll of this is a lot to navigate with a newborn so any help is much appreciated. Thank you for reading and for any advice",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.75,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "15jqpt5",
    "title": "Countries that welcome a dependent parent",
    "score": 6,
    "num_comments": 33,
    "author": "sunnypatel165",
    "created_utc": 1691331371.0,
    "created_readable_utc": "2023-08-06 14:16:11 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/15jqpt5/countries_that_welcome_a_dependent_parent/",
    "permalink": "https://reddit.com/r/immigration/comments/15jqpt5/countries_that_welcome_a_dependent_parent/",
    "selftext": "Sorry if this is a wrong place but I am in desperate need for advise. It’s probably not a new question but I couldn’t find answers yet. \n\nLong story short, I left my home country (India) to move to US to pursue higher education 6 years ago. I am currently on H1 visa, my wife (a dependent on my visa until she is lucky enough to be picked in the lottery) is also employed. We make good money and are successful in our careers. I have a sibling who is a Swedish citizen, who also has no way (from what we understood) to have our single, dependent parent to live with him for a longer time with a resident permit or equivalent. \n\nI have no hopes of a GC given my country of birth. Even if I had a GC, there’s no way to bring my dependent parent to US ever. She has a tourist visa but I am sure visiting here for 6 months every year, she will be denied entry at some point, even if she doesn’t actually abuse the visa (and doesn’t take any illegal employment). I am just annoyed by this system and I am ready to leave US. \n\nSo I am looking for recommendations on which countries are best suited. I am also open to explore a golden/investment visa, depending on the cost In my next home, I want two freedoms - \n1. Mainly I want to be in a country that supports bringing your dependent parent in, without them having to travel every 6 months or go through some stupid immigration check that looks down on her. \n\n2. I don’t want to be tied/limited to one employer and be able to pursue contract/business/startup income opportunities. Not a deal breaker but nice to have. \n\nTLDR: which countries (that are deemed good places to live of course) will allow a high skilled worker to bring a dependent parent with a permit to reside with them. \n\nThank you for your advise",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.71,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "15iznmp",
    "title": "Child abandonment in mexico",
    "score": 4,
    "num_comments": 11,
    "author": "Middle-Cover-6162",
    "created_utc": 1691251961.0,
    "created_readable_utc": "2023-08-05 16:12:41 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/15iznmp/child_abandonment_in_mexico/",
    "permalink": "https://reddit.com/r/immigration/comments/15iznmp/child_abandonment_in_mexico/",
    "selftext": "Hello, I've recently become engaged to my gf in mexico. I'm a US citizen born n raised in California.\nWell I've been reading about the fiance visa and the wife residency. But here's the issue: she is a mother to a 1 year old son, who I love and support working from LA. The father abandoned the child and the mother right after the birth. He left to another country altogether. At first he sent alittle money but he hasn't sent anything for 6 months and has not seen the child since he left. My fiance does not ever want to co parent with her ex for various reasons. \n\nMy question is does anyone know what the time frame is for abandonment in mexico? Or where to start with this? We are gonna find an attorney but I wanted to get as much info as I could here.\nWe're trying to do the whole nine: change the last name, remove him as parent because we don't see him being cooperative in signing anything for the son to come with her to California with me. \nI read something about if he hasn't seen the child in 6 months we can do something.  It's been a year since any physical contact with the child.\nAny thoughts or suggestions would be appreciated",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.75,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "156bjxb",
    "title": "My Special Case with Twins",
    "score": 3,
    "num_comments": 26,
    "author": "maroondymond",
    "created_utc": 1690004966.0,
    "created_readable_utc": "2023-07-22 05:49:26 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/156bjxb/my_special_case_with_twins/",
    "permalink": "https://reddit.com/r/immigration/comments/156bjxb/my_special_case_with_twins/",
    "selftext": "Hi, everyone!\n\nToday I come to you to ask for advise. I am a mother of twins, they are 7 years old. I'm Mexican, they are Mexicans. Their father is a U.S. citizen, and we were never married. I have cared of them since I gave birth to them, and he has never gave responsibility for them. Now, I'd like to file citizenship for them to allow them to start studying in the U.S. The problem comes when of course, I need their father's complete attention and consent on the process of naturalization. I can't get in direct contact with him because his couple doesn't allow him to talk to me (which obviously is not an acceptable reason) so I can't continue with the process because I need information and consent from him. Of course, we can deduct that this lady is aware of the possibility of me requesting child support. So, I'd really appreciate your advise 🙏Should I sue for child support? Remember I am still Mexican as well as my twins. Or should I continue trying to file the naturalization process by myself? Or is there another suggestion? The twins and I live in Mexico, and he lives in U.S.\n\nThank you so much for your attention ❤️",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.67,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},

{
    "id": "14s1alq",
    "title": "renew your visa on leaving the country",
    "score": 0,
    "num_comments": 3,
    "author": "Asleep_Drop6891",
    "created_utc": 1688627843.0,
    "created_readable_utc": "2023-07-06 07:17:23 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/14s1alq/renew_your_visa_on_leaving_the_country/",
    "permalink": "https://reddit.com/r/immigration/comments/14s1alq/renew_your_visa_on_leaving_the_country/",
    "selftext": "Hello,\r  \nI'm a 21-year-old Frenchman who has to come to Monterrey at the end of July to study until next June. I haven't managed to get a student visa because the procedures are complicated but even after I've done them, there's no appointment or they're after the day of my flight and my arrival...\r  \n\r  \nGiven that the maximum time without a visa in Mexico is 180 days, I absolutely must have a student visa. Another solution I've been thinking about is that when I leave the country (which isn't very far as I'm in Monterrey) I can renew the 180-day visa and finish my school year. \r  \n\r  \nI don't know if this is possible. Have you ever been in a similar situation or have you got any information that could help me? I have my plane in less than 3 weeks and I don't know what to do.\r  \n\r  \nThank you in advance for your answers and help. \r  \n",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.5,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
},
{
    "id": "14rxnhu",
    "title": "Additional Proof of Marriage?",
    "score": 0,
    "num_comments": 2,
    "author": "b3ans0up",
    "created_utc": 1688617153.0,
    "created_readable_utc": "2023-07-06 04:19:13 UTC",
    "url": "https://www.reddit.com/r/immigration/comments/14rxnhu/additional_proof_of_marriage/",
    "permalink": "https://reddit.com/r/immigration/comments/14rxnhu/additional_proof_of_marriage/",
    "selftext": "my husband lives in Mexico and I live in the US. I’m working on filling a petition for Alien Relative and theres a section titled “Additional Proof of Marriage” with examples like proof of joint tenancy, joint ownership of property, birth certificates of children, etc, but because he lives in Mexico, we have never lived together, nor own property or have kids. I’m unsure what I’m supposed to submit here when none of the examples apply to my marriage?",
    "is_self": true,
    "is_video": false,
    "upvote_ratio": 0.33,
    "stickied": false,
    "spoiler": false,
    "over_18": false,
    "link_flair_text": null
}]