[
    {
      "id": "1f0cknv",
      "title": "OCI Application; Discrepancy between full name in address proof and passport.",
      "score": 1,
      "num_comments": 1,
      "author": "Usual_Durian2092",
      "created_utc": 1724525363.0,
      "created_readable_utc": "2024-08-24 18:49:23 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1f0cknv/oci_application_discrepancy_between_full_name_in/",
      "permalink": "https://reddit.com/r/immigration/comments/1f0cknv/oci_application_discrepancy_between_full_name_in/",
      "selftext": "Hello\n\nI am currently applying for OCI from Canada, and I am using my electricity bill as my address proof. I do not have a drivers license and my health and photo card do not hav my latest address.\n\nThere is a minor discrepancy between my first name; specifically, my Passport and Citizenship Cert have \"My Name + Fathers Name\" as my first/given name but my electricity bill only has my first name\n\nExample:\n\nName in Passport and Citizenship Cert: John Dave Smith\n\nName in Electricity Bill: John Smith\n\nWould this cause the application to be rejected ? Can I write a letter explaining that both those names refer to the same individual, with my birth certificate copy attached as proof of middle/fathers name ?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Canada",
        "state": null
      },
      "sex": null,
      "document": "OCI application / address proof / passport"
    },
    {
      "id": "1exh3gy",
      "title": "Active Duty Military Member Seeking Advice on K1 Visa for Iranian Fiancée: Best Country for Interview and Alternative Options?",
      "score": 0,
      "num_comments": 13,
      "author": "ObliviousIdiot89",
      "created_utc": 1724216209.0,
      "created_readable_utc": "2024-08-21 04:56:49 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1exh3gy/active_duty_military_member_seeking_advice_on_k1/",
      "permalink": "https://reddit.com/r/immigration/comments/1exh3gy/active_duty_military_member_seeking_advice_on_k1/",
      "selftext": "Hey everyone,\n\nI'm an active duty military member engaged to an Iranian fiancée. We recently got engaged in Dubai to satisfy the two-year meeting requirement for the K1 Visa. I’m planning to submit the I-129F paperwork soon, but I recently watched a live stream from an Iranian immigration lawyer who advised against applying for a K1 Visa for Iranian citizens. He recommended scheduling a consultation with an immigration lawyer instead.\n\nI’ve been reading that K1 Visa processing times have improved recently, with some cases being approved in under 8 months. However, I'm concerned about potential political changes that might complicate things, such as the possibility of a travel ban being reinstated for Iranians.Additionally, I’m considering the best country for my fiancée to attend her K1 visa interview. Should we look at Ankara, Abu Dhabi, or another location given the current timelines and processing speeds?\n\nAnother option I’m contemplating is sending my fiancée to Mexico or Canada for college while waiting for the K1 Visa. Would this make the process easier or faster in any way, or could it complicate things? I’d really appreciate any advice, personal anecdotes, or guidance you can offer on navigating this process. If you’ve been through something similar, how did you manage, and what would you suggest?\n\nThank you in advance for your help!!!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.33,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": "Hombre",
      "document": "K1 Visa / I-129F"
    },
    {
      "id": "1esdmml",
      "title": "Can I get (US/MX) dual citizenship with only one parent on my birth certificate.",
      "score": 1,
      "num_comments": 0,
      "author": "Sea_Hovercraft_9523",
      "created_utc": 1723671774.0,
      "created_readable_utc": "2024-08-14 21:42:54 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1esdmml/can_i_get_usmx_dual_citizenship_with_only_one/",
      "permalink": "https://reddit.com/r/immigration/comments/1esdmml/can_i_get_usmx_dual_citizenship_with_only_one/",
      "selftext": "Im in my 20s, living in Texas and I want to get my USA-Mexico dual citizenship, since my mom is Mexican, except the issue is that on my birth certificate, my father's name is not there and I have never met him.\n\nBut according to the website of my nearest Mexican consulate, I need both birth certificates of my parents. I'd figure since I only have my mother's name on my birth certificate, I can still apply but since it asks for both, I am unsure?\n\nWill I still be eligible for dual citizenship? Has anyone have experience in this or had a similar situation? What should I do?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.6,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": "Texas"
      },
      "sex": null,
      "document": "Mexican citizenship / birth certificate"
    },
    {
      "id": "1ekc09z",
      "title": "Question about Transmission of Citizenship from estranged U.S Father ",
      "score": 0,
      "num_comments": 10,
      "author": "weedburner69420",
      "created_utc": 1722822652.0,
      "created_readable_utc": "2024-08-05 01:50:52 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1ekc09z/question_about_transmission_of_citizenship_from/",
      "permalink": "https://reddit.com/r/immigration/comments/1ekc09z/question_about_transmission_of_citizenship_from/",
      "selftext": "Hi, I am a 24 year old male born and raised in Canada. My mother is Canadian and my dad has dual citizenship (Canadian and American), in which I know that he has had American citizenship since birth. I have recently been looking into how likely I would be to acquire dual citizenship through transmission, and I feel like I have a claim at citizenship due to my father being listed on my birth certificate. I believe he does have the physical presence requirements as well, as far as I know he was born and raised in the U.S until he was at least 16-18 which is before I was born.\n\nMy main question is, since my father is basically estranged and we have little to no relationship, do I need to get in contact with him to sign the affidavit of parentage and obtain evidence that he is a u.s citizen as well as evidence of physical presence? Also, would my birth certificate with his name on it count as evidence of parentage/legitimation, and child support payments as proof of financial support?\n\n  \nAlso, how would I check if I have been a u.s citizen since birth, would I have been given a CRBA if this is the case? My dad lived in the U.S for at least 5 years before I was born, so I think I should have qualified for that as well but i'm not too sure on the process of finding out.\n\n  \nThank you!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.38,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Canada",
        "state": null
      },
      "sex": "Hombre",
      "document": "US citizenship transmission / CRBA / affidavit of parentage / birth certificate"
    },
    {
      "id": "1egx8ba",
      "title": "Possible problems with flying to Mexico From Dallas and back",
      "score": 0,
      "num_comments": 12,
      "author": "HumbleMarsupial3926",
      "created_utc": 1722457064.0,
      "created_readable_utc": "2024-07-31 20:17:44 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1egx8ba/possible_problems_with_flying_to_mexico_from/",
      "permalink": "https://reddit.com/r/immigration/comments/1egx8ba/possible_problems_with_flying_to_mexico_from/",
      "selftext": "So I’m trying to fly to Mexico and back to Texas for my honeymoon after my wedding ceremony and reception (I got married during COVID we finally saved enough money to have a wedding with celebration and friends). My country of origin is Mexico and I have a Mexican passport with my maiden name(s) and I have a permanent resident card with my married name(expired in February 2024) but I have the I-797 extension of From I-551 for 48 months. So I’m getting a new Mexican passport soon to fly to Mexico in November, I have an appointment in a week to get a new 10 year passport with my married name to make things easier hopefully. I’ve called the Airport, American Airlines(the only flight available for the specific days that’s not a 10 hour flight plus) and the Mexican embassy in Mexico City and all of them have given me little information or referred to websites with .gov that also are vague but I’ve learned that the border agent will have to decide him or herself and I’m just worried about coming back into the U.S. also we were going to bring my Mexican passport with my maiden name, my Mexican birth certificate, my social security card with my married name, our marriage certificate and Texas drivers license sadly I’m still in process of becoming a citizen and can’t get an United States passport in time, also the lady that helped us with this process tells us not to worry we should be fine but I’ve read/heard of some bad stories so we just want to try everything we can, any info will help!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.43,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": "Texas"
      },
      "sex": "Mujer",
      "document": "Permanent resident card / I-797 extension / Mexican passport / travel documents"
    },
    {
      "id": "1eguwtq",
      "title": "L2 visa for possible US citizens",
      "score": 0,
      "num_comments": 7,
      "author": "Adventurous-Fix-9419",
      "created_utc": 1722451421.0,
      "created_readable_utc": "2024-07-31 18:43:41 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1eguwtq/l2_visa_for_possible_us_citizens/",
      "permalink": "https://reddit.com/r/immigration/comments/1eguwtq/l2_visa_for_possible_us_citizens/",
      "selftext": "My friend is a foreign national named \"Susan\" who was in a long-term relationship with a US citizen named \"Andy.\" They were not married.\n\nAndy did live for at least 5 years, 2 after 14 in the US.\n\nThey had two sons, twins. \n\nUnfortunately, Andy died of COVID 3 months after they were born back in 2020.\n\nAfter the death, Susan pushed herself into work and advanced a lot in her career. Now, because of her success, her company wants to transfer her to the US on an L1 visa. The I-129 looks set to be approved in the coming weeks.\n\nNow, to get the twins to the US they face a few issues.\n\n1. Proving biological relationship: Birth certificate has Andy's name. But the closest blood relatives of Andy who are living are Andy's mother (grandmother) and Andy's full brother (uncle). I am not sure if DNA can prove the biological relationship to 99.99 the US consulate may require.\n\n2. Legitimation/acknowledgment of paternity/court adjudication of paternity: The twins would only be legitimated if the parents married. Andy did not acknowledge paternity. He \"declared\" it. Thus, he is on the birth certificate. He did it in the government office where people usually do this. However, we are not sure whether it was \"under oath.\" There is no \"subscribed and sworn to\" in the acknowledgment, but it is signed and stamped by the foreign governmental authority. I should note that the US embassy in the country actually requests this statement when doing CRBA. The other twist is, he did this before the twins were born. As far as court adjudication of paternity, there were no court proceedings for the sole purposes of establishing paternity. Rather, it was in probate, that the foreign court just assumed Andy is the father of the twins because his name was on the birth certificate.\n\nGiven the fact that it is not clear-cut if the children were legitimated and whether the acknowledgment was done properly to get citizenship by US law, is it better if they just straight apply for L2 visa and not waste $100 for the CRBA?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.25,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": null,
      "document": "L2 visa / CRBA / birth certificate / proof of paternity"
    },
    {
      "id": "1edtm3y",
      "title": "Need practical advice for CRBA",
      "score": 0,
      "num_comments": 2,
      "author": "Ok-Size1032",
      "created_utc": 1722122643.0,
      "created_readable_utc": "2024-07-27 23:24:03 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1edtm3y/need_practical_advice_for_crba/",
      "permalink": "https://reddit.com/r/immigration/comments/1edtm3y/need_practical_advice_for_crba/",
      "selftext": "Sorry for long post.\n\nI am a US citizen living outside the US in country A and my partner/girlfriend is a citizen of country B.\n\nAt the end of June, we had a baby who was born in country B.\n\nNow we have started to look into the appointment process for CRBA and here the US embassy doesn't have appointments till late August. They tell us if we have urgent travel back to the US, we need to send them an email.  There are few problems with this:\n\n1. We don't have urgent travel back to the US, but back to country A because of job reasons. We **both** need to be back in country A by end of August. Her job starts at end of August and my paternity leave ends.\n\n2. For the urgent travel request, they expect us to send them a booked travel itinerary. This is odd considering that when foreign nationals apply for visas, the DoS says not to buy any tickets till you have the visa. I would expect similar logic to apply to passports. A passport is even more fundamental to travel than a visa because you can fly many places without a visa depending on which country's citizenship you hold. Why would you buy tickets without a passport?\n\n3. Problem 2 isn't so much of a problem right now because our baby can use country B's passport to travel to country A and get a residence permit in country A. However, we both have work trips to New York to meet clients beginning of September. She has a B1/B2 visa which is fine to use because she is just meeting clients. But we are not sure if we can get a US passport in time for our baby to enter the US by September.\n\nNow, applying for a CRBA from country A will take even more processing time because kid was born in country B so I am not sure CRBA and passport will be finished by September.\n\nIn this situation, looking at our options it seems they are:\n\n1. Get a B1/B2 visa in country A for the baby using visa interview waiver program since the applicant is a minor and a parent holds a B1/B2 visa (aka my gf). Those seem to be faster than CRBA and passport because appointments are within like 14 calendar days. \n\n2. I fly to Mexico with our baby (passport from country B allows visa free travel there). GF flies and enters on B1/B2. My gf, me, and baby show up at the land border to make sure CBP doesn't think I am abducting baby and so they can do a DNA test if they don't believe the birth certificate and we figure it out there.\n\nSo how can I get our baby a US passport before September?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.5,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": "Hombre",
      "document": "CRBA / US passport / B1/B2 visa"
    },
    {
      "id": "1edte8d",
      "title": "US Citizen looking to get Mexican nationality via deceased grandparents and parents",
      "score": 0,
      "num_comments": 23,
      "author": "Practical_Habit5015",
      "created_utc": 1722122025.0,
      "created_readable_utc": "2024-07-27 23:13:45 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1edte8d/us_citizen_looking_to_get_mexican_nationality_via/",
      "permalink": "https://reddit.com/r/immigration/comments/1edte8d/us_citizen_looking_to_get_mexican_nationality_via/",
      "selftext": "Both of my late grandmothers were born in Mexico and immigrated to the USA. They never registered the birth of their US Citizen children (my parents, also now deceased) with Mexico. I have found their births in their respective Mexican states' civil registries but I don't know where to go from here.\n\nThe Mexican Consulate told me that since they are dead, nothing can be done. I got scammed by a company that said it could get Mexican birth certificates issued for everyone necessary to get mine issued.\n\nAny help would be appreciated.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.33,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "Mexican nationality / Mexican birth certificate"
    },
    {
      "id": "1eaothq",
      "title": "H4 EAD Renewal chances while both I-94 and current EAD expiring",
      "score": 1,
      "num_comments": 2,
      "author": "OrneryEbb721",
      "created_utc": 1721783763.0,
      "created_readable_utc": "2024-07-24 01:16:03 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1eaothq/h4_ead_renewal_chances_while_both_i94_and_current/",
      "permalink": "https://reddit.com/r/immigration/comments/1eaothq/h4_ead_renewal_chances_while_both_i94_and_current/",
      "selftext": "\n\nI have a question related to my wife's H4-EAD renewal.\n\n1) Her current H4 EAD is expiring on 09/23/2024\n\n2) Her I-94 expiration date is 09/23/2024\n\n3) Her H4 and my H1 extension is still in-process\n\n4) My Priority date is current and AOS will be filed most likely by this month end\n\n\n\nGiven above situation, once we file her H4 EAD renewal and it goes in-process, will she get an automatic extension or does she have to stop working on her I-94 expiration date ? If so, what all options do I have so that she can continue working while retaining her current job ? Can we fly to Canada  or Mexico and get a new visa stamp and new i-94 ?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Hombre",
      "document": "H4 EAD renewal / I-94 / H4/H1 extension / visa stamp"
    },
    {
      "id": "1ea6yfk",
      "title": "Delayed birth Certificate",
      "score": 2,
      "num_comments": 1,
      "author": "xomisssh",
      "created_utc": 1721738821.0,
      "created_readable_utc": "2024-07-23 12:47:01 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1ea6yfk/delayed_birth_certificate/",
      "permalink": "https://reddit.com/r/immigration/comments/1ea6yfk/delayed_birth_certificate/",
      "selftext": "Delayed birth Certificate\n\nHave a question hopefully someone can help, I was born in Hobbs nm in 1999, at the time my mother was illegal and had me with the help of a midwife.... I was never registered and she moved to Borger Tx 2 years later. Now she tried to register me in Tx but they told her she had to go to nm because that's where I was born. She was never able to go and unfortunately both my parents were deported. i've been in mexico since 2012 and i don't have any identity, went to the american consulate and they encouraged me not to cross the border and send prove to nm, now i'm afraid my documents get lost so i was thinking in crossing the border with my 2 adult siblings and go to court myself idk if that's the best option, i have my baptism certificate, social security number, school and medical records as proof ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": null,
      "document": "Delayed birth certificate / US citizenship proof"
    },
    {
      "id": "1e9mwws",
      "title": "BCC renewal waiting times for my wife - is this normal?",
      "score": 1,
      "num_comments": 3,
      "author": "JJVMT",
      "created_utc": 1721676263.0,
      "created_readable_utc": "2024-07-22 19:24:23 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1e9mwws/bcc_renewal_waiting_times_for_my_wife_is_this/",
      "permalink": "https://reddit.com/r/immigration/comments/1e9mwws/bcc_renewal_waiting_times_for_my_wife_is_this/",
      "selftext": "**EDIT: We just used the Visa Status Check page (which I didn't know about until today), which says that the BCC was approved last Wednesday (July 17, 2024). However, my wife still has not received any email, let alone a DHL tracking number. Is this normal? If we don't have a tracking number by this Wednesday, we're going to write to the relevant email (since the page says to follow up if no number has been sent after 5 business days).**\n\nHi all!\n\nI'm seeking some insights about the current processing times for a Border Crossing Card (BCC) renewal. Here’s the situation:\n\nI'm a U.S. citizen residing in Mexico, and my wife, who is Mexican, recently had her BCC renewal appointment. It took place on June 26, 2024, in Mexico City, and so far, we haven't received any updates.\n\nI understand that the typical processing time is around 8 to 12 weeks, so under normal circumstances, I wouldn't be too concerned about the lack of news at this stage. However, something has made me wonder about the lack of follow-up so far.\n\n**Comparison to My Half-Brother's Experience:**\n\nMy half-brother and his family, all Mexican citizens without dual citizenship, had their BCC appointment in April of this year. Despite several previous denials, they were approved within a week of their appointment. During their interview, they were informed of their approval on the spot.\n\nNotably, my father, who is also my half-brother's father, had requested assistance from our Senator (Patty Murray, of Washington state), asking for special consideration to help my half-brother and his family get approved in light of their previous denials. I would suspect this intervention played a role in their swift approval process.\n\n**Factors I'm Considering:**\n\n1. **Application Timing:**\n   * My half-brother and his family submitted their application over a year ago, potentially allowing consular officials more time to pre-review their documentation.\n   * In contrast, my wife received her renewal appointment just one month after submitting her application, which might not have provided enough time for a thorough review.\n2. **Senatorial Intervention:**\n   * My half-brother's case had the added benefit of the senatorial support mentioned above, which we did not seek for my wife's application. Could this have expedited their process?\n3. **Renewal vs. First-Time Applications:**\n   * Does anyone know if renewals typically take longer than first-time applications? Could the shorter interval between application submission and the appointment for renewals be a factor in longer processing times?\n\n**Conclusion:**\n\nGiven that my wife previously held a 10-year BCC with a spotless record, which expired in November 2023, I'm curious if the lack of news on her renewal is within the norm or if there might be other factors at play.\n\nAny insights or similar experiences would be greatly appreciated. Thanks for your help!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.67,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": "Hombre",
      "document": "Border Crossing Card (BCC) renewal"
    },
    {
      "id": "1e9kbxx",
      "title": "Help with my current legal situation...",
      "score": 2,
      "num_comments": 5,
      "author": "Arealcunt_",
      "created_utc": 1721670032.0,
      "created_readable_utc": "2024-07-22 17:40:32 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1e9kbxx/help_with_my_current_legal_situation/",
      "permalink": "https://reddit.com/r/immigration/comments/1e9kbxx/help_with_my_current_legal_situation/",
      "selftext": "Hello, I want some orientation towards my case\n\nI was born in the USA, both my parents were illegal immigrants and just after a year, they decided to go back to Mexico\n\n  \nthe thing is... I have both the birth certificate and a social security number\n\nI would like to travel to the USA someday and well... I was wondering if my situation could help me getting over there more easily ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.6,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": null,
      "document": "US birth certificate / SSN / US travel"
    },
    {
      "id": "1e96osq",
      "title": "Help Needed: No Entry Record for My Mom's Immigration Case - Seeking Advice and Lawyer Recommendations",
      "score": 1,
      "num_comments": 8,
      "author": "Ok-Pie4781",
      "created_utc": 1721626961.0,
      "created_readable_utc": "2024-07-22 05:42:41 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1e96osq/help_needed_no_entry_record_for_my_moms/",
      "permalink": "https://reddit.com/r/immigration/comments/1e96osq/help_needed_no_entry_record_for_my_moms/",
      "selftext": "Hello everyone,\n\nI am reaching out to this community for some advice and guidance on a challenging immigration issue my mom is facing. Here’s the situation:\n\n**Background:**\n\n* My mom entered the USA from Mexico in January 2017.\n* Unfortunately, she has no official entry records, as she entered without inspection.\n* She has been living in the USA continuously since then, and I am a US citizen now looking to help her adjust her status.\n\n**Issues:**\n\n1. **No Entry Record**: Given that my mom has no official entry record, I am unsure how to proceed with her adjustment of status. Has anyone faced a similar situation and successfully resolved it? Any advice or strategies would be greatly appreciated.\n2. **Adjustment of Status**: With the recent changes in immigration law allowing those who have lived in the US for 10 years to adjust status without leaving the country, how can we leverage this new regulation considering her lack of entry records?\n3. **Seeking Legal Assistance**: If it turns out that professional legal help is unavoidable, could anyone recommend a reliable and experienced immigration lawyer who has dealt with similar cases?\n\n**What We Have Done So Far:**\n\n* We have gathered various documents proving her continuous residence in the US, such as utility bills, medical records, and affidavits from friends and family.\n* We are prepared to submit Form I-485 and any supporting documents required by USCIS.\n\nAny advice, similar experiences, or lawyer recommendations would be incredibly helpful. Thank you in advance for your time and assistance!\n\n# ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.67,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "Adjustment of status / I-485 / proof of entry"
    },
    {
      "id": "1e1v9ec",
      "title": "Clothing to wear at us embassy",
      "score": 100,
      "num_comments": 128,
      "author": "GasFirm5218",
      "created_utc": 1720825286.0,
      "created_readable_utc": "2024-07-12 23:01:26 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1e1v9ec/clothing_to_wear_at_us_embassy/",
      "permalink": "https://reddit.com/r/immigration/comments/1e1v9ec/clothing_to_wear_at_us_embassy/",
      "selftext": "I need some advice. My partner is an American citizen and she has given birth. We are going to the embassy for the CRBA appointment.\n\nShe wants to wear a T-shirt that talks and shows people performing sex acts. It uses explicit language. She says that it is her \"God-given First Amendment right\" to wear the T-shirt. She claims that not even \"God himself can stop my son from being a citizen\"\n\nIf she wears this T-shirt will it affect our future immigration if we get married?\n\nWill they still give the CRBA? What can I do to make the consular officer understand that this is her idea, not mine so we don't have trouble in future? I love her but sometimes she is a bit different.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.79,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": "Hombre",
      "document": "CRBA"
    },
    {
      "id": "1e1j2jb",
      "title": "Received 221g to send long form birth certificate",
      "score": 1,
      "num_comments": 5,
      "author": "rx915",
      "created_utc": 1720794558.0,
      "created_readable_utc": "2024-07-12 14:29:18 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1e1j2jb/received_221g_to_send_long_form_birth_certificate/",
      "permalink": "https://reddit.com/r/immigration/comments/1e1j2jb/received_221g_to_send_long_form_birth_certificate/",
      "selftext": "Appointment went well except I hadn't realized I had a short form birth certificate. I was given a 221g asking for it. I followed the instructions in the email they received, generated the courier-in certificate but it seems there's no way to have the document collected from me, do I really have to travel to a DX facility?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.67,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": null,
      "document": "long form birth certificate / 221g"
    },
    {
      "id": "1e152dc",
      "title": "Weird situation",
      "score": 0,
      "num_comments": 4,
      "author": "Ok-Respond1620",
      "created_utc": 1720746952.0,
      "created_readable_utc": "2024-07-12 01:15:52 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1e152dc/weird_situation/",
      "permalink": "https://reddit.com/r/immigration/comments/1e152dc/weird_situation/",
      "selftext": "I know of three people who hold somewhat different beliefs than many other people. \n\nAll of this stuff happened overseas \n\nBut without getting into their beliefs I will describe the situation:\n\n1. An American man, named \"Jim\" \"naturally conceived\" (not my words) a child with an American woman named \"Jane\"\n\n2. But Jane has a female foreign unmarried partner named \"Doe\" who acknowledged herself as the legal parent of the child who Jane is pregnant with. Jane is still pregnant and hasn't given birth\n\n3. Jane was born abroad to a US citizen and holds US citizenship that way, so she hasn't lived in the US\n\n4. Jim has lived in the US \n\n5. Everyone is single and not married or in any sort of civil partnership and very cooperative with each other\n\nWhat can they do to get US citizenship for the child? Everyone wants to be a parent, perhaps not in the legal sense, but definitely in the familial sense. They are polyamorous.\n\nThe birth certificate will show Jane and Doe as the legal parents.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.5,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": null,
      "document": "US citizenship / birth certificate"
    },
    {
      "id": "1dvmfj7",
      "title": "My wife has an immigratioin interview, and we feel that she may not have all the documents",
      "score": 0,
      "num_comments": 14,
      "author": "rusted_iron_rod",
      "created_utc": 1720142901.0,
      "created_readable_utc": "2024-07-05 01:28:21 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1dvmfj7/my_wife_has_an_immigratioin_interview_and_we_feel/",
      "permalink": "https://reddit.com/r/immigration/comments/1dvmfj7/my_wife_has_an_immigratioin_interview_and_we_feel/",
      "selftext": "Edit: She went to her interview and she passed.  Some of you numbskulls think you know better but haven't even read my post and began to comment things you didn't understand when you failed to read my post.  We have turned in all evidence prior to the interview. At the interview, the interviewer had all the information that we provided beforehand, therefore only asked to see her green card.  I'm sure you all had a hard time with your process because you couldn't read a 3 paragraph post without misinterpreting it.  To those that did read my post and gave me good advice: thank you.  The notice to appear was generic, and did not pertain to my case. I made sure that all required documents were submitted 3 months prior to the interview.  Nothing was needed, just pass the civics and English test, which took her all of 3 minutes of the interview and she was approved for citizenship.\n\n\n\nWe were married in Mexico back in February of 2013, and she emigrated to the US in 2015. We don't know what happened to the original marriage certificate. We had it when we applied for her green card and for the citizenship, but somehow it got lost.  All we have is a copy that has a translation overlay over it, so the words are in English.  It also came with its certification of translation.\n\nWe filled out the N-400 online and turned in all the required documents with the application online, so they should have access to the copies.  The interview was vague on what to bring other than her green card, and information online is very unreliable.  I turned in our tax info, our rental agreement, to show that she is paying taxes and that we live together. Everything that the N-400 asked, we provided it.  Why is the interview asking to bring this information with us? It seems like generic information. I will be going with her and providing my birth certificate and passport and Federal government ID card, in case they ask me to step inside and to swear testimony and ask relationship questions.  I am so anxious and worrying about everything.\n\nAm I missing something?  She smashed the 100 civics questions (2008) that I tested her on, and her English is good enough.  She isn't a terrorist, an insane anarchist-activist, or a criminal.  She has lived in the US for 9 years, never committed a crime, doesn't have anti-American views, attends church, pays taxes, and is a good citizen.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.5,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Hombre",
      "document": "N-400 interview / marriage certificate / green card"
    },
    {
      "id": "1dt1ubt",
      "title": "Girlfriend had our child while in the middle of divorce",
      "score": 0,
      "num_comments": 4,
      "author": "Specialist-Kale-7089",
      "created_utc": 1719862455.0,
      "created_readable_utc": "2024-07-01 19:34:15 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1dt1ubt/girlfriend_had_our_child_while_in_the_middle_of/",
      "permalink": "https://reddit.com/r/immigration/comments/1dt1ubt/girlfriend_had_our_child_while_in_the_middle_of/",
      "selftext": "Hi,\n\nMy girlfriend lives in a country where divorcing a spouse takes a long time. It requires a lengthy separation if there is no mutual consent. In the middle we moved in with each other and she had our child.\n\nWe are in the middle of legal proceedings to establish that I am the father and a DNA test has been taken. However, it will be some more time until a final order of paternity is done and I am declared the legal father, after which there will be a custody order.\n\nGiven all this, I am not sure if my child is eligible for US citizenship. When my child was born, his legal parents were my girlfriend and her soon-to-be-ex-husband. So the child is considered as born in-wedlock. Then we go to INA 301 which determines US citizenship for those born in-wedlock and it says that one of the parents must be a US citizen, which of course makes sense. When I looked at the decisions of *Scales v INS* it says\n\n> The INA does expressly require a blood relationship between a person claiming citizenship and a citizen father, if the person is born out of wedlock.   See 8 U.S.C. § 1409(a)(1) (setting forth legitimation requirements for a person born out of wedlock to a citizen father).   This provision does not apply to Petitioner, however, because he was born to parents who were married at the time of his birth.\n\nSo does this mean that since my child **at birth** had two legal parents who were married to each other, INA 309 cannot be applied to my child and that only INA 301 applies? In which case, my child does not get citizenship because INA 301 requires at least one parent to be a US citizen, and neither of the legal parents at birth were US citizens? INA 301 applies to legitimate children and my child is legitimate as he was born when his legal parents **at birth** were married to each other. The only thing is, one of his legal parents was not the actual biological father.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.29,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": "Hombre",
      "document": "US citizenship (child born abroad/in wedlock) / proof of paternity"
    },
    {
      "id": "1dp4lvk",
      "title": "Questions about petition for a Green card for parents living outside the US - and the process after that ",
      "score": 0,
      "num_comments": 13,
      "author": "Highknee77",
      "created_utc": 1719423592.0,
      "created_readable_utc": "2024-06-26 17:39:52 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1dp4lvk/questions_about_petition_for_a_green_card_for/",
      "permalink": "https://reddit.com/r/immigration/comments/1dp4lvk/questions_about_petition_for_a_green_card_for/",
      "selftext": "Hey everyone \n\nMy wife and I are recent US citizens. We have parents living outside the US that are foreign citizens.\n\nWe are considering doing the petition to get a green card for our parents and I have a few questions:\n\n1. [Various sources seem to state that ](https://usafacts.org/articles/how-long-does-family-based-immigration-to-the-us-take/#:~:text=The%20median%20processing%20time%20for,months%20between%202013%20and%202023.&text=Home%20%2F%20Population%20and%20society%20%2F%20Articles,immigration%20to%20the%20US%20take%3F)it takes much shorter to get a parent a green card than e.g. siblings - for example around 1-2 years - is this correct? \n\n2. Our parents are currently not considering moving to the US but we were thinking we should get the process of the green card going in any case given the length of time it could take to process. Once they get the green card would it just be possible then for them to come into the US every now and then (e.g. once or twice a year) to \"keep the green card active\" without having to apply for a re-entry permit and can we do that indefinitely until they are ready to settle here permanently? Which may be several years down the line \n\n3. My wife's mother is remarried - does that mean that only her mother (who is her mother by birth) can apply for the green card but not her husband (we consider him like a father - but he is not her birth father) ? Does he need to apply separately through her as a spouse? I wouldn't want to split them up for any long period of time obviously \n\n4. Once they have the green card and reside here permanently. Can they eventually also become US citizens? For us it was just over 5 years from receiving our green card to citizenship. Would it be the same for them ?\n\nThanks!\n\n",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.29,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Hombre",
      "document": "Green card (parents) / re-entry permit / US citizenship"
    },
    {
      "id": "1dmgbqg",
      "title": "State Department denied passport",
      "score": 0,
      "num_comments": 17,
      "author": "Ill-Firefighter5913",
      "created_utc": 1719125989.0,
      "created_readable_utc": "2024-06-23 06:59:49 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1dmgbqg/state_department_denied_passport/",
      "permalink": "https://reddit.com/r/immigration/comments/1dmgbqg/state_department_denied_passport/",
      "selftext": "The embassy denied my kid a passport despite approving the crba. They claim they need the permission of my girlfriend's ex-husband. They did a DNA test and found out I'm the father. That's how they approved the CRBA. The law states they need both parent's consent. 22 C.F.R. 51.28\n\n> Except as specifically provided in this section, both parents or each of the minor's legal guardians, if any, whether applying for a passport for the first time or for a renewal, must execute the application on behalf of a minor under age 16 and provide documentary evidence of parentage or legal guardianship showing the minor's name, date and place of birth, and the names of the parent or parents or legal guardian. \n\nMy girlfriend is parent number 1 and I'm parent number 2 because we had sex. The regulations don't say they need the permission of some third person. They say \"both parents.\" I'm already a parent as recognized by the fact that the CRBA contains my name. You can't have one meaning of parent and father for the CRBA and another for the passport consent.\n\nWhat sort of bullshit is this? Given that people can only have two parents, why do they need the ex-husband's permission? He's not related to the kid.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.4,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": "Hombre",
      "document": "US passport (child) / CRBA / parental consent"
    },
    {
      "id": "1dk8k3d",
      "title": "USA Immigration Help!",
      "score": 0,
      "num_comments": 8,
      "author": "homeonthecreek",
      "created_utc": 1718880223.0,
      "created_readable_utc": "2024-06-20 10:43:43 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1dk8k3d/usa_immigration_help/",
      "permalink": "https://reddit.com/r/immigration/comments/1dk8k3d/usa_immigration_help/",
      "selftext": "Back in 2019 I moved to the USA after I got my CONDITIONAL Green Card. I had no idea that it was “conditional” and that within 9 months, I had to send another form to get the conditions removed (basically prove that I’m still married). \n\nWell silly me, having just given birth and at the height of Covid, thought I had to apply for a green card RENEWAL after two years and happily sent off my forms for that.\n\nSo at this point I already 1. Missed the deadline to remove conditions and my green card was technically kaput and 2. Filed the wrong form.\n\nWell I had no idea because it has taken nearly THREE YEARS for them to tell me that I filed the wrong form and that it was denied.\n\nNow I am a sitting duck and have no clue what forms to file. It’s going to cost another $3000 if I start from scratch and trying to avoid that. Has anyone had experience with this and/or know what forms to send off now? \n\nHELP",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.25,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Mujer",
      "document": "Conditional Green Card / Removal of Conditions (I-751)"
    },
    {
      "id": "1dk3ves",
      "title": "Boyfriend might be a US citizen",
      "score": 13,
      "num_comments": 11,
      "author": "CapitalSalad7081",
      "created_utc": 1718860687.0,
      "created_readable_utc": "2024-06-20 05:18:07 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1dk3ves/boyfriend_might_be_a_us_citizen/",
      "permalink": "https://reddit.com/r/immigration/comments/1dk3ves/boyfriend_might_be_a_us_citizen/",
      "selftext": "Hello everyone, \n\nI need some advice and guidance. My boyfriend is a German citizen above age 18. However, he was born out of wedlock to an American father station in Germany. \n\nHis father is on the German birth certificate and did do a Vaterschaftsanerkennung (\"paternity recognition\").\n\nHis father has 5 years of physical presence.\n\nHis father never married his mother.\n\nGiven how many American soldiers have been stationed in Germany and the pretty common fact that many soldiers seem to have casual relationships with the local population that result in children, I'm hoping I am not the first to come across this situation. If anyone has seen this before and successfully applied for a US passport or N-600, I would love to know what was the experience.\n\nOtherwise, I'd need to file an I-130 for him.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.76,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Germany",
        "state": null
      },
      "sex": "Mujer",
      "document": "US citizenship (child born abroad out of wedlock) / N-600 / US passport / German birth certificate / Vaterschaftsanerkennung"
    },
    {
      "id": "1dd3hon",
      "title": "Can I get a Mexican passport in Mexico as someone who wasn’t born here?",
      "score": 0,
      "num_comments": 8,
      "author": "Great-Moment5483",
      "created_utc": 1718073014.0,
      "created_readable_utc": "2024-06-11 02:30:14 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1dd3hon/can_i_get_a_mexican_passport_in_mexico_as_someone/",
      "permalink": "https://reddit.com/r/immigration/comments/1dd3hon/can_i_get_a_mexican_passport_in_mexico_as_someone/",
      "selftext": "So I’m from the US, and I recently moved to Mexico. My father is Mexican, so I was able to get my Mexican birth certificate/citizenship right before I left. \n\nHowever, I didn’t realize how important it would be to have an identification number here lol. Can I get that with my mexican birth certificate, or will I need a Mexican passport in order to get that? \n\nCan I get a Mexican passport in Mexico, or do I have to travel all the way back to the US to get that? \n\nLol help plz😫🙏 ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.43,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": null,
      "document": "Mexican passport / Mexican birth certificate / Mexican ID number"
    },
    {
      "id": "1dcqyto",
      "title": "Citizenship claim outside the USA",
      "score": 7,
      "num_comments": 24,
      "author": "Common_Horse_1995",
      "created_utc": 1718039934.0,
      "created_readable_utc": "2024-06-10 17:18:54 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1dcqyto/citizenship_claim_outside_the_usa/",
      "permalink": "https://reddit.com/r/immigration/comments/1dcqyto/citizenship_claim_outside_the_usa/",
      "selftext": "Can a person file a N-600 while she is a located outside the USA? \n\nThe person has a friend in the USA who is willing and able to receive mail from USCIS.\n\nThis person has a possible derivative citizenship claim, but the custody issue is a bit unclear, so she wishes to apply for n600 because it seems to be superior form of proof of citizenship.\n\nShe was born out of wedlock and father is on birth certificate. Only her mother naturalized though. She was given immigrant visa as dependent of her mother.  But father was asked by us embassy to sign a consent form so that daughter could get immigrant visa and go to USA. \n\nClaim falls under CCA.\n\nShe doesn't wish to apply for passport until she gets the certificate of citizenship because sometimes state department doesn't assess citizenship claims properly.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.89,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": null,
      "document": "N-600 / Certificate of Citizenship / derivative citizenship"
    },
    {
      "id": "1db8o37",
      "title": "Niece born in Mexico but never registered, raised in the US",
      "score": 1,
      "num_comments": 7,
      "author": "Automatic_Slip_3507",
      "created_utc": 1717869373.0,
      "created_readable_utc": "2024-06-08 17:56:13 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1db8o37/niece_born_in_mexico_but_never_registered_raised/",
      "permalink": "https://reddit.com/r/immigration/comments/1db8o37/niece_born_in_mexico_but_never_registered_raised/",
      "selftext": "Hello, I have been taking care of my niece who is now 21. Her mother brought her to the US when she was 2 and never registered her in Mexico so she has no birth certificate. She only has a vaccination record and certificate of birth. My niece has no contact with her mother, who became a citizen 5 years ago, and her mother is not willing to help her. Is there a way I can help her get registered in Mexico so she can get a birth certificate and start trying to apply for a green card/citizenship? ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.6,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "Mexican birth certificate / Green card / US citizenship"
    },
    {
      "id": "1d96zu1",
      "title": "Original documents ",
      "score": 1,
      "num_comments": 2,
      "author": "lobalina",
      "created_utc": 1717638809.0,
      "created_readable_utc": "2024-06-06 01:53:29 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1d96zu1/original_documents/",
      "permalink": "https://reddit.com/r/immigration/comments/1d96zu1/original_documents/",
      "selftext": "Hello everyone! I have a k1 visa interview in France in a few days and I don’t want anything to go wrong or get denied so I’m wondering about what they mean by original documents. The only original thing I have ( given to me in hand ) was the police certificate and the birth certificate, otherwise everything was set through emails and printed including the forms. Can someone clarify this for me please? ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "France",
        "state": null
      },
      "sex": null,
      "document": "K1 visa interview / original documents / police certificate / birth certificate"
    },
    {
      "id": "1d90wet",
      "title": "Unable to get Mexican dual citizenship due to different last names.",
      "score": 1,
      "num_comments": 7,
      "author": "Any_Blueberry3086",
      "created_utc": 1717621604.0,
      "created_readable_utc": "2024-06-05 21:06:44 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1d90wet/unable_to_get_mexican_dual_citizenship_due_to/",
      "permalink": "https://reddit.com/r/immigration/comments/1d90wet/unable_to_get_mexican_dual_citizenship_due_to/",
      "selftext": "I'm wondering if anyone has had any issues with obtaining Mexican citizenship because of a different last name than the parent they are trying to get the citizenship through.\n\n  \nMy mom was born in Mexico and her maiden name is my middle name. My father's last name is my last name. I went to the Mexican consulate and was told that because her maiden name is listed as my middle name and not my last name I am unable to get citizenship through her. I was told I would either need some sort of approval or signature from my father or his birth certificate and my parent's marriage certificate (I am not in contact with him and would be unable to obtain any of these.)\n\n  \nHas anyone had any similar experiences or have any advice on how to go about this?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.67,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": null,
      "sex": null,
      "document": "Mexican citizenship / birth certificate / name discrepancy"
    },
    {
      "id": "1d6m5lw",
      "title": "Mother looking for asylum, US baby",
      "score": 0,
      "num_comments": 17,
      "author": "yoshiki2",
      "created_utc": 1717359025.0,
      "created_readable_utc": "2024-06-02 20:10:25 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1d6m5lw/mother_looking_for_asylum_us_baby/",
      "permalink": "https://reddit.com/r/immigration/comments/1d6m5lw/mother_looking_for_asylum_us_baby/",
      "selftext": "Asking for a friend, as her english is not good:\n\nHello,\n\nIs it possible to apply for asylum after being in the United States for over a year?\n\nI have a U.S. citizen child who has had health issues since birth because the doctor didn’t properly care for me, and he was deprived of oxygen for a while during delivery. Now, he (a year and a half old) receives therapy, which is extremely taxing for my husband and me. I suffer from Lupus and am in constant pain due to flares.\n\nI am originally from Peru. My family had to leave the country because we were not safe, especially after an earthquake destroyed a city, making life difficult for my parents. We had to leave to preserve our lives.\n\nMy husband is from Mexico and also had to escape due to drug cartels. Since he lived near the border with a permit, the cartels threatened him to become a drug mule or die. This forced him to flee the country. He has been in the U.S. for more than ten years now.\n\nIt has been more than five years since I came to the U.S. I met my husband here, and that’s how we had our baby. We are a family. Is there a chance of applying for asylum? Will the fact that my child needs special attention and that I need to be with him somehow help our case?\n\nI contacted an attorney for an asylum consultation, and they quoted me $500 just for him to hear my case. I’m not sure if this is worthwhile or if we even have a possibility of success. We are afraid of trying and then having to go back, as not only our lives are in danger, but also my baby’s.\n\nThank you",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.26,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Mujer",
      "document": "Asylum"
    },
    {
      "id": "1d51611",
      "title": "Obtaining citizenship through a US parent but parent is unwilling to provide documentation?",
      "score": 42,
      "num_comments": 39,
      "author": "jdmfan777",
      "created_utc": 1717176502.0,
      "created_readable_utc": "2024-05-31 17:28:22 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1d51611/obtaining_citizenship_through_a_us_parent_but/",
      "permalink": "https://reddit.com/r/immigration/comments/1d51611/obtaining_citizenship_through_a_us_parent_but/",
      "selftext": "I (Canadian) have received a great job offer in the United States that I am looking to take. I am able to take it on a TN Visa but would really like to move *and stay* down there if I do make the move, given that the opportunities in my field are better in the USA.  \n\nMy mother is a US citizen and current Canadian permanent resident since she became an adult and she fits the residency requirements for my year of birth in 1994 as per the US Embassy: *A child born outside of the United States to one U.S. citizen parent and one non-U.S. citizen parent may be entitled to citizenship providing the U.S. citizen parent had been physically present in the United States or one of its outlying possessions for five years, at least two years of which were after s/he reached the age of fourteen.*\n\nThe issue is that my mother is staunchly anti-American (which is a bit ironic) and is refusing to provide anything proving her presence in the USA prior to her arriving in Canada.  Is there anyway that I can go through this process without her participation?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.87,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Canada",
        "state": null
      },
      "sex": null,
      "document": "US citizenship (transmission) / proof of physical presence / TN Visa"
    },
    {
      "id": "1cuiadg",
      "title": "Traveling outside of US, should the name on the plane ticket match green card or passport? ",
      "score": 6,
      "num_comments": 21,
      "author": "11223344really",
      "created_utc": 1715985256.0,
      "created_readable_utc": "2024-05-17 22:34:16 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cuiadg/traveling_outside_of_us_should_the_name_on_the/",
      "permalink": "https://reddit.com/r/immigration/comments/1cuiadg/traveling_outside_of_us_should_the_name_on_the/",
      "selftext": "We are traveling to Mexico and my mom is a green card holder whose Mexican passport and green card do not exactly match. We are not sure what name to use for the plane ticket so she doesn’t have a problem getting through security in Mexico. Her green card has her name as (using fake name) Deborah Sofia Gomez de García, with Gomez being her surname and Garcia being her spouse’s surname. Her Mexican passport has it as Deborah Sofia Gomez Flores, with Flores being her mom’s maiden name, and García being in a separate section under surname of spouse. When she applied for her Mexican passport she was told they don’t attach surnames for women, like “de García”, anymore and just use the name given at birth. We figure the name on her passport is the way to go, but should we add spouses surname at the end or just use her birth name. Also will this affect her entering back into the US?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.75,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "Green card / Mexican passport / plane ticket name match"
    },
    {
      "id": "1cp0zia",
      "title": "BIL US Citizen in coma after accident, need help on Emergency visa",
      "score": 10,
      "num_comments": 19,
      "author": "Pandicorns_are_real",
      "created_utc": 1715377189.0,
      "created_readable_utc": "2024-05-10 21:39:49 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cp0zia/bil_us_citizen_in_coma_after_accident_need_help/",
      "permalink": "https://reddit.com/r/immigration/comments/1cp0zia/bil_us_citizen_in_coma_after_accident_need_help/",
      "selftext": "My BIL was a passenger in a car wreck, he is in bad shape coma etc, Hospital wrote a letter to kindly allow his mom to come into the country to see him, she is in Mexico, was denied entry. What is needed, I really can't pinpoint exactly what forms she needs to fill out to let her in. She was had a deportation order and left the US in 1993, he was born in 1992, she never came back or ever applied for a Visa. She was 17 at the time she gave birth and left. Please any guidance will be greatly appreciated.\n\nEdit Update, she has her emergency Visa Appointment in Monterrey, two Senators reached out and wrote letters to the consulate, my BIL is stable and slowly getting better.\n\nUpdate 2 , her visa has been approved! She gets in a day and leaves asap to hospital, thank you all for the advise and tips.\n\nUpdate 3 she is with her son! ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.81,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": "Monterrey"
      },
      "sex": null,
      "document": "Emergency visa / waiver (due to deportation order)"
    },
    {
      "id": "1cm1ugh",
      "title": "How quickly can I get a passport for my baby?",
      "score": 0,
      "num_comments": 10,
      "author": "Illustrious_Dig_6916",
      "created_utc": 1715051096.0,
      "created_readable_utc": "2024-05-07 03:04:56 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cm1ugh/how_quickly_can_i_get_a_passport_for_my_baby/",
      "permalink": "https://reddit.com/r/immigration/comments/1cm1ugh/how_quickly_can_i_get_a_passport_for_my_baby/",
      "selftext": "So, I'm a US citizen by birth and lived in the USA till I graduated from college. \n\nI live in Europe and my foreign girlfriend has given birth 2 months ago.\n\n1. How fast can the US embassy issue a passport? \n\n2. Is there anyway I can get a passport by the end of the week even though there's no emergency? \n\n3. I also have dual citizenship between Ireland and USA. This means that my baby will have triple citizenship due to my girlfriend. Does my baby have to choose? \n\n4. Can we use ESTA?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.5,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Europe",
        "state": null
      },
      "sex": "Hombre",
      "document": "US passport (baby born abroad) / CRBA"
    },
    {
      "id": "1clonjk",
      "title": "I am dual USA/MEX citizen born in the USA but currently living in Mexico. My 2 sons born in Mexico were just given their USA citizenship and passports. For my Mexican wife of 10 years to be able to visit the USA with us as a family, what is the best way to do that?",
      "score": 1,
      "num_comments": 14,
      "author": "setdelmar",
      "created_utc": 1715016123.0,
      "created_readable_utc": "2024-05-06 17:22:03 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1clonjk/i_am_dual_usamex_citizen_born_in_the_usa_but/",
      "permalink": "https://reddit.com/r/immigration/comments/1clonjk/i_am_dual_usamex_citizen_born_in_the_usa_but/",
      "selftext": "My kids have never been to the USA, they are 7 and 4 right now and family members and childhood friends would really like to see us all. My wife is not sure if she would want to live in the USA or not but would at least like to be able to visit. I am not sure if we should move up there or not either, but as well would like to be able to all go up as a family if we would want to.   \n  \nI was told that getting a visa for her would probably not pan out as the agent would likely deny it because her husband and sons are American citizens. But If we were to get her residence, wouldn't we be obligated to spend certain periods of time in the states while that was being processed or something to that effect?",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.6,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": "Hombre",
      "document": "US visa / Green card (spouse)"
    },
    {
      "id": "1cl8422",
      "title": "Mexican Dual Citizenship",
      "score": 1,
      "num_comments": 0,
      "author": "jose72598",
      "created_utc": 1714962023.0,
      "created_readable_utc": "2024-05-06 02:20:23 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cl8422/mexican_dual_citizenship/",
      "permalink": "https://reddit.com/r/immigration/comments/1cl8422/mexican_dual_citizenship/",
      "selftext": "So I had recently started gathering documents to obtain my dual citizenship as my dad was born in Mexico. I just returned from a trip to Mexico City last weekend to the surprising news that my wait wouldn’t be as long as my birth certificate showed proof that my father was a Mexican citizen. I set an appointment for the local consulate this coming Friday. I have an application and am getting the documents from my dad tomorrow….So I have two questions\n\n1) Is the process for citizenship as simple as everyone is making it out to be due to the changes and the removal of the apostille process? And if anyone has gotten appointment with a consulate what is the new process? \n\n2) I recently got engaged and although my fiance is of Mexican origin, she is 4th generation American. Would she be able to obtain citizenship through our marriage in the future?\n",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Hombre",
      "document": "Mexican citizenship / birth certificate"
    },
    {
      "id": "1cjzm2g",
      "title": "Immigration Case Involving Parents with Previous Removal Proceedings and Notario Fraud",
      "score": 0,
      "num_comments": 3,
      "author": "lasrgv",
      "created_utc": 1714827058.0,
      "created_readable_utc": "2024-05-04 12:50:58 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cjzm2g/immigration_case_involving_parents_with_previous/",
      "permalink": "https://reddit.com/r/immigration/comments/1cjzm2g/immigration_case_involving_parents_with_previous/",
      "selftext": "Hello everyone,\n\nI'll start off by saying I am getting a lawyer due to the complexity of the case but I'm looking for advice / questions to ask on how to address an immigration case involving my parents, both natives of Mexico with a long history in the U.S., but facing challenges due to past legal issues and misinformation. \n\nHere’s a brief overview:\n\n**Background:**\n\n* **Clients:** My parents, who have two adult children who are U.S. citizens (ages 21 and 30).\n* **History:** They arrived in the U.S. in November 1989. They were involved in removal proceedings in 2004 due to unauthorized presence and represented themselves after being misled by notario fraud.\n* **Current Status:** The judge in 2004 ordered voluntary departure for my mother and removal for my father (who had a prior removal and returned following an expedited removal order). The Board of Immigration Appeals affirmed these decisions.\n* **Additional Info:** \n   * They have been in the U.S. continuously since their respective arrivals (my mother since 1989, my father since 1999 after a brief departure 10 days in which he received the Expedited Removal Order). \n   * [The California Bar had taken possession of their files from the notario as part of a fraud case and was returned to them in 2018.](https://www.calbar.ca.gov/About-Us/News/News-Releases/state-bar-helps-clients-of-bogus-immigration-law-practice#:~:text=On%20April%2010%2C%20Bonilla%20pleaded,to%20additional%20fines%20and%20penalties) I barely came across the letter from the Bar and seek help. They had at the time of the letter gone to a lawyer who told them to wait as Immigration Reform was possible soon (lol) where my father would not have to serve the bar..\n      *  [Since then USCIS has mentioned bars may be served in the United Stated. ](https://www.ilrc.org/sites/default/files/2023-08/USCIS%20%26%20BIA%20Affirm%20Three-%20and%20Ten-Year%20Unlawful%20Presence%20Bars%20Can%20Run%20in%20the%20US.pdf)\n\n**Desired Outcome:**\n\nWe wish to explore all possible legal avenues to allow either them to remain in the U.S. legally and adjust their status, potentially under I-130 petitions, as both qualify for immediate visas with U.S. citizen children over 21.\n\n**Main Questions:**\n\n1. **Reopening the Case:** What are the prospects and procedures for potentially reopening my father's case based on ineffective counsel due to notario fraud? What evidence would be required?\n2. **Waivers and Legal Barriers:** What specific waivers (e.g., I-601A, I-212, Form I-485) are necessary for each parent, considering their past immigration history and current status?\n3. **Legal Strategies:** Are there particular legal considerations or strategies that would be effective in navigating their complex situation, especially given the permanent bar and voluntary departure issues? \n\nAny insights, advice, or recommendations for legal resources and immigration experts who specialize in similar cases would be deeply appreciated. Thank you in advance for your help!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.33,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": "California"
      },
      "sex": null,
      "document": "Reopening removal case / waivers (I-601A, I-212) / I-130 / I-485"
    },
    {
      "id": "1cjjpc0",
      "title": "Do I need to fill out and bring DS-2029 to the CRBA interview if I already filled out the eCRBA online?",
      "score": 1,
      "num_comments": 8,
      "author": "keliwin",
      "created_utc": 1714771799.0,
      "created_readable_utc": "2024-05-03 21:29:59 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cjjpc0/do_i_need_to_fill_out_and_bring_ds2029_to_the/",
      "permalink": "https://reddit.com/r/immigration/comments/1cjjpc0/do_i_need_to_fill_out_and_bring_ds2029_to_the/",
      "selftext": "Hi all,\n\nMy wife & I have given birth to a baby girl 2 months ago abroad in Europe and we will have the CRBA interview next week. One of the things we need to bring to the interview is: \n\n\"□ Completed **“Application for Consular Report of Birth” (Please find attached the DS-2029 Form)**.  ***DO NOT SIGN***\"\n\nBut we have already filled out the eCRBA online and is in the status of **\"Response Required - Schedule Interview\".** Would printing out the eCRBA along with the application number be enough to satisfy this requirement or we also need to print and fill out the DS-2029 as well?\n\nThanks! ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 1.0,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Europe",
        "state": null
      },
      "sex": "Hombre",
      "document": "CRBA / DS-2029 / eCRBA"
    },
    {
      "id": "1cim08a",
      "title": "Dual citizenship ",
      "score": 11,
      "num_comments": 7,
      "author": "PartyOrganization136",
      "created_utc": 1714672231.0,
      "created_readable_utc": "2024-05-02 17:50:31 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cim08a/dual_citizenship/",
      "permalink": "https://reddit.com/r/immigration/comments/1cim08a/dual_citizenship/",
      "selftext": "I was born in the Us to Mexican parents. I have spent all my life in the us, sans vacations to visit relatives in Mexico. However, since my siblings and parents all immigrated here (I’m the only one born here) I have always been raised in Mexican customs. As a result, I’ve been debating pursuing dual citizenship. I have a family of my own and am settled here, but I’d like the option of still holding a Mexican passport for future use. \n\nHere’s where it’s tricky. My parents divorced when I was little so while my dad is alive, we haven’t ever had a good/close relationship so I don’t feel comfortable enough to ask him to provide a birth certificate from him or any other legal documents. My mom and I had a falling out over a year ago and haven’t spoken since, so again I don’t have an option to ask for her to help me with documents. Is there a way to attain dual citzenship (American and mexican) without having to go through my parents more or less. ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.87,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "Mexican citizenship / Mexican passport / parents' birth certificates"
    },
    {
      "id": "1cgwubd",
      "title": "Trying to get Duel Citizenship",
      "score": 0,
      "num_comments": 10,
      "author": "Think-Key8178",
      "created_utc": 1714493861.0,
      "created_readable_utc": "2024-04-30 16:17:41 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cgwubd/trying_to_get_duel_citizenship/",
      "permalink": "https://reddit.com/r/immigration/comments/1cgwubd/trying_to_get_duel_citizenship/",
      "selftext": "UPDATE: I was able to look into correcting my mothers name using her Mexican Birth Certificate as proof. I just mailed my forms to the California Department of Public Health as they have a process called \"Application to Amend a Birth Record.\" For anyone in the same situation, it was super easy I called and told them the situation and they accept foreign birth certificates. Just sent it in today so hopefully hear a response within the next months! Super excited for the next steps. \n\n\n\nI've been looking all over youtube, and have went to my local Mexican consulate. I am trying to obtain my Mexican citizenship through my mother. She was born in Mexico and has a Mexican Birth Certificate. However, when she immigrated over here, she left out her first name on documents and used her middle name as her first name. Because of this her name on my \"Mother\" section of my US birth certificate is different from the name on her Mexican Birth Certificate and the consulate told me that I needed to fix that.\n\nI am from California, so I reached out to DNE however I know that will be expensive. If anyone has any  advice/ next steps I would greatly appreciate it. Worst case scenario, my mother will have to change her name, however, I'm worried about the repercussions that come with that.\n\nThank you!",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.33,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": "California"
      },
      "sex": null,
      "document": "Mexican citizenship / birth certificate amendment / name discrepancy"
    },
    {
      "id": "1cfjrqi",
      "title": "Can I work for Homeland Security ",
      "score": 0,
      "num_comments": 3,
      "author": "dear_difficulty01",
      "created_utc": 1714345155.0,
      "created_readable_utc": "2024-04-28 22:59:15 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cfjrqi/can_i_work_for_homeland_security/",
      "permalink": "https://reddit.com/r/immigration/comments/1cfjrqi/can_i_work_for_homeland_security/",
      "selftext": "Hi Reddit, I am looking for some advice as I am currently trying to apply for schools. So a dream career of mine has been to work in anti sex trafficking. As I did more research I realized I wanted to work specifically on the US/Mexico border as it is currently a major issue there. The problem is that I have an undocumented parent and was wondering if you guys know if this would completely stop my chance of getting a job in Homeland Security. I am trying to fix papers for her but because there was a mistake on my birth certificate that has to get fixed first.  Thanks in advance.",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.5,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "Homeland Security employment / birth certificate"
    },
    {
      "id": "1cd3pn9",
      "title": "Applying for green card after serving 5 year deportation",
      "score": 19,
      "num_comments": 37,
      "author": "PapaSato",
      "created_utc": 1714081381.0,
      "created_readable_utc": "2024-04-25 21:43:01 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1cd3pn9/applying_for_green_card_after_serving_5_year/",
      "permalink": "https://reddit.com/r/immigration/comments/1cd3pn9/applying_for_green_card_after_serving_5_year/",
      "selftext": "I (27M US citizen) met my wife (27F Mexican Citizen) in Texas while she was there ilegally. She entered legally with a tourist visa and a 6 month permit and she had been there 3 years by the time we met in 2017. After dating and living together over a year, we got engaged. After meeting with an immigration lawyer and getting bad advice, we got on a plane and traveled out of the US to her home country of Mexico. We planned to travel together to the US/Mexico border crossing at Laredo Tx with a K1 visa in order to enter legally, get married and live the rest of our life together. However, due to a break in at our apartment back home, I had to fly back to Texas while my fiancé drove up with a family member. When she arrived at the border, my fiancé was asked about the flight she took out of the US two weeks prior and was of course given a 5 year ban from entering the US. \n\n5 years later, we've been married about 5 years, have a 3 year old son born in Mexico, and another child on the way. My only real question is, after serving her deportation and being married the whole time to an american citizen, can she apply for her Green Card without the help of a lawyer? Can I fill out the I-130 form and the 601 waiver and handle all of that on my own and save the almost $10k every lawyer wants to charge to to just file the paperwork. I have spoken to multiple lawyers and they all pretty much admit that they cannot do anything to expedite the process and wont be present to represent her in any interview. Why should we pay the lawyer instead of doing it all myself like when I filled out the eCRBA for my son?\n\n​\n\nTL;DR: Can I apply for my wife's Green Card without the help of a lawyer after she has served a 5 year deportation? ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.81,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Mexico",
        "state": null
      },
      "sex": "Hombre",
      "document": "Green Card / I-130 / I-601 waiver / K1 visa / eCRBA"
    },
    {
      "id": "1c5p75z",
      "title": "proof of citizenship for daughter ",
      "score": 0,
      "num_comments": 6,
      "author": "Roelon1st",
      "created_utc": 1713296343.0,
      "created_readable_utc": "2024-04-16 19:39:03 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1c5p75z/proof_of_citizenship_for_daughter/",
      "permalink": "https://reddit.com/r/immigration/comments/1c5p75z/proof_of_citizenship_for_daughter/",
      "selftext": "Good Afternoon! \n\nI am trying to find a solution for a friends problem.  she is from Central America and has a daughter who currently lives there with family. she herself works in the states and lives in Europe. the father is also from Central America but is a US citizen.  the issue is they split when the child was 1-2 and the father doesn’t want to help at all.  \n\nCurrently the mother wants to bring her daughter with her to Europe for school but the father refuses to sign anything to prove his daughter is a citizen, even though no money is being asked. \n\nWhile there is a birth certificate saying he is a citizen in her home country there seems to be issues as without the fathers cooperation a lot of hands are tied.  can anything be done or is the child stuck until she turns 18? what can be done?\n\nShe has full custody and the father has stated he wants full custody if any help was to be given. \n",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.5,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "Central America",
        "state": null
      },
      "sex": null,
      "document": "US citizenship proof (child abroad) / passport application consent"
    },
    {
      "id": "1c22k97",
      "title": "Please help me is my father a US citizen ",
      "score": 4,
      "num_comments": 38,
      "author": "Pizza0190",
      "created_utc": 1712904797.0,
      "created_readable_utc": "2024-04-12 06:53:17 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1c22k97/please_help_me_is_my_father_a_us_citizen/",
      "permalink": "https://reddit.com/r/immigration/comments/1c22k97/please_help_me_is_my_father_a_us_citizen/",
      "selftext": "So long story short my Grandmother is a US citizen at birth and mt dad isn’t since he was born in Mexico and never claimed US citizenship , recently I came across a policy that says that even if you are born overseas you’re a US citizen from your parents so my question is, is my dad still eligible for this? He immigrated to the US illegally in the year 2007 and I don’t know if this bars him for claiming citizenship ",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.83,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": null,
      "document": "US citizenship (transmission/acquisition)"
    },
    {
      "id": "1bv5oxu",
      "title": "How long does CRBA take to process ?",
      "score": 0,
      "num_comments": 2,
      "author": "Shot_Mathematician44",
      "created_utc": 1712181640.0,
      "created_readable_utc": "2024-04-03 22:00:40 UTC",
      "url": "https://www.reddit.com/r/immigration/comments/1bv5oxu/how_long_does_crba_take_to_process/",
      "permalink": "https://reddit.com/r/immigration/comments/1bv5oxu/how_long_does_crba_take_to_process/",
      "selftext": " Hello my wife is due on June, we dont' have insurance so we are looking at Mexico as an option to give birth, can anyone tell me how long it take to process the Consular Report of Birth Abroad Consular Report of Birth Abroad (CRBA) .   \n\n\nWe only plan to be in Mexico for a few days. We are self employed so we dont't qualify for any assistance.   \n",
      "is_self": true,
      "is_video": false,
      "upvote_ratio": 0.33,
      "stickied": false,
      "spoiler": false,
      "over_18": false,
      "link_flair_text": null,
      "us_president": "Joe Biden",
      "location": {
        "country": "USA",
        "state": null
      },
      "sex": "Hombre",
      "document": "CRBA"
    }
  ]